
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: Niagara

#pragma pack(push, 0x1)

/// Enum /Game/Assets/Packs/UltraDynamicSky/Blueprints/Enum/UDS_VolRT_Mode.UDS_VolRT_Mode
/// Size: 0x01 (1 bytes)
enum class UDS_VolRT_Mode : uint8_t
{
	UDS_VolRT_Mode__NewEnumerator0                                                   = 0,
	UDS_VolRT_Mode__NewEnumerator1                                                   = 1,
	UDS_VolRT_Mode__NewEnumerator2                                                   = 2,
	UDS_VolRT_Mode__NewEnumerator3                                                   = 3
};

/// Enum /Game/Assets/Packs/UltraDynamicSky/Blueprints/Enum/UDS_SkyMode.UDS_SkyMode
/// Size: 0x01 (1 bytes)
enum class UDS_SkyMode : uint8_t
{
	UDS_SkyMode__NewEnumerator0                                                      = 0,
	UDS_SkyMode__NewEnumerator6                                                      = 1,
	UDS_SkyMode__NewEnumerator1                                                      = 2,
	UDS_SkyMode__NewEnumerator4                                                      = 3,
	UDS_SkyMode__NewEnumerator8                                                      = 4
};

/// Enum /Game/Assets/Packs/UltraDynamicSky/Blueprints/Enum/UDS_SkyLightMode.UDS_SkyLightMode
/// Size: 0x01 (1 bytes)
enum class UDS_SkyLightMode : uint8_t
{
	UDS_SkyLightMode__NewEnumerator0                                                 = 0,
	UDS_SkyLightMode__NewEnumerator1                                                 = 1,
	UDS_SkyLightMode__NewEnumerator2                                                 = 2
};

/// Enum /Game/Assets/Packs/UltraDynamicSky/Blueprints/Enum/UDS_PropertyType.UDS_PropertyType
/// Size: 0x01 (1 bytes)
enum class UDS_PropertyType : uint8_t
{
	UDS_PropertyType__NewEnumerator0                                                 = 0,
	UDS_PropertyType__NewEnumerator1                                                 = 1,
	UDS_PropertyType__NewEnumerator2                                                 = 2,
	UDS_PropertyType__NewEnumerator3                                                 = 3,
	UDS_PropertyType__NewEnumerator4                                                 = 4,
	UDS_PropertyType__NewEnumerator5                                                 = 5,
	UDS_PropertyType__NewEnumerator10                                                = 6,
	UDS_PropertyType__NewEnumerator6                                                 = 7,
	UDS_PropertyType__NewEnumerator11                                                = 8,
	UDS_PropertyType__NewEnumerator13                                                = 9
};

/// Enum /Game/Assets/Packs/UltraDynamicSky/Blueprints/Enum/UDS_NoiseType.UDS_NoiseType
/// Size: 0x01 (1 bytes)
enum class UDS_NoiseType : uint8_t
{
	UDS_NoiseType__NewEnumerator2                                                    = 0,
	UDS_NoiseType__NewEnumerator4                                                    = 1,
	UDS_NoiseType__NewEnumerator3                                                    = 2
};

/// Enum /Game/Assets/Packs/UltraDynamicSky/Blueprints/Enum/UDS_LensFlareType.UDS_LensFlareType
/// Size: 0x01 (1 bytes)
enum class UDS_LensFlareType : uint8_t
{
	UDS_LensFlareType__NewEnumerator0                                                = 0,
	UDS_LensFlareType__NewEnumerator1                                                = 1,
	UDS_LensFlareType__NewEnumerator2                                                = 2
};

/// Enum /Game/Assets/Packs/UltraDynamicSky/Blueprints/Enum/UDS_FogColorMode.UDS_FogColorMode
/// Size: 0x01 (1 bytes)
enum class UDS_FogColorMode : uint8_t
{
	UDS_FogColorMode__NewEnumerator2                                                 = 0,
	UDS_FogColorMode__NewEnumerator0                                                 = 1,
	UDS_FogColorMode__NewEnumerator1                                                 = 2
};

/// Enum /Game/Assets/Packs/UltraDynamicSky/Blueprints/Enum/UDS_FeatureToggle.UDS_FeatureToggle
/// Size: 0x01 (1 bytes)
enum class UDS_FeatureToggle : uint8_t
{
	UDS_FeatureToggle__NewEnumerator0                                                = 0,
	UDS_FeatureToggle__NewEnumerator1                                                = 1,
	UDS_FeatureToggle__NewEnumerator2                                                = 2
};

/// Enum /Game/Assets/Packs/UltraDynamicSky/Blueprints/Enum/UDS_ColorMode.UDS_ColorMode
/// Size: 0x01 (1 bytes)
enum class UDS_ColorMode : uint8_t
{
	UDS_ColorMode__NewEnumerator0                                                    = 0,
	UDS_ColorMode__NewEnumerator1                                                    = 1
};

/// Enum /Game/Assets/Packs/UltraDynamicSky/Blueprints/Enum/UDS_CityPresets.UDS_CityPresets
/// Size: 0x01 (1 bytes)
enum class UDS_CityPresets : uint8_t
{
	UDS_CityPresets__NewEnumerator0                                                  = 0,
	UDS_CityPresets__NewEnumerator1                                                  = 1,
	UDS_CityPresets__NewEnumerator2                                                  = 2,
	UDS_CityPresets__NewEnumerator3                                                  = 3,
	UDS_CityPresets__NewEnumerator4                                                  = 4,
	UDS_CityPresets__NewEnumerator5                                                  = 5,
	UDS_CityPresets__NewEnumerator6                                                  = 6,
	UDS_CityPresets__NewEnumerator7                                                  = 7,
	UDS_CityPresets__NewEnumerator8                                                  = 8,
	UDS_CityPresets__NewEnumerator9                                                  = 9,
	UDS_CityPresets__NewEnumerator10                                                 = 10,
	UDS_CityPresets__NewEnumerator11                                                 = 11,
	UDS_CityPresets__NewEnumerator12                                                 = 12,
	UDS_CityPresets__NewEnumerator13                                                 = 13,
	UDS_CityPresets__NewEnumerator14                                                 = 14,
	UDS_CityPresets__NewEnumerator15                                                 = 15,
	UDS_CityPresets__NewEnumerator16                                                 = 16,
	UDS_CityPresets__NewEnumerator17                                                 = 17,
	UDS_CityPresets__NewEnumerator18                                                 = 18,
	UDS_CityPresets__NewEnumerator19                                                 = 19,
	UDS_CityPresets__NewEnumerator20                                                 = 20,
	UDS_CityPresets__NewEnumerator21                                                 = 21,
	UDS_CityPresets__NewEnumerator22                                                 = 22,
	UDS_CityPresets__NewEnumerator23                                                 = 23,
	UDS_CityPresets__NewEnumerator24                                                 = 24,
	UDS_CityPresets__NewEnumerator25                                                 = 25,
	UDS_CityPresets__NewEnumerator26                                                 = 26,
	UDS_CityPresets__NewEnumerator27                                                 = 27,
	UDS_CityPresets__NewEnumerator28                                                 = 28,
	UDS_CityPresets__NewEnumerator29                                                 = 29,
	UDS_CityPresets__NewEnumerator30                                                 = 30,
	UDS_CityPresets__NewEnumerator31                                                 = 31,
	UDS_CityPresets__NewEnumerator32                                                 = 32,
	UDS_CityPresets__NewEnumerator33                                                 = 33,
	UDS_CityPresets__NewEnumerator34                                                 = 34,
	UDS_CityPresets__NewEnumerator35                                                 = 35,
	UDS_CityPresets__NewEnumerator36                                                 = 36,
	UDS_CityPresets__NewEnumerator37                                                 = 37,
	UDS_CityPresets__NewEnumerator38                                                 = 38,
	UDS_CityPresets__NewEnumerator39                                                 = 39,
	UDS_CityPresets__NewEnumerator40                                                 = 40,
	UDS_CityPresets__NewEnumerator41                                                 = 41,
	UDS_CityPresets__NewEnumerator42                                                 = 42,
	UDS_CityPresets__NewEnumerator43                                                 = 43,
	UDS_CityPresets__NewEnumerator44                                                 = 44,
	UDS_CityPresets__NewEnumerator45                                                 = 45,
	UDS_CityPresets__NewEnumerator46                                                 = 46,
	UDS_CityPresets__NewEnumerator47                                                 = 47,
	UDS_CityPresets__NewEnumerator48                                                 = 48,
	UDS_CityPresets__NewEnumerator49                                                 = 49,
	UDS_CityPresets__NewEnumerator50                                                 = 50,
	UDS_CityPresets__NewEnumerator51                                                 = 51,
	UDS_CityPresets__NewEnumerator52                                                 = 52,
	UDS_CityPresets__NewEnumerator53                                                 = 53,
	UDS_CityPresets__NewEnumerator54                                                 = 54,
	UDS_CityPresets__NewEnumerator55                                                 = 55,
	UDS_CityPresets__NewEnumerator56                                                 = 56,
	UDS_CityPresets__NewEnumerator57                                                 = 57,
	UDS_CityPresets__NewEnumerator58                                                 = 58,
	UDS_CityPresets__NewEnumerator59                                                 = 59,
	UDS_CityPresets__NewEnumerator60                                                 = 60,
	UDS_CityPresets__NewEnumerator61                                                 = 61,
	UDS_CityPresets__NewEnumerator62                                                 = 62,
	UDS_CityPresets__NewEnumerator63                                                 = 63,
	UDS_CityPresets__NewEnumerator64                                                 = 64,
	UDS_CityPresets__NewEnumerator65                                                 = 65,
	UDS_CityPresets__NewEnumerator66                                                 = 66,
	UDS_CityPresets__NewEnumerator67                                                 = 67,
	UDS_CityPresets__NewEnumerator68                                                 = 68,
	UDS_CityPresets__NewEnumerator69                                                 = 69,
	UDS_CityPresets__NewEnumerator70                                                 = 70,
	UDS_CityPresets__NewEnumerator71                                                 = 71,
	UDS_CityPresets__NewEnumerator72                                                 = 72,
	UDS_CityPresets__NewEnumerator73                                                 = 73,
	UDS_CityPresets__NewEnumerator74                                                 = 74,
	UDS_CityPresets__NewEnumerator75                                                 = 75,
	UDS_CityPresets__NewEnumerator76                                                 = 76,
	UDS_CityPresets__NewEnumerator77                                                 = 77,
	UDS_CityPresets__NewEnumerator78                                                 = 78,
	UDS_CityPresets__NewEnumerator79                                                 = 79,
	UDS_CityPresets__NewEnumerator80                                                 = 80,
	UDS_CityPresets__NewEnumerator81                                                 = 81,
	UDS_CityPresets__NewEnumerator82                                                 = 82,
	UDS_CityPresets__NewEnumerator83                                                 = 83,
	UDS_CityPresets__NewEnumerator84                                                 = 84,
	UDS_CityPresets__NewEnumerator85                                                 = 85,
	UDS_CityPresets__NewEnumerator86                                                 = 86,
	UDS_CityPresets__NewEnumerator87                                                 = 87,
	UDS_CityPresets__NewEnumerator104                                                = 88,
	UDS_CityPresets__NewEnumerator88                                                 = 89,
	UDS_CityPresets__NewEnumerator89                                                 = 90,
	UDS_CityPresets__NewEnumerator90                                                 = 91,
	UDS_CityPresets__NewEnumerator91                                                 = 92,
	UDS_CityPresets__NewEnumerator92                                                 = 93,
	UDS_CityPresets__NewEnumerator93                                                 = 94,
	UDS_CityPresets__NewEnumerator94                                                 = 95,
	UDS_CityPresets__NewEnumerator95                                                 = 96,
	UDS_CityPresets__NewEnumerator96                                                 = 97,
	UDS_CityPresets__NewEnumerator97                                                 = 98,
	UDS_CityPresets__NewEnumerator98                                                 = 99,
	UDS_CityPresets__NewEnumerator99                                                 = 100,
	UDS_CityPresets__NewEnumerator100                                                = 101,
	UDS_CityPresets__NewEnumerator101                                                = 102,
	UDS_CityPresets__NewEnumerator102                                                = 103,
	UDS_CityPresets__NewEnumerator103                                                = 104,
	UDS_CityPresets__NewEnumerator105                                                = 105,
	UDS_CityPresets__NewEnumerator106                                                = 106,
	UDS_CityPresets__NewEnumerator107                                                = 107,
	UDS_CityPresets__NewEnumerator108                                                = 108,
	UDS_CityPresets__NewEnumerator109                                                = 109,
	UDS_CityPresets__NewEnumerator110                                                = 110,
	UDS_CityPresets__NewEnumerator111                                                = 111,
	UDS_CityPresets__NewEnumerator112                                                = 112,
	UDS_CityPresets__NewEnumerator113                                                = 113,
	UDS_CityPresets__NewEnumerator114                                                = 114,
	UDS_CityPresets__NewEnumerator115                                                = 115,
	UDS_CityPresets__NewEnumerator116                                                = 116,
	UDS_CityPresets__NewEnumerator117                                                = 117,
	UDS_CityPresets__NewEnumerator118                                                = 118,
	UDS_CityPresets__NewEnumerator119                                                = 119,
	UDS_CityPresets__NewEnumerator120                                                = 120,
	UDS_CityPresets__NewEnumerator121                                                = 121,
	UDS_CityPresets__NewEnumerator122                                                = 122,
	UDS_CityPresets__NewEnumerator123                                                = 123,
	UDS_CityPresets__NewEnumerator124                                                = 124,
	UDS_CityPresets__NewEnumerator125                                                = 125,
	UDS_CityPresets__NewEnumerator126                                                = 126,
	UDS_CityPresets__NewEnumerator127                                                = 127,
	UDS_CityPresets__NewEnumerator128                                                = 128,
	UDS_CityPresets__NewEnumerator129                                                = 129,
	UDS_CityPresets__NewEnumerator130                                                = 130,
	UDS_CityPresets__NewEnumerator131                                                = 131,
	UDS_CityPresets__NewEnumerator132                                                = 132,
	UDS_CityPresets__NewEnumerator133                                                = 133,
	UDS_CityPresets__NewEnumerator134                                                = 134,
	UDS_CityPresets__NewEnumerator135                                                = 135,
	UDS_CityPresets__NewEnumerator136                                                = 136,
	UDS_CityPresets__NewEnumerator137                                                = 137,
	UDS_CityPresets__NewEnumerator138                                                = 138,
	UDS_CityPresets__NewEnumerator139                                                = 139,
	UDS_CityPresets__NewEnumerator140                                                = 140,
	UDS_CityPresets__NewEnumerator141                                                = 141,
	UDS_CityPresets__NewEnumerator142                                                = 142,
	UDS_CityPresets__NewEnumerator143                                                = 143,
	UDS_CityPresets__NewEnumerator144                                                = 144
};

/// Enum /Game/Assets/Packs/UltraDynamicSky/Blueprints/Enum/UDS_CachedProperties.UDS_CachedProperties
/// Size: 0x01 (1 bytes)
enum class UDS_CachedProperties : uint8_t
{
	UDS_CachedProperties__NewEnumerator0                                             = 0,
	UDS_CachedProperties__NewEnumerator1                                             = 1,
	UDS_CachedProperties__NewEnumerator3                                             = 2,
	UDS_CachedProperties__NewEnumerator4                                             = 3,
	UDS_CachedProperties__NewEnumerator5                                             = 4,
	UDS_CachedProperties__NewEnumerator6                                             = 5,
	UDS_CachedProperties__NewEnumerator7                                             = 6,
	UDS_CachedProperties__NewEnumerator8                                             = 7,
	UDS_CachedProperties__NewEnumerator9                                             = 8,
	UDS_CachedProperties__NewEnumerator10                                            = 9,
	UDS_CachedProperties__NewEnumerator11                                            = 10,
	UDS_CachedProperties__NewEnumerator12                                            = 11,
	UDS_CachedProperties__NewEnumerator13                                            = 12,
	UDS_CachedProperties__NewEnumerator14                                            = 13,
	UDS_CachedProperties__NewEnumerator15                                            = 14,
	UDS_CachedProperties__NewEnumerator16                                            = 15,
	UDS_CachedProperties__NewEnumerator17                                            = 16,
	UDS_CachedProperties__NewEnumerator18                                            = 17,
	UDS_CachedProperties__NewEnumerator19                                            = 18,
	UDS_CachedProperties__NewEnumerator20                                            = 19,
	UDS_CachedProperties__NewEnumerator21                                            = 20,
	UDS_CachedProperties__NewEnumerator22                                            = 21,
	UDS_CachedProperties__NewEnumerator23                                            = 22,
	UDS_CachedProperties__NewEnumerator24                                            = 23,
	UDS_CachedProperties__NewEnumerator25                                            = 24,
	UDS_CachedProperties__NewEnumerator26                                            = 25,
	UDS_CachedProperties__NewEnumerator27                                            = 26,
	UDS_CachedProperties__NewEnumerator29                                            = 27,
	UDS_CachedProperties__NewEnumerator30                                            = 28,
	UDS_CachedProperties__NewEnumerator31                                            = 29,
	UDS_CachedProperties__NewEnumerator32                                            = 30,
	UDS_CachedProperties__NewEnumerator33                                            = 31,
	UDS_CachedProperties__NewEnumerator34                                            = 32,
	UDS_CachedProperties__NewEnumerator35                                            = 33,
	UDS_CachedProperties__NewEnumerator36                                            = 34,
	UDS_CachedProperties__NewEnumerator37                                            = 35,
	UDS_CachedProperties__NewEnumerator38                                            = 36,
	UDS_CachedProperties__NewEnumerator39                                            = 37,
	UDS_CachedProperties__NewEnumerator40                                            = 38,
	UDS_CachedProperties__NewEnumerator41                                            = 39,
	UDS_CachedProperties__NewEnumerator42                                            = 40,
	UDS_CachedProperties__NewEnumerator43                                            = 41,
	UDS_CachedProperties__NewEnumerator44                                            = 42,
	UDS_CachedProperties__NewEnumerator45                                            = 43,
	UDS_CachedProperties__NewEnumerator46                                            = 44,
	UDS_CachedProperties__NewEnumerator50                                            = 45,
	UDS_CachedProperties__NewEnumerator51                                            = 46,
	UDS_CachedProperties__NewEnumerator52                                            = 47,
	UDS_CachedProperties__NewEnumerator53                                            = 48,
	UDS_CachedProperties__NewEnumerator54                                            = 49,
	UDS_CachedProperties__NewEnumerator55                                            = 50,
	UDS_CachedProperties__NewEnumerator56                                            = 51,
	UDS_CachedProperties__NewEnumerator57                                            = 52,
	UDS_CachedProperties__NewEnumerator58                                            = 53,
	UDS_CachedProperties__NewEnumerator61                                            = 54,
	UDS_CachedProperties__NewEnumerator62                                            = 55,
	UDS_CachedProperties__NewEnumerator63                                            = 56,
	UDS_CachedProperties__NewEnumerator64                                            = 57,
	UDS_CachedProperties__NewEnumerator65                                            = 58,
	UDS_CachedProperties__NewEnumerator66                                            = 59,
	UDS_CachedProperties__NewEnumerator67                                            = 60,
	UDS_CachedProperties__NewEnumerator68                                            = 61,
	UDS_CachedProperties__NewEnumerator69                                            = 62,
	UDS_CachedProperties__NewEnumerator70                                            = 63,
	UDS_CachedProperties__NewEnumerator71                                            = 64,
	UDS_CachedProperties__NewEnumerator72                                            = 65,
	UDS_CachedProperties__NewEnumerator74                                            = 66,
	UDS_CachedProperties__NewEnumerator75                                            = 67,
	UDS_CachedProperties__NewEnumerator76                                            = 68,
	UDS_CachedProperties__NewEnumerator77                                            = 69,
	UDS_CachedProperties__NewEnumerator78                                            = 70,
	UDS_CachedProperties__NewEnumerator79                                            = 71,
	UDS_CachedProperties__NewEnumerator80                                            = 72,
	UDS_CachedProperties__NewEnumerator82                                            = 73,
	UDS_CachedProperties__NewEnumerator83                                            = 74,
	UDS_CachedProperties__NewEnumerator84                                            = 75,
	UDS_CachedProperties__NewEnumerator85                                            = 76,
	UDS_CachedProperties__NewEnumerator86                                            = 77,
	UDS_CachedProperties__NewEnumerator87                                            = 78,
	UDS_CachedProperties__NewEnumerator88                                            = 79,
	UDS_CachedProperties__NewEnumerator89                                            = 80,
	UDS_CachedProperties__NewEnumerator90                                            = 81,
	UDS_CachedProperties__NewEnumerator91                                            = 82,
	UDS_CachedProperties__NewEnumerator92                                            = 83,
	UDS_CachedProperties__NewEnumerator97                                            = 84,
	UDS_CachedProperties__NewEnumerator99                                            = 85,
	UDS_CachedProperties__NewEnumerator100                                           = 86,
	UDS_CachedProperties__NewEnumerator101                                           = 87,
	UDS_CachedProperties__NewEnumerator102                                           = 88,
	UDS_CachedProperties__NewEnumerator103                                           = 89,
	UDS_CachedProperties__NewEnumerator105                                           = 90,
	UDS_CachedProperties__NewEnumerator107                                           = 91,
	UDS_CachedProperties__NewEnumerator108                                           = 92,
	UDS_CachedProperties__NewEnumerator109                                           = 93,
	UDS_CachedProperties__NewEnumerator110                                           = 94,
	UDS_CachedProperties__NewEnumerator111                                           = 95,
	UDS_CachedProperties__NewEnumerator112                                           = 96
};

/// Class /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/UDS_Weather_Settings.UDS_Weather_Settings_C
/// Size: 0x0080 (128 bytes) (0x000030 - 0x000080) align 8 MaxSize: 0x0080
class UUDS_Weather_Settings_C : public UPrimaryDataAsset
{ 
public:
	double                                             Cloud_Coverage;                                             // 0x0030   (0x0008)  
	double                                             Rain;                                                       // 0x0038   (0x0008)  
	double                                             Snow;                                                       // 0x0040   (0x0008)  
	double                                             Thunder_Lightning;                                          // 0x0048   (0x0008)  
	double                                             Wind_Intensity;                                             // 0x0050   (0x0008)  
	double                                             Fog;                                                        // 0x0058   (0x0008)  
	double                                             Dust;                                                       // 0x0060   (0x0008)  
	double                                             Material_Wetness;                                           // 0x0068   (0x0008)  
	double                                             Material_Snow_Coverage;                                     // 0x0070   (0x0008)  
	double                                             Material_Dust_Coverage;                                     // 0x0078   (0x0008)  
};

/// Class /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UUltra_Dynamic_Weather_Interface_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Hard Refresh Cached Properties
	// void HardRefreshCachedProperties();                                                                                      // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Destroy Close Thunder Component
	// void DestroyCloseThunderComponent(class USceneComponent* Component);                                                     // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Get Close Thunder Sound Occlusion
	// void GetCloseThunderSoundOcclusion(double& Volume, double& LPF);                                                         // [0x2c97800] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Update Rainbow Angle
	// void UpdateRainbowAngle();                                                                                               // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Update Material Effects
	// void UpdateMaterialEffects();                                                                                            // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Apply State
	// void ApplyState(FUDS_and_UDW_State State);                                                                               // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Get State for Saving
	// void GetStateforSaving(FUDS_and_UDW_State& UDWState);                                                                    // [0x2c97800] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Get Intended Cloud Direction
	// void GetIntendedCloudDirection(double& IntendedCloudDirection);                                                          // [0x2c97800] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Get Intended Cloud Speed
	// void GetIntendedCloudSpeed(double& IntendedCloudSpeed);                                                                  // [0x2c97800] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Update Weather Settings from UDS
	// void UpdateWeatherSettingsfromUDS(double CloudCoverage, double Fog, double Dust);                                        // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Initialize Weather
	// void InitializeWeather();                                                                                                // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Weather_Effects/System/Ultra_Dynamic_Weather_Interface.Ultra_Dynamic_Weather_Interface_C.Set Season
	// void SetSeason();                                                                                                        // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Assets/Packs/UltraDynamicSky/Blueprints/System/UDS_PlayerOcclusion.UDS_PlayerOcclusion_C
/// Size: 0x013A (314 bytes) (0x0000A0 - 0x00013A) align 8 MaxSize: 0x013A
class UUDS_PlayerOcclusion_C : public UActorComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A0   (0x0008)  
	FVector                                            Occlusion_Location;                                         // 0x00A8   (0x0018)  
	double                                             Max_Interior_Occlusion_Distance;                            // 0x00C0   (0x0008)  
	TEnumAsByte<ETraceTypeQuery>                       Occlusion_Trace_Channel;                                    // 0x00C8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00C9   (0x0007)  MISSED
	TArray<double>                                     Target_Occlusion_Profile;                                   // 0x00D0   (0x0010)  
	double                                             Occlusion_Update_Period;                                    // 0x00E0   (0x0008)  
	TArray<double>                                     Current_Occlusion_Profile;                                  // 0x00E8   (0x0010)  
	FVector                                            Rain_Velocity;                                              // 0x00F8   (0x0018)  
	bool                                               Calculate_Rain_Occlusion;                                   // 0x0110   (0x0001)  
	bool                                               Running;                                                    // 0x0111   (0x0001)  
	bool                                               Acquire_Camera_Location;                                    // 0x0112   (0x0001)  
	unsigned char                                      UnknownData01_6[0x5];                                       // 0x0113   (0x0005)  MISSED
	double                                             Inverted_Global_Occlusion;                                  // 0x0118   (0x0008)  
	double                                             Full_Occluded_Percent;                                      // 0x0120   (0x0008)  
	double                                             Not_Occluded_Percent;                                       // 0x0128   (0x0008)  
	double                                             Water_Level;                                                // 0x0130   (0x0008)  
	bool                                               Use_Water_Level;                                            // 0x0138   (0x0001)  
	bool                                               Force_Full_Occlusion;                                       // 0x0139   (0x0001)  


	/// Functions
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/System/UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Get Occlusion Location
	// void GetOcclusionLocation();                                                                                             // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/System/UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Get Starting Occlusion Profile
	// void GetStartingOcclusionProfile();                                                                                      // [0x2c97800] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/System/UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Initialize
	// void Initialize();                                                                                                       // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/System/UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Update Current Occlusion Profile
	// void UpdateCurrentOcclusionProfile();                                                                                    // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/System/UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Update Target Occlusion Profile
	// void UpdateTargetOcclusionProfile();                                                                                     // [0x2c97800] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/System/UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/System/UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.ExecuteUbergraph_UDS_PlayerOcclusion
	// void ExecuteUbergraph_UDS_PlayerOcclusion(int32_t EntryPoint);                                                           // [0x2c97800] Final                
};

/// Struct /Game/Assets/Packs/UltraDynamicSky/Blueprints/System/UDS_Post_Process_Stage.UDS_Post_Process_Stage
/// Size: 0x0708 (1800 bytes) (0x000000 - 0x000708) align 16 MaxSize: 0x0708
struct FUDS_Post_Process_Stage
{ 
	FString                                            Label_24_760DA3B649F655929138B7846A0B840F;                  // 0x0000   (0x0010)  
	FPostProcessSettings                               PostProcessSettings_25_E746F2674432B2790E7147B9B9D48686;    // 0x0010   (0x06E0)  
	bool                                               DisableDuringDay_60_6A0C0A844D25727B201270B8E6794534;       // 0x06F0   (0x0001)  
	bool                                               DisableatDawnDusk_61_D0DA84F840D05C7DA0D7B49A2E6743C4;      // 0x06F1   (0x0001)  
	bool                                               DisableatNight_62_1D5FD8DD4142C2B92FFCEFBE2A0E581F;         // 0x06F2   (0x0001)  
	bool                                               DisableifOvercast_52_989272994F5025F12C728292C335B969;      // 0x06F3   (0x0001)  
	bool                                               DisableifNotOvercast_53_D95A77BB4DB1672F50FDC6B817C28515;   // 0x06F4   (0x0001)  
	bool                                               DisableifFoggy_54_539D2C7E4D2FD2EB58A526993DBB4A10;         // 0x06F5   (0x0001)  
	bool                                               DisableifNotFoggy_55_34F8C6474E89F3CB3996E78C6CEF2907;      // 0x06F6   (0x0001)  
	bool                                               DisableifDusty_56_0044404B424580AF8096A6B8CD97F80F;         // 0x06F7   (0x0001)  
	bool                                               DisableifNotDusty_57_B002D3174D9C870BA261FCA71ADF2E02;      // 0x06F8   (0x0001)  
	bool                                               DisableifInsideInterior_58_8D9B008146005C1946D6B4B9F02F9C83; // 0x06F9   (0x0001)  
	bool                                               DisableifOutsideInterior_59_BF184CAA469ECC2CC17795A644DA512E; // 0x06FA   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x06FB   (0x0005)  MISSED
	double                                             Priority_47_5B0BDA844B69DB2E7768168865CD16E0;               // 0x0700   (0x0008)  
};

/// Class /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C
/// Size: 0x1758 (5976 bytes) (0x000290 - 0x001758) align 8 MaxSize: 0x1758
class AUltra_Dynamic_Sky_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	class UUDS_PlayerOcclusion_C*                      Player_Occlusion;                                           // 0x0298   (0x0008)  
	class UPostProcessComponent*                       Cloud_Fog_Post_Process;                                     // 0x02A0   (0x0008)  
	class UArrowComponent*                             Moon_Icon_Arrow;                                            // 0x02A8   (0x0008)  
	class UArrowComponent*                             Sun_Icon_Arrow;                                             // 0x02B0   (0x0008)  
	class UBillboardComponent*                         Sun_Icon;                                                   // 0x02B8   (0x0008)  
	class UBillboardComponent*                         Moon_Icon;                                                  // 0x02C0   (0x0008)  
	class UStaticMeshComponent*                        Overcast_Turbulence;                                        // 0x02C8   (0x0008)  
	class UPostProcessComponent*                       Lens_Flare;                                                 // 0x02D0   (0x0008)  
	class USkyLightComponent*                          Realtime_Capture_Based_Sky_Light;                           // 0x02D8   (0x0008)  
	class UNiagaraComponent*                           Inside_Cloud_Fog;                                           // 0x02E0   (0x0008)  
	class UVolumetricCloudComponent*                   VolumetricAurora;                                           // 0x02E8   (0x0008)  
	class UStaticMeshComponent*                        StaticCloudsSphere;                                         // 0x02F0   (0x0008)  
	class UBillboardComponent*                         Root;                                                       // 0x02F8   (0x0008)  
	class UVolumetricCloudComponent*                   VolumetricCloud;                                            // 0x0300   (0x0008)  
	class USkyLightComponent*                          CubeMap_Sky_Light;                                          // 0x0308   (0x0008)  
	class USkyLightComponent*                          Capture_Based_Sky_Light;                                    // 0x0310   (0x0008)  
	class UPostProcessComponent*                       Exposure;                                                   // 0x0318   (0x0008)  
	class UExponentialHeightFogComponent*              HeightFog;                                                  // 0x0320   (0x0008)  
	class UDirectionalLightComponent*                  Moon;                                                       // 0x0328   (0x0008)  
	class UDirectionalLightComponent*                  Sun;                                                        // 0x0330   (0x0008)  
	class USkyAtmosphereComponent*                     SkyAtmosphere;                                              // 0x0338   (0x0008)  
	class UArrowComponent*                             Moon_Root;                                                  // 0x0340   (0x0008)  
	class UArrowComponent*                             Sun_Root;                                                   // 0x0348   (0x0008)  
	class UStaticMeshComponent*                        Ultra_Dynamic_Sky_Sphere;                                   // 0x0350   (0x0008)  
	TEnumAsByte<UDS_FeatureToggle>                     Sun_Light;                                                  // 0x0358   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0359   (0x0007)  MISSED
	class ADirectionalLight*                           Custom_Sun_Light_Actor;                                     // 0x0360   (0x0008)  
	class UMaterialInstanceDynamic*                    Sky_MID;                                                    // 0x0368   (0x0008)  
	double                                             Cloud_Speed;                                                // 0x0370   (0x0008)  
	double                                             Cloud_Wisps_Opacity__Clear_;                                // 0x0378   (0x0008)  
	bool                                               Refresh_Settings;                                           // 0x0380   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0381   (0x0007)  MISSED
	double                                             Time_of_Day;                                                // 0x0388   (0x0008)  
	TEnumAsByte<UDS_SkyMode>                           Sky_Mode;                                                   // 0x0390   (0x0001)  
	TEnumAsByte<UDS_ColorMode>                         Color_Mode;                                                 // 0x0391   (0x0001)  
	unsigned char                                      UnknownData02_6[0x6];                                       // 0x0392   (0x0006)  MISSED
	double                                             Cloud_Coverage;                                             // 0x0398   (0x0008)  
	double                                             Fog;                                                        // 0x03A0   (0x0008)  
	double                                             Overall_Intensity;                                          // 0x03A8   (0x0008)  
	double                                             Cloud_Direction;                                            // 0x03B0   (0x0008)  
	double                                             Cloud_Phase;                                                // 0x03B8   (0x0008)  
	bool                                               Manually_Position_Moon_Target;                              // 0x03C0   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x03C1   (0x0007)  MISSED
	double                                             Moon_Light_Intensity;                                       // 0x03C8   (0x0008)  
	TEnumAsByte<EComponentMobility>                    Moon_Mobility;                                              // 0x03D0   (0x0001)  
	unsigned char                                      UnknownData04_6[0x7];                                       // 0x03D1   (0x0007)  MISSED
	double                                             Moon_Angle;                                                 // 0x03D8   (0x0008)  
	double                                             Moon_Inclination;                                           // 0x03E0   (0x0008)  
	double                                             Moon_Vertical_Offset;                                       // 0x03E8   (0x0008)  
	double                                             Moon_Orbit_Offset;                                          // 0x03F0   (0x0008)  
	bool                                               Moon_Casts_Shadows;                                         // 0x03F8   (0x0001)  
	unsigned char                                      UnknownData05_6[0x7];                                       // 0x03F9   (0x0007)  MISSED
	double                                             Moon_Scale;                                                 // 0x0400   (0x0008)  
	double                                             Moon_Phase;                                                 // 0x0408   (0x0008)  
	bool                                               Moon_Phase_Changes_Over_Time;                               // 0x0410   (0x0001)  
	unsigned char                                      UnknownData06_6[0x7];                                       // 0x0411   (0x0007)  MISSED
	double                                             Dark_Side_Brightness;                                       // 0x0418   (0x0008)  
	double                                             Moon_Texture_Intensity__Night_;                             // 0x0420   (0x0008)  
	bool                                               Manually_Position_Sun_Target;                               // 0x0428   (0x0001)  
	unsigned char                                      UnknownData07_6[0x7];                                       // 0x0429   (0x0007)  MISSED
	double                                             Sun_Light_Intensity;                                        // 0x0430   (0x0008)  
	TEnumAsByte<EComponentMobility>                    Sun_Mobility;                                               // 0x0438   (0x0001)  
	unsigned char                                      UnknownData08_6[0x7];                                       // 0x0439   (0x0007)  MISSED
	double                                             Sun_Angle;                                                  // 0x0440   (0x0008)  
	bool                                               Animate_Time_of_Day;                                        // 0x0448   (0x0001)  
	unsigned char                                      UnknownData09_6[0x7];                                       // 0x0449   (0x0007)  MISSED
	double                                             Contrast;                                                   // 0x0450   (0x0008)  
	double                                             Sun_Inclination;                                            // 0x0458   (0x0008)  
	double                                             Sun_Vertical_Offset;                                        // 0x0460   (0x0008)  
	bool                                               Sun_Casts_Shadows;                                          // 0x0468   (0x0001)  
	unsigned char                                      UnknownData10_6[0x3];                                       // 0x0469   (0x0003)  MISSED
	FLinearColor                                       Sun_Light_Color;                                            // 0x046C   (0x0010)  
	unsigned char                                      UnknownData11_6[0x4];                                       // 0x047C   (0x0004)  MISSED
	double                                             Moon_Texture_Intensity__Day_;                               // 0x0480   (0x0008)  
	FLinearColor                                       Moon_Light_Color;                                           // 0x0488   (0x0010)  
	double                                             Soften_Cloud_Layer_1;                                       // 0x0498   (0x0008)  
	double                                             Soften_Cloud_Layer_2;                                       // 0x04A0   (0x0008)  
	double                                             Sharpen_Outer_Edge;                                         // 0x04A8   (0x0008)  
	double                                             Stars_Intensity;                                            // 0x04B0   (0x0008)  
	FLinearColor                                       Stars_Color;                                                // 0x04B8   (0x0010)  
	FLinearColor                                       Moon_Material_Color;                                        // 0x04C8   (0x0010)  
	FVector                                            Sun_Target;                                                 // 0x04D8   (0x0018)  
	double                                             Sun_Radius;                                                 // 0x04F0   (0x0008)  
	class UMaterialInstanceDynamic*                    Sun_Cloud_Shadows_MID;                                      // 0x04F8   (0x0008)  
	bool                                               Use_Cloud_Shadows;                                          // 0x0500   (0x0001)  
	unsigned char                                      UnknownData12_6[0x7];                                       // 0x0501   (0x0007)  MISSED
	double                                             Cloud_Shadows_Intensity_When_Sunny;                         // 0x0508   (0x0008)  
	TEnumAsByte<UDS_FeatureToggle>                     Moon_Light;                                                 // 0x0510   (0x0001)  
	unsigned char                                      UnknownData13_6[0x7];                                       // 0x0511   (0x0007)  MISSED
	class ADirectionalLight*                           Custom_Moon_Light_Actor;                                    // 0x0518   (0x0008)  
	double                                             Stars_Speed;                                                // 0x0520   (0x0008)  
	class UMaterialInstanceDynamic*                    Moon_Cloud_Shadows_MID;                                     // 0x0528   (0x0008)  
	double                                             New_Moon_Light_Brightness;                                  // 0x0530   (0x0008)  
	double                                             Moon_Texture_Rotation;                                      // 0x0538   (0x0008)  
	class UTexture2D*                                  Custom_Moon_Texture;                                        // 0x0540   (0x0008)  
	TEnumAsByte<UDS_FeatureToggle>                     Sky_Light;                                                  // 0x0548   (0x0001)  
	unsigned char                                      UnknownData14_6[0x7];                                       // 0x0549   (0x0007)  MISSED
	class ASkyLight*                                   Custom_Sky_Light_Actor;                                     // 0x0550   (0x0008)  
	TEnumAsByte<UDS_FeatureToggle>                     Height_Fog;                                                 // 0x0558   (0x0001)  
	unsigned char                                      UnknownData15_6[0x7];                                       // 0x0559   (0x0007)  MISSED
	class AExponentialHeightFog*                       Custom_Height_Fog_Actor;                                    // 0x0560   (0x0008)  
	TEnumAsByte<UDS_SkyLightMode>                      Sky_Light_Mode;                                             // 0x0568   (0x0001)  
	unsigned char                                      UnknownData16_6[0x7];                                       // 0x0569   (0x0007)  MISSED
	class UCurveFloat*                                 Night_Filter_Curve;                                         // 0x0570   (0x0008)  
	double                                             Moon_Glow_Intensity;                                        // 0x0578   (0x0008)  
	bool                                               Use_Auroras;                                                // 0x0580   (0x0001)  
	unsigned char                                      UnknownData17_6[0x7];                                       // 0x0581   (0x0007)  MISSED
	double                                             Aurora_Intensity;                                           // 0x0588   (0x0008)  
	double                                             Aurora_Speed;                                               // 0x0590   (0x0008)  
	double                                             Cloud_Shadows_Intensity_When_Overcast;                      // 0x0598   (0x0008)  
	double                                             Cloud_Shadows_Softness_When_Sunny;                          // 0x05A0   (0x0008)  
	double                                             Cloud_Shadows_Softness_When_Overcast;                       // 0x05A8   (0x0008)  
	double                                             Cloud_Tiling_Layer_1;                                       // 0x05B0   (0x0008)  
	double                                             Cloud_Tiling_Layer_2;                                       // 0x05B8   (0x0008)  
	double                                             Soften_Horizon;                                             // 0x05C0   (0x0008)  
	bool                                               One_cloud_layer;                                            // 0x05C8   (0x0001)  
	unsigned char                                      UnknownData18_6[0x7];                                       // 0x05C9   (0x0007)  MISSED
	double                                             Cloud_Height_Layer_1;                                       // 0x05D0   (0x0008)  
	double                                             Cloud_Height_Layer_2;                                       // 0x05D8   (0x0008)  
	double                                             Overcast_Swirling_Texture;                                  // 0x05E0   (0x0008)  
	double                                             Saturation;                                                 // 0x05E8   (0x0008)  
	double                                             Directional_Balance;                                        // 0x05F0   (0x0008)  
	double                                             Dawn_Time;                                                  // 0x05F8   (0x0008)  
	double                                             Dusk_Time;                                                  // 0x0600   (0x0008)  
	double                                             Night_Brightness;                                           // 0x0608   (0x0008)  
	double                                             Sun_Softness;                                               // 0x0610   (0x0008)  
	double                                             Sun_Volumetric_Scattering_Intensity;                        // 0x0618   (0x0008)  
	double                                             Moon_Volumetric_Scattering_Intensity;                       // 0x0620   (0x0008)  
	double                                             Aurora_Phase;                                               // 0x0628   (0x0008)  
	class UDirectionalLightComponent*                  Sun_LightComponent;                                         // 0x0630   (0x0008)  
	class UDirectionalLightComponent*                  Moon_LightComponent;                                        // 0x0638   (0x0008)  
	class USkyLightComponent*                          SkyLightComponent;                                          // 0x0640   (0x0008)  
	class UExponentialHeightFogComponent*              Height_Fog_Component;                                       // 0x0648   (0x0008)  
	bool                                               Apply_Exposure_Settings;                                    // 0x0650   (0x0001)  
	unsigned char                                      UnknownData19_6[0x7];                                       // 0x0651   (0x0007)  MISSED
	class UCurveFloat*                                 Exposure_Compensation_Curve;                                // 0x0658   (0x0008)  
	double                                             Day_Length;                                                 // 0x0660   (0x0008)  
	double                                             Night_Length;                                               // 0x0668   (0x0008)  
	double                                             Extend_Dawn_and_Dusk;                                       // 0x0670   (0x0008)  
	bool                                               Move_Static_Stationary_Lights;                              // 0x0678   (0x0001)  
	unsigned char                                      UnknownData20_6[0x7];                                       // 0x0679   (0x0007)  MISSED
	double                                             Base_Fog_Density;                                           // 0x0680   (0x0008)  
	double                                             Foggy_Density_Contribution;                                 // 0x0688   (0x0008)  
	double                                             Cloudy_Density_Contribution;                                // 0x0690   (0x0008)  
	double                                             Dust_Density_Contribution;                                  // 0x0698   (0x0008)  
	double                                             Scale_Total_Fog_Density;                                    // 0x06A0   (0x0008)  
	double                                             Stars_Tiling;                                               // 0x06A8   (0x0008)  
	double                                             Stars_Daytime_Intensity;                                    // 0x06B0   (0x0008)  
	double                                             Twinkle_Amount;                                             // 0x06B8   (0x0008)  
	double                                             Twinkle_Speed;                                              // 0x06C0   (0x0008)  
	TWeakObjectPtr<class UTexture2D*>                  Tiling_Stars_Texture;                                       // 0x06C8   (0x0008)  
	unsigned char                                      UnknownData21_6[0x28];                                      // 0x06D0   (0x0028)  MISSED
	TWeakObjectPtr<class UTexture2D*>                  Real_Stars_Texture;                                         // 0x06F8   (0x0008)  
	unsigned char                                      UnknownData22_6[0x28];                                      // 0x0700   (0x0028)  MISSED
	double                                             Stars_Phase;                                                // 0x0728   (0x0008)  
	class UTexture2D*                                  Custom_Tiling_Stars_Texture;                                // 0x0730   (0x0008)  
	class UTexture2D*                                  Custom_Real_Stars_Texture;                                  // 0x0738   (0x0008)  
	class UCurveFloat*                                 Stars_Intensity_Curve;                                      // 0x0740   (0x0008)  
	double                                             Sky_Light_Intensity;                                        // 0x0748   (0x0008)  
	TEnumAsByte<EComponentMobility>                    Sky_Light_Mobility;                                         // 0x0750   (0x0001)  
	unsigned char                                      UnknownData23_6[0x7];                                       // 0x0751   (0x0007)  MISSED
	double                                             Sky_Light_Temperature;                                      // 0x0758   (0x0008)  
	FLinearColor                                       Sky_Light_Color_Multiplier__Day_;                           // 0x0760   (0x0010)  
	FLinearColor                                       Sky_Light_Color_Multiplier__Dawn_Dusk_;                     // 0x0770   (0x0010)  
	FLinearColor                                       Sky_Light_Color_Multiplier__Night_;                         // 0x0780   (0x0010)  
	bool                                               Sky_Light_Casts_Shadows;                                    // 0x0790   (0x0001)  
	unsigned char                                      UnknownData24_6[0x7];                                       // 0x0791   (0x0007)  MISSED
	double                                             DFAO_Min_Occlusion;                                         // 0x0798   (0x0008)  
	double                                             DFAO_Exponent;                                              // 0x07A0   (0x0008)  
	TWeakObjectPtr<class UTextureCube*>                Flat_Cubemap;                                               // 0x07A8   (0x0008)  
	unsigned char                                      UnknownData25_6[0x28];                                      // 0x07B0   (0x0028)  MISSED
	TWeakObjectPtr<class UTextureCube*>                Custom_Cubemap;                                             // 0x07D8   (0x0008)  
	unsigned char                                      UnknownData26_6[0x28];                                      // 0x07E0   (0x0028)  MISSED
	FLinearColor                                       Tinted_Sky_Light_Lower_Hemisphere_Color;                    // 0x0808   (0x0010)  
	bool                                               Real_Time_Capture;                                          // 0x0818   (0x0001)  
	unsigned char                                      UnknownData27_6[0x3];                                       // 0x0819   (0x0003)  MISSED
	FLinearColor                                       Captured_Sky_Light_Lower_Hemisphere_Tint;                   // 0x081C   (0x0010)  
	bool                                               Recapture_Sky_light_Periodically;                           // 0x082C   (0x0001)  
	unsigned char                                      UnknownData28_6[0x3];                                       // 0x082D   (0x0003)  MISSED
	double                                             Sky_Light_Recapture_Period__Seconds_;                       // 0x0830   (0x0008)  
	double                                             Lights_Update_Period;                                       // 0x0838   (0x0008)  
	double                                             Sunrise_Event_Offset;                                       // 0x0840   (0x0008)  
	double                                             Sunset_Event_Offset;                                        // 0x0848   (0x0008)  
	SDK_UNDEFINED(16,354) /* FMulticastInlineDelegate */ __um(Sunset);                                             // 0x0850   (0x0010)  
	SDK_UNDEFINED(16,355) /* FMulticastInlineDelegate */ __um(Sunrise);                                            // 0x0860   (0x0010)  
	double                                             Cloud_Wisps_Opacity__Cloudy_;                               // 0x0870   (0x0008)  
	class UTexture2D*                                  Cloud_Wisps_Texture;                                        // 0x0878   (0x0008)  
	TEnumAsByte<UDS_NoiseType>                         Cloud_Noise_Type;                                           // 0x0880   (0x0001)  
	unsigned char                                      UnknownData29_6[0x7];                                       // 0x0881   (0x0007)  MISSED
	class UTexture2D*                                  Custom_Noise_Texture;                                       // 0x0888   (0x0008)  
	double                                             Sun_Shader_Intensity;                                       // 0x0890   (0x0008)  
	double                                             Directional_Lighting_Intensity;                             // 0x0898   (0x0008)  
	double                                             Sun_Highlight_Radius;                                       // 0x08A0   (0x0008)  
	double                                             Cloud_Opacity;                                              // 0x08A8   (0x0008)  
	double                                             Horizon_Density_Multiplier;                                 // 0x08B0   (0x0008)  
	double                                             Zenith_Density_Multiplier;                                  // 0x08B8   (0x0008)  
	double                                             Latitude_Gradient_Position;                                 // 0x08C0   (0x0008)  
	double                                             Latitude_Gradient_Width;                                    // 0x08C8   (0x0008)  
	double                                             Around_Sun_Density_Multiplier;                              // 0x08D0   (0x0008)  
	double                                             Around_Sun_Density_Exponent;                                // 0x08D8   (0x0008)  
	double                                             Around_Moon_Density_Multiplier;                             // 0x08E0   (0x0008)  
	double                                             Around_Moon_Density_Exponent;                               // 0x08E8   (0x0008)  
	class UCurveFloat*                                 Shine_Intensity_Curve;                                      // 0x08F0   (0x0008)  
	class UCurveFloat*                                 Sun_Highlight_Intensity_Curve;                              // 0x08F8   (0x0008)  
	class UCurveFloat*                                 Sun_Highlight_Radius_Curve;                                 // 0x0900   (0x0008)  
	double                                             Shine_Variation;                                            // 0x0908   (0x0008)  
	bool                                               Dim_Directional_Lights_with_Cloud_Coverage;                 // 0x0910   (0x0001)  
	bool                                               Spread_Out_Tick_Behaviors_Over_3_Frames;                    // 0x0911   (0x0001)  
	bool                                               Only_Fully_Update_Active_Parameters_When_Cloud_Coverage_Changes; // 0x0912   (0x0001)  
	unsigned char                                      UnknownData30_6[0x5];                                       // 0x0913   (0x0005)  MISSED
	double                                             Directional_Lights_Absent_Brightness;                       // 0x0918   (0x0008)  
	class UMaterialInstanceDynamic*                    Volumetric_Clouds_MID_Complex;                              // 0x0920   (0x0008)  
	TEnumAsByte<UDS_VolRT_Mode>                        Volumetric_Cloud_Rendering_Mode;                            // 0x0928   (0x0001)  
	unsigned char                                      UnknownData31_6[0x7];                                       // 0x0929   (0x0007)  MISSED
	double                                             Bottom_Altitude;                                            // 0x0930   (0x0008)  
	double                                             Layer_Height_Scale;                                         // 0x0938   (0x0008)  
	double                                             Base_Clouds_Scale;                                          // 0x0940   (0x0008)  
	double                                             _3D_Noise_Scale;                                            // 0x0948   (0x0008)  
	double                                             High_Frequency_Noise_Amount;                                // 0x0950   (0x0008)  
	double                                             Distort_High_Frequency_Noise;                               // 0x0958   (0x0008)  
	double                                             Extinction_Scale_Top;                                       // 0x0960   (0x0008)  
	double                                             Extinction_Scale_Bottom;                                    // 0x0968   (0x0008)  
	double                                             Volumetric_Clouds_Scale;                                    // 0x0970   (0x0008)  
	double                                             Shift_Curve;                                                // 0x0978   (0x0008)  
	double                                             Z_Disturbance;                                              // 0x0980   (0x0008)  
	double                                             Minimum_Erosion;                                            // 0x0988   (0x0008)  
	double                                             Base_Floor_Variation;                                       // 0x0990   (0x0008)  
	double                                             Overcast_Floor_Variation;                                   // 0x0998   (0x0008)  
	double                                             Floor_Variation_Luminance_Scale;                            // 0x09A0   (0x0008)  
	double                                             View_Sample_Scale__Day_;                                    // 0x09A8   (0x0008)  
	double                                             View_Sample_Scale__Night_;                                  // 0x09B0   (0x0008)  
	double                                             Distance_to_Sample_MaxCount;                                // 0x09B8   (0x0008)  
	double                                             Shadow_Sample_Scale;                                        // 0x09C0   (0x0008)  
	double                                             Shadow_Tracing_Distance;                                    // 0x09C8   (0x0008)  
	double                                             Reflection_Sample_Count_Scale;                              // 0x09D0   (0x0008)  
	double                                             Reflection_Shadow_Sample_Count_Scale;                       // 0x09D8   (0x0008)  
	TEnumAsByte<UDS_NoiseType>                         Volumetric_Cloud_Noise_Type;                                // 0x09E0   (0x0001)  
	unsigned char                                      UnknownData32_6[0x7];                                       // 0x09E1   (0x0007)  MISSED
	class UTexture2D*                                  Volumetric_Custom_Noise_Texture;                            // 0x09E8   (0x0008)  
	double                                             Base_Clouds_Mip_Level;                                      // 0x09F0   (0x0008)  
	double                                             Multiscattering_Intensity;                                  // 0x09F8   (0x0008)  
	double                                             Multiscattering_Occlusion_Factor;                           // 0x0A00   (0x0008)  
	double                                             SubNoise_Erosion;                                           // 0x0A08   (0x0008)  
	class UMaterialInstanceDynamic*                    Volumetric_Clouds_MID_Simplified;                           // 0x0A10   (0x0008)  
	double                                             Fog_Start_Distance_when_Clear;                              // 0x0A18   (0x0008)  
	double                                             Fog_Density_where_Start_Distance_Reaches_Zero;              // 0x0A20   (0x0008)  
	bool                                               Randomize_Cloud_Formation_on_Run;                           // 0x0A28   (0x0001)  
	unsigned char                                      UnknownData33_6[0x7];                                       // 0x0A29   (0x0007)  MISSED
	double                                             _3D_Noise_Vertical_Movement;                                // 0x0A30   (0x0008)  
	double                                             Macro_Variation;                                            // 0x0A38   (0x0008)  
	double                                             Macro_Scale;                                                // 0x0A40   (0x0008)  
	double                                             Multiscattering_Phase_1;                                    // 0x0A48   (0x0008)  
	double                                             Multiscattering_Phase_2;                                    // 0x0A50   (0x0008)  
	double                                             Multiscattering_Eccentricity;                               // 0x0A58   (0x0008)  
	double                                             Time_Speed;                                                 // 0x0A60   (0x0008)  
	double                                             Internal_Time_of_Day;                                       // 0x0A68   (0x0008)  
	class AActor*                                      Weather_BP;                                                 // 0x0A70   (0x0008)  
	FLinearColor                                       Volumetric_Cloud_Color;                                     // 0x0A78   (0x0010)  
	double                                             Tracing_Max_Start_Distance;                                 // 0x0A88   (0x0008)  
	class UMaterialInstanceDynamic*                    Static_Clouds_MID;                                          // 0x0A90   (0x0008)  
	FLinearColor                                       Aurora_Color_1;                                             // 0x0A98   (0x0010)  
	FLinearColor                                       Aurora_Color_2;                                             // 0x0AA8   (0x0010)  
	FLinearColor                                       Aurora_Color_3;                                             // 0x0AB8   (0x0010)  
	class UMaterialInstanceDynamic*                    Volumetric_Aurora_MID;                                      // 0x0AC8   (0x0008)  
	bool                                               Use_Sky_Mode_Scalability_Map;                               // 0x0AD0   (0x0001)  
	unsigned char                                      UnknownData34_6[0x7];                                       // 0x0AD1   (0x0007)  MISSED
	SDK_UNDEFINED(80,356) /* TMap<int32_t, TEnumAsByte<UDS_SkyMode>> */ __um(Sky_Mode_Scalability_Map);            // 0x0AD8   (0x0050)  
	double                                             Sun_Disk_Intensity;                                         // 0x0B28   (0x0008)  
	class UCurveLinearColor*                           Sun_Disk_Color_Curve;                                       // 0x0B30   (0x0008)  
	class UCurveFloat*                                 Aurora_Intensity_Curve;                                     // 0x0B38   (0x0008)  
	class UMaterialInstanceDynamic*                    Inside_Clouds_Fog_MID;                                      // 0x0B40   (0x0008)  
	double                                             Tracing_Max_Distance__Inside_Cloud_Layer_;                  // 0x0B48   (0x0008)  
	double                                             Tracing_Max_Distance__Outside_Cloud_Layer_;                 // 0x0B50   (0x0008)  
	bool                                               Enable_Fog_Inside_Clouds;                                   // 0x0B58   (0x0001)  
	unsigned char                                      UnknownData35_6[0x7];                                       // 0x0B59   (0x0007)  MISSED
	TWeakObjectPtr<class UTexture2D*>                  Aurora_Texture;                                             // 0x0B60   (0x0008)  
	unsigned char                                      UnknownData36_6[0x28];                                      // 0x0B68   (0x0028)  MISSED
	double                                             _2D_Aurora_Max_Samples;                                     // 0x0B90   (0x0008)  
	double                                             _2D_Aurora_Sample_Step_Size;                                // 0x0B98   (0x0008)  
	double                                             _2D_Aurora_Line_Exponent;                                   // 0x0BA0   (0x0008)  
	double                                             _2D_Aurora_Mask_Exponent;                                   // 0x0BA8   (0x0008)  
	double                                             Volumetric_Aurora_Sample_Count_Scale;                       // 0x0BB0   (0x0008)  
	double                                             Volumetric_Aurora_Layer_Height;                             // 0x0BB8   (0x0008)  
	double                                             Volumetric_Aurora_Bottom_Altitude;                          // 0x0BC0   (0x0008)  
	double                                             Fog_Density_Daytime_Mutliplier;                             // 0x0BC8   (0x0008)  
	double                                             Fog_Density_Nighttime_Multiplier;                           // 0x0BD0   (0x0008)  
	double                                             Base_Height_Fog_Falloff;                                    // 0x0BD8   (0x0008)  
	double                                             Cloudy_Height_Fog_Falloff;                                  // 0x0BE0   (0x0008)  
	double                                             Foggy_Height_Fog_Falloff;                                   // 0x0BE8   (0x0008)  
	double                                             Inside_Cloud_Fog_Strength;                                  // 0x0BF0   (0x0008)  
	FLinearColor                                       Inside_Cloud_Fog_Color;                                     // 0x0BF8   (0x0010)  
	double                                             _2D_Overcast_Turbulence;                                    // 0x0C08   (0x0008)  
	double                                             Close_Fade_Distance;                                        // 0x0C10   (0x0008)  
	bool                                               Two_Layers;                                                 // 0x0C18   (0x0001)  
	unsigned char                                      UnknownData37_6[0x7];                                       // 0x0C19   (0x0007)  MISSED
	double                                             Layer_2_Coverage_Scale;                                     // 0x0C20   (0x0008)  
	double                                             Layer_2_Extinction_Scale;                                   // 0x0C28   (0x0008)  
	FVector2D                                          Layer_2_Cloud_Scale;                                        // 0x0C30   (0x0010)  
	double                                             Layer_2_Mip_Offset;                                         // 0x0C40   (0x0008)  
	double                                             Distance_Between_Layers;                                    // 0x0C48   (0x0008)  
	bool                                               Enable_Sun_Light_Shaft_Bloom;                               // 0x0C50   (0x0001)  
	unsigned char                                      UnknownData38_6[0x7];                                       // 0x0C51   (0x0007)  MISSED
	double                                             Sun_Light_Shaft_Max_Brightness;                             // 0x0C58   (0x0008)  
	class UCurveFloat*                                 Sun_Light_Shaft_Bloom_Threshold_Curve;                      // 0x0C60   (0x0008)  
	class UCurveFloat*                                 Sun_Light_Shaft_Bloom_Scale_Curve;                          // 0x0C68   (0x0008)  
	FLinearColor                                       Sun_Light_Shaft_Tint_Color;                                 // 0x0C70   (0x0010)  
	bool                                               Enable_Moon_Light_Shaft_Bloom;                              // 0x0C80   (0x0001)  
	unsigned char                                      UnknownData39_6[0x7];                                       // 0x0C81   (0x0007)  MISSED
	double                                             Moon_Light_Shaft_Max_Brightness;                            // 0x0C88   (0x0008)  
	double                                             Moon_Light_Shaft_Bloom_Threshold;                           // 0x0C90   (0x0008)  
	double                                             Moon_Light_Shaft_Bloom_Scale;                               // 0x0C98   (0x0008)  
	FLinearColor                                       Moon_Light_Shaft_Tint_Color;                                // 0x0CA0   (0x0010)  
	bool                                               Factor_Absent_Directional_Lights_Brightness;                // 0x0CB0   (0x0001)  
	bool                                               Real_Time_Capture_Uses_Time_Slicing;                        // 0x0CB1   (0x0001)  
	bool                                               Use_Mobile_Overrides;                                       // 0x0CB2   (0x0001)  
	TEnumAsByte<UDS_SkyMode>                           Volumetric_Clouds_Replacement;                              // 0x0CB3   (0x0001)  
	TEnumAsByte<UDS_SkyLightMode>                      Real_Time_Capture_Sky_Light_Replacement;                    // 0x0CB4   (0x0001)  
	bool                                               Adjust_For_Mobile_Renderer;                                 // 0x0CB5   (0x0001)  
	unsigned char                                      UnknownData40_6[0x2];                                       // 0x0CB6   (0x0002)  MISSED
	TArray<FString>                                    Mobile_Platforms;                                           // 0x0CB8   (0x0010)  
	FVector                                            Moon_Target;                                                // 0x0CC8   (0x0018)  
	bool                                               Mobile;                                                     // 0x0CE0   (0x0001)  
	bool                                               Simulate_Real_Sun;                                          // 0x0CE1   (0x0001)  
	bool                                               Simulate_Real_Moon;                                         // 0x0CE2   (0x0001)  
	bool                                               Simulate_Real_Stars;                                        // 0x0CE3   (0x0001)  
	TEnumAsByte<UDS_CityPresets>                       Location_Preset;                                            // 0x0CE4   (0x0001)  
	unsigned char                                      UnknownData41_6[0x3];                                       // 0x0CE5   (0x0003)  MISSED
	double                                             Latitude;                                                   // 0x0CE8   (0x0008)  
	double                                             Longitude;                                                  // 0x0CF0   (0x0008)  
	double                                             Time_Zone;                                                  // 0x0CF8   (0x0008)  
	int32_t                                            Year;                                                       // 0x0D00   (0x0004)  
	int32_t                                            Month;                                                      // 0x0D04   (0x0004)  
	int32_t                                            Day;                                                        // 0x0D08   (0x0004)  
	unsigned char                                      UnknownData42_6[0x4];                                       // 0x0D0C   (0x0004)  MISSED
	double                                             North_Yaw;                                                  // 0x0D10   (0x0008)  
	double                                             Simulation_Speed;                                           // 0x0D18   (0x0008)  
	bool                                               True_Real_World_Time;                                       // 0x0D20   (0x0001)  
	bool                                               Apply_Daylight_Savings_Time;                                // 0x0D21   (0x0001)  
	unsigned char                                      UnknownData43_6[0x2];                                       // 0x0D22   (0x0002)  MISSED
	int32_t                                            DST_Start_Month;                                            // 0x0D24   (0x0004)  
	int32_t                                            DST_Start_Day;                                              // 0x0D28   (0x0004)  
	int32_t                                            DST_End_Month;                                              // 0x0D2C   (0x0004)  
	int32_t                                            DST_End_Day;                                                // 0x0D30   (0x0004)  
	int32_t                                            DST_Change_Hour;                                            // 0x0D34   (0x0004)  
	TArray<int32_t>                                    Months;                                                     // 0x0D38   (0x0010)  
	TArray<int32_t>                                    Months__Leap_Year_;                                         // 0x0D48   (0x0010)  
	double                                             Stellar_Calibration;                                        // 0x0D58   (0x0008)  
	double                                             Lunar_Orbit_Calibration;                                    // 0x0D60   (0x0008)  
	double                                             Lunar_Inclination_Calibration;                              // 0x0D68   (0x0008)  
	bool                                               Runtime;                                                    // 0x0D70   (0x0001)  
	bool                                               Daylight_Savings_Time;                                      // 0x0D71   (0x0001)  
	unsigned char                                      UnknownData44_6[0x2];                                       // 0x0D72   (0x0002)  MISSED
	int32_t                                            Total_Days_Elapsed;                                         // 0x0D74   (0x0004)  
	bool                                               Clouds_Move_with_Time_of_Day;                               // 0x0D78   (0x0001)  
	unsigned char                                      UnknownData45_6[0x7];                                       // 0x0D79   (0x0007)  MISSED
	double                                             Time_of_Day_Movement_Multiplier;                            // 0x0D80   (0x0008)  
	SDK_UNDEFINED(80,357) /* TMap<FString, TWeakObjectPtr<UMaterialInstance*>> */ __um(Sky_MID_Parent_Instances);  // 0x0D88   (0x0050)  
	double                                             Fog_Shadows;                                                // 0x0DD8   (0x0008)  
	double                                             Dust_Shadows;                                               // 0x0DE0   (0x0008)  
	double                                             _2D_Cloud_Shadows_Speed;                                    // 0x0DE8   (0x0008)  
	double                                             _2D_Cloud_Shadows_Scale;                                    // 0x0DF0   (0x0008)  
	bool                                               Disable_Directional_Light_Shadows_when_Fully_Shadowed_by_Clouds; // 0x0DF8   (0x0001)  
	unsigned char                                      UnknownData46_6[0x7];                                       // 0x0DF9   (0x0007)  MISSED
	class UMaterialInterface*                          Custom_Light_Function_Material;                             // 0x0E00   (0x0008)  
	bool                                               Force_Light_Functions_On;                                   // 0x0E08   (0x0001)  
	unsigned char                                      UnknownData47_6[0x7];                                       // 0x0E09   (0x0007)  MISSED
	double                                             Time_of_Day_Replication_Period;                             // 0x0E10   (0x0008)  
	double                                             Replicated_Time_of_Day;                                     // 0x0E18   (0x0008)  
	double                                             Replicated_Moon_Phase;                                      // 0x0E20   (0x0008)  
	double                                             Scale_Sun_Radius_as_it_Nears_Horizon;                       // 0x0E28   (0x0008)  
	double                                             Sun_Specular_Scale;                                         // 0x0E30   (0x0008)  
	double                                             Sun_Yaw;                                                    // 0x0E38   (0x0008)  
	double                                             Scale_Moon_Radius_as_it_Nears_Horizon;                      // 0x0E40   (0x0008)  
	bool                                               Fog_Colors_from_Sky_Atmosphere;                             // 0x0E48   (0x0001)  
	unsigned char                                      UnknownData48_6[0x7];                                       // 0x0E49   (0x0007)  MISSED
	double                                             Dusty_Height_Fog_Falloff;                                   // 0x0E50   (0x0008)  
	double                                             Moon_Specular_Scale;                                        // 0x0E58   (0x0008)  
	double                                             Replicated_Day_Length;                                      // 0x0E60   (0x0008)  
	double                                             Replicated_Night_Length;                                    // 0x0E68   (0x0008)  
	double                                             Replicated_Time_Speed;                                      // 0x0E70   (0x0008)  
	double                                             Replicated_Simulation_Speed;                                // 0x0E78   (0x0008)  
	double                                             Scale_Ambient_Sky_Atmosphere_Contribution;                  // 0x0E80   (0x0008)  
	double                                             High_Frequency_Mip_Increase_by_Distance;                    // 0x0E88   (0x0008)  
	bool                                               Change_to_Simplified_Material_when_Overcast;                // 0x0E90   (0x0001)  
	unsigned char                                      UnknownData49_6[0x7];                                       // 0x0E91   (0x0007)  MISSED
	double                                             Simplified_Material_Cloud_Coverage_Threshold;               // 0x0E98   (0x0008)  
	double                                             Simplified_Material_Fade_Length;                            // 0x0EA0   (0x0008)  
	double                                             Top_Bottom_Distribution;                                    // 0x0EA8   (0x0008)  
	int32_t                                            Current_Volumetric_Clouds_MID;                              // 0x0EB0   (0x0004)  
	unsigned char                                      UnknownData50_6[0x4];                                       // 0x0EB4   (0x0004)  MISSED
	FVector                                            Clouds_Position;                                            // 0x0EB8   (0x0018)  
	double                                             Standard_Base_Clouds_Size;                                  // 0x0ED0   (0x0008)  
	double                                             Last_Clouds_Time_of_Day_Factor;                             // 0x0ED8   (0x0008)  
	FVector                                            Starting_Cloud_Texture_Velocity;                            // 0x0EE0   (0x0018)  
	bool                                               Control_Sky_Atmosphere_Settings;                            // 0x0EF8   (0x0001)  
	unsigned char                                      UnknownData51_6[0x3];                                       // 0x0EF9   (0x0003)  MISSED
	FLinearColor                                       Rayleigh_Scattering_Color__Day_;                            // 0x0EFC   (0x0010)  
	FLinearColor                                       Rayleigh_Scattering_Color__Dawn_Dusk_;                      // 0x0F0C   (0x0010)  
	FLinearColor                                       Rayleigh_Scattering_Color__Night_;                          // 0x0F1C   (0x0010)  
	unsigned char                                      UnknownData52_6[0x4];                                       // 0x0F2C   (0x0004)  MISSED
	double                                             Desaturate_Rayleigh_Scattering_when_Cloudy;                 // 0x0F30   (0x0008)  
	double                                             Brighten_Rayleigh_Scattering_When_Cloudy;                   // 0x0F38   (0x0008)  
	int32_t                                            Current_Tick_Set;                                           // 0x0F40   (0x0004)  
	unsigned char                                      UnknownData53_6[0x4];                                       // 0x0F44   (0x0004)  MISSED
	double                                             Cloud_Coverage_Change_Speed;                                // 0x0F48   (0x0008)  
	double                                             Time_of_Day_Change_Speed;                                   // 0x0F50   (0x0008)  
	double                                             Fog_Change_Speed;                                           // 0x0F58   (0x0008)  
	double                                             Dust_Change_Speed;                                          // 0x0F60   (0x0008)  
	double                                             Current_Time_of_Day_Offset;                                 // 0x0F68   (0x0008)  
	double                                             Last_Frame_Cloud_Coverage;                                  // 0x0F70   (0x0008)  
	double                                             Cloud_Coverage_Change_This_Frame;                           // 0x0F78   (0x0008)  
	SDK_UNDEFINED(80,358) /* TMap<FName, TEnumAsByte<UDS_PropertyType>> */ __um(Properties);                       // 0x0F80   (0x0050)  
	double                                             Last_Frame_Time_of_Day;                                     // 0x0FD0   (0x0008)  
	double                                             Night_Sky_Glow;                                             // 0x0FD8   (0x0008)  
	FLinearColor                                       Night_Sky_Glow_Color;                                       // 0x0FE0   (0x0010)  
	double                                             Light_Pollution_Intensity;                                  // 0x0FF0   (0x0008)  
	FLinearColor                                       Light_Pollution_Color;                                      // 0x0FF8   (0x0010)  
	class UMaterialInstanceDynamic*                    Cloud_Fog_Post_Process_MID;                                 // 0x1008   (0x0008)  
	double                                             Dimming_Range_Lower_Bound;                                  // 0x1010   (0x0008)  
	double                                             Dimming_Range_Upper_Bound;                                  // 0x1018   (0x0008)  
	double                                             Dimming_Range_Exponent;                                     // 0x1020   (0x0008)  
	class UMaterialInterface*                          Custom_Sky_Sphere_Material;                                 // 0x1028   (0x0008)  
	double                                             Fog_Snow_Contribution;                                      // 0x1030   (0x0008)  
	SDK_UNDEFINED(16,359) /* FMulticastInlineDelegate */ __um(Midnight);                                           // 0x1038   (0x0010)  
	FLinearColor                                       Sunset_Sunrise_Color__Absorption_;                          // 0x1048   (0x0010)  
	double                                             Sunset_Sunrise_Color_Intensity__Absorption_Scale_;          // 0x1058   (0x0008)  
	double                                             Simulated_Sunrise_Time;                                     // 0x1060   (0x0008)  
	double                                             Simulated_Sunset_Time;                                      // 0x1068   (0x0008)  
	bool                                               Disallow_Tick_Skip;                                         // 0x1070   (0x0001)  
	unsigned char                                      UnknownData54_6[0x7];                                       // 0x1071   (0x0007)  MISSED
	double                                             Base_Cloud_Height;                                          // 0x1078   (0x0008)  
	bool                                               Enable_Sun_Lens_Flare;                                      // 0x1080   (0x0001)  
	TEnumAsByte<UDS_LensFlareType>                     Lens_Flare_Type;                                            // 0x1081   (0x0001)  
	unsigned char                                      UnknownData55_6[0x6];                                       // 0x1082   (0x0006)  MISSED
	double                                             Lens_Flare_Strength;                                        // 0x1088   (0x0008)  
	FLinearColor                                       Lens_Flare_Tint;                                            // 0x1090   (0x0010)  
	class UMaterialInstanceDynamic*                    Lens_Flare_MID;                                             // 0x10A0   (0x0008)  
	class UMaterialInterface*                          Custom_Lens_Flare_Parent_Instance;                          // 0x10A8   (0x0008)  
	double                                             Scale_Flare_Elements;                                       // 0x10B0   (0x0008)  
	double                                             Dynamic_Sky_Light_Transition_Time;                          // 0x10B8   (0x0008)  
	double                                             Target_Sky_Light_Multiplier;                                // 0x10C0   (0x0008)  
	double                                             Dynamic_Sky_Light_Multiplier;                               // 0x10C8   (0x0008)  
	bool                                               Override_with_New_Changes;                                  // 0x10D0   (0x0001)  
	unsigned char                                      UnknownData56_6[0x7];                                       // 0x10D1   (0x0007)  MISSED
	class UMaterialInstanceDynamic*                    Overcast_Turbulence_MID;                                    // 0x10D8   (0x0008)  
	double                                             Low_Material_Quality_Sample_Count_Scale;                    // 0x10E0   (0x0008)  
	double                                             Medium_Material_Quality_Sample_Count_Scale;                 // 0x10E8   (0x0008)  
	TWeakObjectPtr<class UVolumeTexture*>              Epic_Quality_Volume_Texture;                                // 0x10F0   (0x0008)  
	unsigned char                                      UnknownData57_6[0x28];                                      // 0x10F8   (0x0028)  MISSED
	TWeakObjectPtr<class UVolumeTexture*>              High_Quality_Volume_Texture;                                // 0x1120   (0x0008)  
	unsigned char                                      UnknownData58_6[0x28];                                      // 0x1128   (0x0028)  MISSED
	TWeakObjectPtr<class UVolumeTexture*>              Low_Quality_Volume_Texture;                                 // 0x1150   (0x0008)  
	unsigned char                                      UnknownData59_6[0x28];                                      // 0x1158   (0x0028)  MISSED
	double                                             Epic_Material_Quality_Sample_Count_Scale;                   // 0x1180   (0x0008)  
	TWeakObjectPtr<class UMaterialInterface*>          Inside_Cloud_Fog_Parent_Material;                           // 0x1188   (0x0008)  
	unsigned char                                      UnknownData60_6[0x28];                                      // 0x1190   (0x0028)  MISSED
	TWeakObjectPtr<class UNiagaraSystem*>              Inside_Cloud_Fog_System;                                    // 0x11B8   (0x0008)  
	unsigned char                                      UnknownData61_6[0x28];                                      // 0x11C0   (0x0028)  MISSED
	TWeakObjectPtr<class UMaterialInterface*>          Post_Process_Cloud_Fog_Parent_Material;                     // 0x11E8   (0x0008)  
	unsigned char                                      UnknownData62_6[0x28];                                      // 0x11F0   (0x0028)  MISSED
	TArray<class UMaterialInstanceDynamic*>            Volumetric_Cloud_and_Shadow_MIDs;                           // 0x1218   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            Volumetric_Cloud_MIDs;                                      // 0x1228   (0x0010)  
	double                                             Moon_Light_Current_Intensity_Value;                         // 0x1238   (0x0008)  
	bool                                               Keep_Planet_Top_at_Camera_XY_Location;                      // 0x1240   (0x0001)  
	unsigned char                                      UnknownData63_6[0x3];                                       // 0x1241   (0x0003)  MISSED
	FLinearColor                                       Base_Sky_Color__Day_;                                       // 0x1244   (0x0010)  
	FLinearColor                                       Base_Sky_Color__Dawn_Dusk_;                                 // 0x1254   (0x0010)  
	FLinearColor                                       Base_Sky_Color__Night_;                                     // 0x1264   (0x0010)  
	FLinearColor                                       Cloud_Light_Color__Day_;                                    // 0x1274   (0x0010)  
	FLinearColor                                       Cloud_Light_Color__Dawn_Dusk_;                              // 0x1284   (0x0010)  
	FLinearColor                                       Cloud_Light_Color__Night_;                                  // 0x1294   (0x0010)  
	FLinearColor                                       Cloud_Dark_Color__Day_;                                     // 0x12A4   (0x0010)  
	FLinearColor                                       Cloud_Dark_Color__Dawn_Dusk_;                               // 0x12B4   (0x0010)  
	FLinearColor                                       Cloud_Dark_Color__Night_;                                   // 0x12C4   (0x0010)  
	FLinearColor                                       Sun_Glow_Color;                                             // 0x12D4   (0x0010)  
	unsigned char                                      UnknownData64_6[0x4];                                       // 0x12E4   (0x0004)  MISSED
	class UCurveFloat*                                 Directional_Intensity_Curve;                                // 0x12E8   (0x0008)  
	class UCurveLinearColor*                           Directional_Light_Scattering_Curve;                         // 0x12F0   (0x0008)  
	class UTexture2D*                                  Atmospheric_Scattering_LUT_Texture;                         // 0x12F8   (0x0008)  
	TEnumAsByte<UDS_FogColorMode>                      Fog_Color_Mode;                                             // 0x1300   (0x0001)  
	unsigned char                                      UnknownData65_6[0x7];                                       // 0x1301   (0x0007)  MISSED
	double                                             Fog_Color_Intensity_Scale;                                  // 0x1308   (0x0008)  
	class UCurveLinearColor*                           Fog_Scattering_Color_Curve;                                 // 0x1310   (0x0008)  
	FLinearColor                                       Fog_Inscattering_Sun;                                       // 0x1318   (0x0010)  
	FLinearColor                                       Fog_Inscattering_Moon;                                      // 0x1328   (0x0010)  
	class UCurveLinearColor*                           Fog_Directional_Scattering_Color_Curve;                     // 0x1338   (0x0008)  
	FLinearColor                                       Fog_Directional_Inscattering;                               // 0x1340   (0x0010)  
	double                                             Foggy_Desaturation;                                         // 0x1350   (0x0008)  
	double                                             Overcast_Desaturation;                                      // 0x1358   (0x0008)  
	double                                             Overcast_Brightness_Day;                                    // 0x1360   (0x0008)  
	double                                             Overcast_Brightness_Night;                                  // 0x1368   (0x0008)  
	FLinearColor                                       All_Fog_Colors_Multiplier;                                  // 0x1370   (0x0010)  
	class UCurveFloat*                                 Sky_Atmosphere_Fog_Influence_Curve;                         // 0x1380   (0x0008)  
	double                                             Dust_Amount;                                                // 0x1388   (0x0008)  
	FLinearColor                                       Dust_Color;                                                 // 0x1390   (0x0010)  
	bool                                               Use_Volumetric_Fog;                                         // 0x13A0   (0x0001)  
	unsigned char                                      UnknownData66_6[0x3];                                       // 0x13A1   (0x0003)  MISSED
	float                                              Height_Fog_Density;                                         // 0x13A4   (0x0004)  
	bool                                               Using_Cloud_Fog_Post_Process;                               // 0x13A8   (0x0001)  
	unsigned char                                      UnknownData67_6[0x7];                                       // 0x13A9   (0x0007)  MISSED
	FVector                                            Current_Camera_Location;                                    // 0x13B0   (0x0018)  
	FLinearColor                                       Ambient_Fog_Color;                                          // 0x13C8   (0x0010)  
	FLinearColor                                       Directional_Inscattering_Fog_Color;                         // 0x13D8   (0x0010)  
	FLinearColor                                       Directional_Base_Fog_Color;                                 // 0x13E8   (0x0010)  
	FLinearColor                                       Scaled_Directional_Base_Fog_Color;                          // 0x13F8   (0x0010)  
	TWeakObjectPtr<class UMaterialInterface*>          Volumetric_Aurora_Parent_Material;                          // 0x1408   (0x0008)  
	unsigned char                                      UnknownData68_6[0x28];                                      // 0x1410   (0x0028)  MISSED
	TWeakObjectPtr<class UTexture2D*>                  Moon_Masks_Texture;                                         // 0x1438   (0x0008)  
	unsigned char                                      UnknownData69_6[0x28];                                      // 0x1440   (0x0028)  MISSED
	TArray<class UMaterialInstanceDynamic*>            Sky_and_Static_Clouds_MID;                                  // 0x1468   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            Sky_and_Shadows_MIDs;                                       // 0x1478   (0x0010)  
	TWeakObjectPtr<class UMaterialInterface*>          Overcast_Turbulence_Parent_Material;                        // 0x1488   (0x0008)  
	unsigned char                                      UnknownData70_6[0x28];                                      // 0x1490   (0x0028)  MISSED
	bool                                               Forward_Shading;                                            // 0x14B8   (0x0001)  
	unsigned char                                      UnknownData71_6[0x7];                                       // 0x14B9   (0x0007)  MISSED
	SDK_UNDEFINED(16,360) /* FMulticastInlineDelegate */ __um(Hourly);                                             // 0x14C0   (0x0010)  
	int32_t                                            Event_Hour;                                                 // 0x14D0   (0x0004)  
	float                                              Cloud_Wisps_Color_Intensity;                                // 0x14D4   (0x0004)  
	double                                             Max_Sun_Source_Angle_Scale;                                 // 0x14D8   (0x0008)  
	double                                             Sun_Source_Angle_Softness;                                  // 0x14E0   (0x0008)  
	double                                             Max_Moon_Source_Angle_Scale;                                // 0x14E8   (0x0008)  
	double                                             Transition_Time_A;                                          // 0x14F0   (0x0008)  
	double                                             Transition_Time_B;                                          // 0x14F8   (0x0008)  
	bool                                               Transitioning_Time;                                         // 0x1500   (0x0001)  
	TEnumAsByte<EEasingFunc>                           Transition_Easing_Function;                                 // 0x1501   (0x0001)  
	unsigned char                                      UnknownData72_6[0x6];                                       // 0x1502   (0x0006)  MISSED
	double                                             Transition_Easing_Exponent;                                 // 0x1508   (0x0008)  
	FTimerHandle                                       Transition_Timer;                                           // 0x1510   (0x0008)  
	double                                             Transition_Duration;                                        // 0x1518   (0x0008)  
	int32_t                                            Transition_Days_Counted;                                    // 0x1520   (0x0004)  
	bool                                               Transition_Can_Go_Backwards;                                // 0x1524   (0x0001)  
	unsigned char                                      UnknownData73_6[0x3];                                       // 0x1525   (0x0003)  MISSED
	double                                             Moon_Source_Angle_Softness;                                 // 0x1528   (0x0008)  
	float                                              Exposure_Bias_Day;                                          // 0x1530   (0x0004)  
	float                                              Exposure_Bias_Night;                                        // 0x1534   (0x0004)  
	float                                              Exposure_Bias_Cloudy;                                       // 0x1538   (0x0004)  
	float                                              Exposure_Bias_Foggy;                                        // 0x153C   (0x0004)  
	float                                              Exposure_Bias_Dusty;                                        // 0x1540   (0x0004)  
	float                                              Exposure_Min_Brightness;                                    // 0x1544   (0x0004)  
	float                                              Exposure_Max_Brightness;                                    // 0x1548   (0x0004)  
	bool                                               Apply_Interior_Adjustments;                                 // 0x154C   (0x0001)  
	unsigned char                                      UnknownData74_6[0x3];                                       // 0x154D   (0x0003)  MISSED
	double                                             Extra_Fog_Start_Distance_in_Interior;                       // 0x1550   (0x0008)  
	double                                             Fog_Density_Multiplier_in_Interior;                         // 0x1558   (0x0008)  
	double                                             Exposure_Bias_in_Interior;                                  // 0x1560   (0x0008)  
	double                                             Sky_Light_Intensity_Multiplier_in_Interiors;                // 0x1568   (0x0008)  
	double                                             Sun_Light_Intensity_Multiplier_in_Interiors;                // 0x1570   (0x0008)  
	double                                             Moon_Light_Intensity_Multiplier_in_Interiors;               // 0x1578   (0x0008)  
	double                                             Extra_Sun_Volumetric_Scattering_in_Interiors;               // 0x1580   (0x0008)  
	double                                             Extra_Moon_Volumetric_Scattering_in_Interiors;              // 0x1588   (0x0008)  
	double                                             Max_Interior_Trace_Distance;                                // 0x1590   (0x0008)  
	TEnumAsByte<ETraceTypeQuery>                       Interior_Occlusion_Trace_Channel;                           // 0x1598   (0x0001)  
	unsigned char                                      UnknownData75_6[0x7];                                       // 0x1599   (0x0007)  MISSED
	double                                             Interior_Occlusion_Update_Period;                           // 0x15A0   (0x0008)  
	class UMaterialInstanceDynamic*                    Rainbow_MID;                                                // 0x15A8   (0x0008)  
	double                                             Cloud_Shadow_Disable_Threshold;                             // 0x15B0   (0x0008)  
	double                                             Fraction_of_Trace_Hits_for_No_Occlusion;                    // 0x15B8   (0x0008)  
	double                                             Fraction_of_Trace_Hits_for_Full_Occlusion;                  // 0x15C0   (0x0008)  
	double                                             Cloud_Bottom_World_Height;                                  // 0x15C8   (0x0008)  
	TArray<double>                                     Cached_Floats_Old;                                          // 0x15D0   (0x0010)  
	TArray<double>                                     Cached_Floats_New;                                          // 0x15E0   (0x0010)  
	double                                             Cache_Alpha;                                                // 0x15F0   (0x0008)  
	bool                                               Filling_Starting_Cache;                                     // 0x15F8   (0x0001)  
	unsigned char                                      UnknownData76_6[0x7];                                       // 0x15F9   (0x0007)  MISSED
	double                                             Cache_Period;                                               // 0x1600   (0x0008)  
	FTimerHandle                                       Cache_Timer;                                                // 0x1608   (0x0008)  
	TArray<FLinearColor>                               Cached_Colors_Old;                                          // 0x1610   (0x0010)  
	TArray<FLinearColor>                               Cached_Colors_New;                                          // 0x1620   (0x0010)  
	TArray<FVector>                                    Cached_Vectors_Old;                                         // 0x1630   (0x0010)  
	TArray<FVector>                                    Cached_Vectors_New;                                         // 0x1640   (0x0010)  
	FVector                                            Cached_Sun_Vector;                                          // 0x1650   (0x0018)  
	FVector                                            Cached_Moon_Vector;                                         // 0x1668   (0x0018)  
	double                                             Fog_Change_This_Frame;                                      // 0x1680   (0x0008)  
	double                                             Last_Frame_Fog;                                             // 0x1688   (0x0008)  
	double                                             Last_Frame_Dust;                                            // 0x1690   (0x0008)  
	double                                             Dust_Change_This_Frame;                                     // 0x1698   (0x0008)  
	TArray<bool>                                       Cached_Value_Changing;                                      // 0x16A0   (0x0010)  
	double                                             Max_Property_Cache_Period;                                  // 0x16B0   (0x0008)  
	double                                             Time_of_Last_Cache;                                         // 0x16B8   (0x0008)  
	SDK_UNDEFINED(80,361) /* TMap<TEnumAsByte<UDS_CityPresets>, FVector> */ __um(Preset_Location_Coordinates);     // 0x16C0   (0x0050)  
	bool                                               Disable_Image_Based_Lens_Flares_when_Enabled;               // 0x1710   (0x0001)  
	unsigned char                                      UnknownData77_6[0x7];                                       // 0x1711   (0x0007)  MISSED
	double                                             Starting_Sky_Atmosphere_Height;                             // 0x1718   (0x0008)  
	TArray<FUDS_Post_Process_Stage>                    Post_Process_Components;                                    // 0x1720   (0x0010)  
	TArray<class UPostProcessComponent*>               User_Post_Process_Components;                               // 0x1730   (0x0010)  
	bool                                               Using_Post_Process_Components;                              // 0x1740   (0x0001)  
	unsigned char                                      UnknownData78_6[0x7];                                       // 0x1741   (0x0007)  MISSED
	double                                             Increase_Wisps_Brightness_Around_Sun;                       // 0x1748   (0x0008)  
	double                                             Increase_Wisps_Brightness_Around_Moon;                      // 0x1750   (0x0008)  


	/// Functions
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Forced Active Variables
	// void UpdateForcedActiveVariables();                                                                                      // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cloud Wisp Gradient Vector
	// void CloudWispGradientVector(FLinearColor& Out);                                                                         // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Directional Inscattering Exponent
	// double CurrentDirectionalInscatteringExponent();                                                                         // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current View Sample Scale
	// void CurrentViewSampleScale(double& Out);                                                                                // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Three Time Floats
	// void ThreeTimeFloats(double Day, double Dawn_Dusk, double Night, double& Out);                                           // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Post Process Blend Weights
	// void UpdatePostProcessBlendWeights();                                                                                    // [0x2c97800] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Create Post Process Components
	// void CreatePostProcessComponents();                                                                                      // [0x2c97800] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Change Sky Mode at Runtime
	// void ChangeSkyModeatRuntime(TEnumAsByte<UDS_SkyMode> NewSkyMode);                                                        // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Apply Location Preset
	// void ApplyLocationPreset();                                                                                              // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Volumetric Cloud Shadow Tracing Distance
	// void CurrentVolumetricCloudShadowTracingDistance(double& Out);                                                           // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sky Atmosphere Absorbtion Scale
	// void CurrentSkyAtmosphereAbsorbtionScale(double& Scale);                                                                 // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sky Atmosphere Luminance
	// FLinearColor CurrentSkyAtmosphereLuminance();                                                                            // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Volumetric Clouds Top Bottom Distribution
	// void VolumetricCloudsTopBottomDistribution(double& Out);                                                                 // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Control UDW Weather State
	// void ControlUDWWeatherState();                                                                                           // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Volumetric Clouds SubNoise Scales
	// void VolumetricCloudsSubNoiseScales(FLinearColor& High, FLinearColor& Low, FLinearColor& Medium);                        // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Volumetric Cloud Floor Variation
	// void VolumetricCloudFloorVariation(double& Height, double& Color);                                                       // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Flat Cloudiness
	// void FlatCloudiness(bool& On);                                                                                           // [0x2c97800] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Static Clouds XYZ Masks
	// void StaticCloudsXYZMasks(FLinearColor& XYMask, double& ZMask);                                                          // [0x2c97800] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Starting Cloud Formation
	// void StartingCloudFormation();                                                                                           // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Increase Tick Frequency
	// bool IncreaseTickFrequency();                                                                                            // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Simplified Sun Glow Color
	// void SimplifiedSunGlowColor(FLinearColor& Out);                                                                          // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Size Cache Arrays
	// void SizeCacheArrays();                                                                                                  // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Is Lens Flare Enabled
	// void IsLensFlareEnabled(bool& Yes);                                                                                      // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Exposure Bias
	// void CurrentExposureBias(double& Bias);                                                                                  // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Monitor for Changes
	// void MonitorforChanges();                                                                                                // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Scaled Cache Period
	// void ScaledCachePeriod(double& Period);                                                                                  // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Get Cached Vector
	// void GetCachedVector(TEnumAsByte<UDS_CachedProperties> Property, FVector& Value);                                        // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cache Vector
	// void CacheVector(TEnumAsByte<UDS_CachedProperties> Property, FVector SetValue);                                          // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cache Sun and Moon Orientation
	// void CacheSunandMoonOrientation();                                                                                       // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Get Cached Color
	// void GetCachedColor(TEnumAsByte<UDS_CachedProperties> Property, FLinearColor& Value);                                    // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cache Color
	// void CacheColor(TEnumAsByte<UDS_CachedProperties> Property, FLinearColor SetValue);                                      // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Set Cache Alpha
	// void SetCacheAlpha();                                                                                                    // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cache Float
	// void CacheFloat(TEnumAsByte<UDS_CachedProperties> Property, double SetValue);                                            // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cache Properties
	// void CacheProperties();                                                                                                  // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Get Cached Float
	// void GetCachedFloat(TEnumAsByte<UDS_CachedProperties> Property, double& Value);                                          // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Sun Height
	// void SunHeight(double& Z);                                                                                               // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Filtered Moon Light Intensity
	// void FilteredMoonLightIntensity(double Unfiltered, double& Intensity);                                                   // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Both Cloud Shadows MIDs
	// void BothCloudShadowsMIDs(TArray<UMaterialInstanceDynamic*>& Out);                                                       // [0x2c97800] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Sun Shadows MIDs
	// void SunShadowsMIDs(TArray<UMaterialInstanceDynamic*>& Out);                                                             // [0x2c97800] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Initialize Occlusion
	// void InitializeOcclusion();                                                                                              // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Exposure Bias
	// void UpdateExposureBias();                                                                                               // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Tick Time Transition
	// void TickTimeTransition();                                                                                               // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Finish Time Transition
	// void FinishTimeTransition();                                                                                             // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Transition Time of Day
	// void TransitionTimeofDay(double NewTimeofDay, double TransitionDuration_Seconds_, TEnumAsByte<EEasingFunc> EasingFunction, double EasingExponent, bool AllowTimeGoingBackwards); // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Directional Light Dimming
	// void DirectionalLightDimming(double& Out);                                                                               // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Lens Flare Parent Material
	// void LensFlareParentMaterial(TWeakObjectPtr<UMaterialInterface*>& Mat);                                                  // [0x2c97800] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cloud Shadows Parent Material
	// void CloudShadowsParentMaterial(TWeakObjectPtr<UMaterialInterface*>& Mat);                                               // [0x2c97800] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Static Clouds Parent Material
	// void StaticCloudsParentMaterial(TWeakObjectPtr<UMaterialInterface*>& Material);                                          // [0x2c97800] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.2D Clouds Base Texture
	// void _2DCloudsBaseTexture(TWeakObjectPtr<UTexture2D*>& Tex);                                                             // [0x2c97800] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Load Required Assets
	// void LoadRequiredAssets();                                                                                               // [0x2c97800] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Moon Source Angle
	// void CurrentMoonSourceAngle(double& Out);                                                                                // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Twilight Brightness Falloff
	// void TwilightBrightnessFalloff(double Z, double& Scale);                                                                 // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Applied Cloud Top and Bottom
	// void CurrentAppliedCloudTopandBottom(double& Bottom, double& Top);                                                       // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Set Up Overcast Turbulence
	// void SetUpOvercastTurbulence();                                                                                          // [0x2c97800] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Overcast Turbulence
	// void UpdateOvercastTurbulence();                                                                                         // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Current Volumetric Clouds MID
	// void UpdateCurrentVolumetricCloudsMID();                                                                                 // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Max Trace Distance
	// void CurrentMaxTraceDistance(double& Out);                                                                               // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Volumetric Clouds Base Clouds Texture
	// void VolumetricCloudsBaseCloudsTexture(TWeakObjectPtr<UTexture2D*>& Tex);                                                // [0x2c97800] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Is Location Inside Cloud Layer
	// void IsLocationInsideCloudLayer(FVector Location, bool& Inside);                                                         // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sun Source Angle
	// void CurrentSunSourceAngle(double& Out);                                                                                 // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cancel Shadows Value
	// void CancelShadowsValue(FVector LightVector, double& Out);                                                               // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cloud Shadows Light Vector Process
	// void CloudShadowsLightVectorProcess(FVector Vector, FLinearColor& Out);                                                  // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Apply Console Variable with Check
	// void ApplyConsoleVariablewithCheck(FString Cvar, double setting, int32_t Type);                                          // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Moon Light Color
	// void CurrentMoonLightColor(FLinearColor& Color);                                                                         // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Simplified Current Color
	// void SimplifiedCurrentColor(FLinearColor DayColor, FLinearColor Dawn_DuskColor, FLinearColor NightColor, FLinearColor& Out); // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Directional Inscattering Multiplier
	// void DirectionalInscatteringMultiplier(double& Multiplier);                                                              // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Query Project Settings
	// void QueryProjectSettings();                                                                                             // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Sky Atmosphere Fog Contribution
	// void SkyAtmosphereFogContribution(double& Output);                                                                       // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Volumetric Cloud Layer Scale
	// void VolumetricCloudLayerScale(double& LayerScale);                                                                      // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Volumetric Cloud Shadows Altitude
	// void VolumetricCloudShadowsAltitude(double& CloudShadowsAltitude);                                                       // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Volumetric Cloud Top Altitude
	// void VolumetricCloudTopAltitude(double& CloudTopAltitude);                                                               // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Volumetric Cloud Layer Height
	// void VolumetricCloudLayerHeight(double& LayerHeight);                                                                    // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Volumetric Cloud Base Cloud Height
	// void VolumetricCloudBaseCloudHeight(double& BaseCloudHeight);                                                            // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sky Ambient Color
	// void CurrentSkyAmbientColor(FLinearColor& SkyAmbientColor);                                                              // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Fog Directional Inscattering Color
	// void CurrentFogDirectionalInscatteringColor(FLinearColor& DirectionalInscatteringColor);                                 // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Fog Inscattering Color
	// void CurrentFogInscatteringColor(FLinearColor& InscatteringColor);                                                       // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Get Current Fog Base Colors
	// void GetCurrentFogBaseColors(FLinearColor& AmbientFogColor, FLinearColor& DirectionalBaseColor, FLinearColor& ScaledDirectionalBaseColor); // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Scale Sample Count
	// void ScaleSampleCount(double In, double& Out);                                                                           // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Fire Editor Dispatchers
	// void FireEditorDispatchers();                                                                                            // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Overcast Swirl
	// double CurrentOvercastSwirl();                                                                                           // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Wisps Opacity
	// double CurrentWispsOpacity();                                                                                            // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Sky MID Cloud Density
	// double SkyMIDCloudDensity();                                                                                             // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Overall Intensity
	// double CurrentOverallIntensity();                                                                                        // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Lit Intensity
	// double CurrentLitIntensity();                                                                                            // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Saturation
	// double CurrentSaturation();                                                                                              // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Fog Start Distance
	// double FogStartDistance();                                                                                               // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Fog Height Falloff
	// double FogHeightFalloff();                                                                                               // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Fog Density
	// double CurrentFogDensity();                                                                                              // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Get Sky MID Parent Material Instance
	// TWeakObjectPtr<UMaterialInterface*> GetSkyMIDParentMaterialInstance();                                                   // [0x2c97800] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sunset Event Time
	// double CurrentSunsetEventTime();                                                                                         // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sunrise Event Time
	// double CurrentSunriseEventTime();                                                                                        // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Clouds Time of Day Factor
	// double CloudsTimeofDayFactor();                                                                                          // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Total Time Elapsed
	// double TotalTimeElapsed();                                                                                               // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.H/M/S/MS to Time of Day
	// void H_M_S_MStoTimeofDay(int32_t Hours, int32_t Minutes, int32_t Seconds, int32_t Miliseconds, double& time);            // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Convert Time of Day to Time Code
	// void ConvertTimeofDaytoTimeCode(double time, FTimecode& Timecode);                                                       // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Time of Day Offset
	// double TimeofDayOffset();                                                                                                // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current 2D Cloud Tint
	// FLinearColor Current2DCloudTint();                                                                                       // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Night Filter
	// double NightFilter();                                                                                                    // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Find Overall Intensity
	// double FindOverallIntensity(double CloudDarkening);                                                                      // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cloud Darkening
	// double CloudDarkening();                                                                                                 // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Absent Directional Lights Brightness
	// double AbsentDirectionalLightsBrightness();                                                                              // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Moon Phase Multiplier
	// double MoonPhaseMultiplier(double& WithoutLightBrightness);                                                              // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Gate With Current Changes
	// bool GateWithCurrentChanges(bool CloudsChanging, bool FogChanging, bool DustChanging);                                   // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Using 2D Clouds
	// bool Using2DClouds();                                                                                                    // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Dimming Directional Lights
	// bool DimmingDirectionalLights();                                                                                         // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Use Sky Atmosphere
	// bool UseSkyAtmosphere();                                                                                                 // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Light Pollution
	// FLinearColor CurrentLightPollution();                                                                                    // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Overcast Light Contribution
	// FLinearColor OvercastLightContribution(bool ForVolumetricClouds);                                                        // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Aurora Intensity
	// double CurrentAuroraIntensity();                                                                                         // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Night Sky Glow
	// FLinearColor CurrentNightSkyGlow();                                                                                      // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Stars Color
	// FLinearColor CurrentStarsColor();                                                                                        // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Rayleigh Scattering Color
	// FLinearColor CurrentRayleighScatteringColor();                                                                           // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Mie Scattering Scale
	// double CurrentMieScatteringScale();                                                                                      // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Mie Anisotropy
	// double CurrentMieAnisotropy();                                                                                           // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Get Current Sky Light Color and Intensity
	// void GetCurrentSkyLightColorandIntensity(double& OutIntensity, FLinearColor& OutColor);                                  // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sky Light Lower Hemisphere Color
	// FLinearColor CurrentSkyLightLowerHemisphereColor();                                                                      // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Moon Light Material Color
	// FLinearColor CurrentMoonLightMaterialColor();                                                                            // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Moon Lit Percent
	// double CurrentMoonLitPercent();                                                                                          // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Moon Material Intensity
	// double CurrentMoonMaterialIntensity();                                                                                   // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Moon Phase Angle
	// FLinearColor CurrentMoonPhaseAngle();                                                                                    // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Moon Scale and Cutout Value
	// void CurrentMoonScaleandCutoutValue(double& Scale, double& Cutout);                                                      // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Moon Light Specular Scale
	// double MoonLightSpecularScale();                                                                                         // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Moon Light Volumetric Scattering Intensity
	// double MoonLightVolumetricScatteringIntensity();                                                                         // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Is Moon Light Casting Shadows
	// void IsMoonLightCastingShadows(bool& Yes);                                                                               // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Unfiltered Moon Light Intensity
	// void UnfilteredMoonLightIntensity(double& Out);                                                                          // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sun Radius
	// double CurrentSunRadius();                                                                                               // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sun Light Intensity
	// double CurrentSunLightIntensity();                                                                                       // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Is Sun Light Casting Shadows
	// void IsSunLightCastingShadows(bool& Yes);                                                                                // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sun Light Color
	// FLinearColor CurrentSunLightColor();                                                                                     // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sun Disk Color
	// FLinearColor CurrentSunDiskColor();                                                                                      // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Sun Disk Intensity
	// double CurrentSunDiskIntensity();                                                                                        // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cloud Shadows Cloud Density
	// double CloudShadowsCloudDensity();                                                                                       // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Get Current Cloud Shadows Intensity and Softness
	// void GetCurrentCloudShadowsIntensityandSoftness(double& Intensity, double& Softness);                                    // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Get Volumetric Cloud Emissive Colors
	// void GetVolumetricCloudEmissiveColors(FLinearColor& Bottom, FLinearColor& Top);                                          // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Z Disturbance
	// void CurrentZDisturbance(double& Out);                                                                                   // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.All Volumetric Cloud MIDs
	// void AllVolumetricCloudMIDs(bool Shadows, TArray<UMaterialInstanceDynamic*>& MIDs);                                      // [0x2c97800] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Base Clouds Scale
	// double CurrentBaseCloudsScale();                                                                                         // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cloud Texture Velocity
	// FVector CloudTextureVelocity();                                                                                          // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Lerp to Simplified Clouds
	// void CurrentLerptoSimplifiedClouds(double& Alpha);                                                                       // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Volumetric Clouds Parent Materials
	// void VolumetricCloudsParentMaterials(TWeakObjectPtr<UMaterialInterface*>& Simplified, TWeakObjectPtr<UMaterialInterface*>& Complex); // [0x2c97800] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Volumetric Cloud Macro Variation
	// double CurrentVolumetricCloudMacroVariation();                                                                           // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Volumetric Cloud Albedo
	// FLinearColor CurrentVolumetricCloudAlbedo();                                                                             // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Volumetric Cloud Multiscattering Occlusion
	// void CurrentVolumetricCloudMultiscatteringOcclusion(double& Occlusion);                                                  // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Volumetric Cloud Subnoise Amount
	// void CurrentVolumetricCloudSubnoiseAmount(double& Erosion);                                                              // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Volumetric Cloud Taper Position
	// void CurrentVolumetricCloudTaperPosition(double& Taper);                                                                 // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Get Current Volumetric Cloud Extinction Scales
	// void GetCurrentVolumetricCloudExtinctionScales(double& Top, double& Bottom);                                             // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Current Volumetric Clouds Density
	// double CurrentVolumetricCloudsDensity();                                                                                 // [0x2c97800] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Dynamic Sky Light Multiplier
	// void UpdateDynamicSkyLightMultiplier();                                                                                  // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Transition Sky Light Intensity
	// void TransitionSkyLightIntensity(double NewSkyLightIntensityMultiplier, double TransitionTime);                          // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Lens Flare
	// void UpdateLensFlare();                                                                                                  // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Set Up Lens Flare
	// void SetUpLensFlare();                                                                                                   // [0x2c97800] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Apply Volumetric Mode
	// void ApplyVolumetricMode(TEnumAsByte<UDS_VolRT_Mode> Mode);                                                              // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Moon Parameters
	// void UpdateMoonParameters();                                                                                             // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Find Real Sunset/Sunrise Times
	// void FindRealSunset_SunriseTimes();                                                                                      // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Apply Saved UDS and UDW State
	// void ApplySavedUDSandUDWState(FUDS_and_UDW_State State);                                                                 // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Create UDS and UDW State for Saving
	// void CreateUDSandUDWStateforSaving(FUDS_and_UDW_State& PackagedState);                                                   // [0x2c97800] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Replicated Time
	// void UpdateReplicatedTime();                                                                                             // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Static Clouds
	// void UpdateStaticClouds();                                                                                               // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.OnRep_Replicated Time of Day
	// void OnRep_ReplicatedTimeofDay();                                                                                        // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Get Current Date and Time
	// void GetCurrentDateandTime(FDateTime& CurrentDateandTime);                                                               // [0x2c97800] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Check for Daylight Savings Time
	// void CheckforDaylightSavingsTime();                                                                                      // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Increment Day
	// void IncrementDay();                                                                                                     // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Force Valid Day
	// void ForceValidDay();                                                                                                    // [0x2c97800] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Approximate Real Sun Moon and Stars
	// void ApproximateRealSunMoonandStars(int32_t Month, int32_t Day, int32_t Year, double TimeofDay, double TimeZone, bool OnlyCalculateSun, FVector& SunVector, FVector& MoonVector, double& RealPhase, FVector& PhaseAlignment, double& CelestialOrbit, FLinearColor& CelestialYaw); // [0x2c97800] Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Set Date and Time
	// void SetDateandTime(FDateTime DateTime);                                                                                 // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Directional Light Rotations
	// void UpdateDirectionalLightRotations();                                                                                  // [0x2c97800] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Recapture Sky Light
	// void RecaptureSkyLight();                                                                                                // [0x2c97800] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Settings Based On Platform And Scalability
	// void UpdateSettingsBasedOnPlatformAndScalability();                                                                      // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Variables Controlled By Weather
	// void UpdateVariablesControlledByWeather();                                                                               // [0x2c97800] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Construction Script Function
	// void ConstructionScriptFunction(bool RunByCounterpart, bool MoveStaticLights);                                           // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Set Cloud Timing
	// void SetCloudTiming();                                                                                                   // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Static Variables
	// void UpdateStaticVariables();                                                                                            // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Set Time of Day using Time Code
	// void SetTimeofDayusingTimeCode(FTimecode TimeCode);                                                                      // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Get Time of Day in Real Time Format
	// void GetTimeofDayinRealTimeFormat(FTimecode& time);                                                                      // [0x2c97800] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Active Variables
	// void UpdateActiveVariables();                                                                                            // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Set Sun and Moon Root Rotation
	// void SetSunandMoonRootRotation();                                                                                        // [0x2c97800] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Day Ended
	// void DayEnded();                                                                                                         // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Restart Inside Cloud Fog
	// void RestartInsideCloudFog();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Replicated ToD
	// void UpdateReplicatedToD();                                                                                              // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Timed Override with New Changes
	// void TimedOverridewithNewChanges();                                                                                      // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Force Startup
	// void ForceStartup();                                                                                                     // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.ExecuteUbergraph_Ultra_Dynamic_Sky
	// void ExecuteUbergraph_Ultra_Dynamic_Sky(int32_t EntryPoint);                                                             // [0x2c97800] Final|HasDefaults    
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Hourly__DelegateSignature
	// void Hourly__DelegateSignature(int32_t Hour);                                                                            // [0x2c97800] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Midnight__DelegateSignature
	// void Midnight__DelegateSignature();                                                                                      // [0x2c97800] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Sunrise__DelegateSignature
	// void Sunrise__DelegateSignature();                                                                                       // [0x2c97800] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Assets/Packs/UltraDynamicSky/Blueprints/Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Sunset__DelegateSignature
	// void Sunset__DelegateSignature();                                                                                        // [0x2c97800] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Struct /Game/Assets/Packs/UltraDynamicSky/Blueprints/System/RandomWeatherVariation_State.RandomWeatherVariation_State
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FRandomWeatherVariation_State
{ 
	class UUDS_Weather_Settings_C*                     TargetRandomWeatherType_22_BBFDBC5E46C25F1DFB0037A44AB6D268; // 0x0000   (0x0008)  
	double                                             CurrentLerpAlpha_5_659CCE944698D027E31F1C9F648EBD85;        // 0x0008   (0x0008)  
	double                                             CurrentTimerLength_7_6CC4C61F4528647B419BE189C0944ADF;      // 0x0010   (0x0008)  
	class UUDS_Weather_Settings_C*                     LastRandomWeatherType_24_4367B1AC4E64A2564E3960B3ED6E25D8;  // 0x0018   (0x0008)  
};

/// Struct /Game/Assets/Packs/UltraDynamicSky/Blueprints/System/UDS_and_UDW_State.UDS_and_UDW_State
/// Size: 0x0178 (376 bytes) (0x000000 - 0x000178) align 8 MaxSize: 0x0178
struct FUDS_and_UDW_State
{ 
	double                                             TimeofDay_2_2DF54613424D82C28D8AF38B5CCC017E;               // 0x0000   (0x0008)  
	FDateTime                                          SimulationDate_6_6AAFF3384452285DB969FABE6CC7502E;          // 0x0008   (0x0008)  
	int32_t                                            TotalDaysElapsed_10_85A4D6E54B4BA738A5AAD08B278168AC;       // 0x0010   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0014   (0x0004)  MISSED
	double                                             UDS_CloudCoverage_14_5BE3DD95403439E0DC4FC7B950B72734;      // 0x0018   (0x0008)  
	double                                             MoonPhase_16_00C2557E44B4CE73A824F2977842EF06;              // 0x0020   (0x0008)  
	bool                                               IncludesUDWState_19_4B877A784EE94D12717D3998B8494AC4;       // 0x0028   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0029   (0x0007)  MISSED
	FRandomWeatherVariation_State                      UDWRandomWeatherState_27_74741D5149E4365461FC87BA73842B8C;  // 0x0030   (0x0020)  
	TMap<class AActor*, FRandomWeatherVariation_State> WeatherOverrideVolumeStates_87_56B54B4D46756590EAD0B08CF93C14E3; // 0x0050   (0x0050)  
	int32_t                                            TransitionState_35_8C2DC6CD4C7139677FD63AA06BA2C6F4;        // 0x00A0   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x00A4   (0x0004)  MISSED
	double                                             Rain_77_C55FBB284F0FA74378B1C39AC4A25456;                   // 0x00A8   (0x0008)  
	double                                             CloudCoverage_71_02CFC88541ECA075F65C67BAD5B8203D;          // 0x00B0   (0x0008)  
	double                                             Snow_78_9681DBA0451D944F00450C8885948EAA;                   // 0x00B8   (0x0008)  
	double                                             WindIntensity_73_8CA9E58B4FAD1966869DACA837B2A72D;          // 0x00C0   (0x0008)  
	double                                             ChangeWeatherTimer_50_353A99B84ED03DA03DEB1389AF8AB999;     // 0x00C8   (0x0008)  
	double                                             GlobalMaterialSnow_60_DCFC3F844EF772ED4960F19588F2CD65;     // 0x00D0   (0x0008)  
	double                                             GlobalMaterialWetness_62_EF1D972F47EF0C4206D6D1B6BB645291;  // 0x00D8   (0x0008)  
	double                                             Timer_65_5497A6734CE6FEB9AD91B28233665806;                  // 0x00E0   (0x0008)  
	double                                             LerptoNewSettings_67_D4D699EB4BB843F0AE80E4BFC8CFA364;      // 0x00E8   (0x0008)  
	double                                             LerptoStaticSettings_69_384B646448CA6A50EA63CBA209165004;   // 0x00F0   (0x0008)  
	class UUDS_Weather_Settings_C*                     WeatherType_76_08B587F84A8CD9310B9F92A3DA6F0430;            // 0x00F8   (0x0008)  
	double                                             Fog_81_AB014F324CE4705268C835AA3B28780F;                    // 0x0100   (0x0008)  
	double                                             Dust_83_C8EF6CC546A4F7465C50638A87E6A9DF;                   // 0x0108   (0x0008)  
	double                                             ThunderLightning_85_D0D5D684439450DDEB610BB9887DFA49;       // 0x0110   (0x0008)  
	double                                             OldCloudCoverage_90_9DA4B7F2482756F255C9F3ACEA84CEB6;       // 0x0118   (0x0008)  
	double                                             OldRain_92_2D7B3F404B01E98C1B62FC823CF05DF0;                // 0x0120   (0x0008)  
	double                                             OldWindIntensity_94_7BC1A37A41701A2B8E6C209D587237E7;       // 0x0128   (0x0008)  
	double                                             OldSnow_96_426BC726469C3D0110892CB349FCEB42;                // 0x0130   (0x0008)  
	double                                             OldThunderLightning_98_E14B8AC9466340F5002D58ACB121FF69;    // 0x0138   (0x0008)  
	double                                             OldFog_100_AA682BF94677D2B24155EFA05CAF9554;                // 0x0140   (0x0008)  
	double                                             OldDust_102_44BDD5874F97511F1FFA7C956D9A3761;               // 0x0148   (0x0008)  
	double                                             OldMaterialWetness_104_D03595C246E3BDFC836DC7863893F348;    // 0x0150   (0x0008)  
	double                                             OldMaterialSnowCoverage_106_3517C89C408AFCDFC97F98A3701F4AD1; // 0x0158   (0x0008)  
	double                                             OldMaterialDustCoverage_108_DFEDC41542E57030BBCC1C9BA56F5327; // 0x0160   (0x0008)  
	double                                             OldLerptoStaticSettings_110_B2656AFF4C934F6396DFE1B54A896FEB; // 0x0168   (0x0008)  
	double                                             TransitionInTime_112_6C36DE934526345F443A3D87ADD96AA1;      // 0x0170   (0x0008)  
};

#pragma pack(pop)


static_assert(sizeof(UUDS_Weather_Settings_C) == 0x0080); // 128 bytes (0x000030 - 0x000080)
static_assert(sizeof(UUltra_Dynamic_Weather_Interface_C) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UUDS_PlayerOcclusion_C) == 0x013A); // 314 bytes (0x0000A0 - 0x00013A)
static_assert(sizeof(FUDS_Post_Process_Stage) == 0x0708); // 1800 bytes (0x000000 - 0x000708)
static_assert(sizeof(AUltra_Dynamic_Sky_C) == 0x1758); // 5976 bytes (0x000290 - 0x001758)
static_assert(sizeof(FRandomWeatherVariation_State) == 0x0020); // 32 bytes (0x000000 - 0x000020)
static_assert(sizeof(FUDS_and_UDW_State) == 0x0178); // 376 bytes (0x000000 - 0x000178)
static_assert(offsetof(UUDS_PlayerOcclusion_C, UberGraphFrame) == 0x00A0);
static_assert(offsetof(UUDS_PlayerOcclusion_C, Occlusion_Location) == 0x00A8);
