
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: Actions
/// dependency: AnimGraphRuntime
/// dependency: CoreUObject
/// dependency: Data
/// dependency: DataContainer
/// dependency: Engine
/// dependency: GameplayCameras
/// dependency: HorizonUI
/// dependency: InputCore
/// dependency: InputMapping
/// dependency: MediaAssets
/// dependency: OnlineSubsystemBlueprints
/// dependency: OpenIcon
/// dependency: PlayFab
/// dependency: POLYGON
/// dependency: SettingControls
/// dependency: SlateCore
/// dependency: SteamCore
/// dependency: TransformCuller
/// dependency: UMG
/// dependency: VaRest

#pragma pack(push, 0x1)

/// Enum /Game/UI/Game/SpawnScreen/E_SpawnTargetPermission.E_SpawnTargetPermission
/// Size: 0x01 (1 bytes)
enum class E_SpawnTargetPermission : uint8_t
{
	E_SpawnTargetPermission__NewEnumerator3                                          = 0,
	E_SpawnTargetPermission__NewEnumerator1                                          = 1,
	E_SpawnTargetPermission__NewEnumerator0                                          = 2,
	E_SpawnTargetPermission__NewEnumerator4                                          = 3,
	E_SpawnTargetPermission__NewEnumerator6                                          = 4,
	E_SpawnTargetPermission__NewEnumerator2                                          = 5
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Base/BP_Gear_Patch_Base.BP_Gear_Patch_Base_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Base_C : public AItem_Gear_Patch
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Skin/Woodland/BP_Item_Gear_Skin_Woodland.BP_Item_Gear_Skin_Woodland_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Gear_Skin_Woodland_C : public AItem_Gear_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Gear/Skin/Urban/BP_Item_Gear_Skin_DigitalUrban.BP_Item_Gear_Skin_DigitalUrban_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Gear_Skin_DigitalUrban_C : public AItem_Gear_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Gear/Skin/Taiga/BP_Item_Gear_Skin_Taiga.BP_Item_Gear_Skin_Taiga_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Gear_Skin_Taiga_C : public AItem_Gear_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Gear/Skin/SWAT/BP_Item_Gear_Skin_SWAT.BP_Item_Gear_Skin_SWAT_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Gear_Skin_SWAT_C : public AItem_Gear_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Gear/Skin/NATO/BP_Item_Gear_Skin_NATO.BP_Item_Gear_Skin_NATO_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Gear_Skin_NATO_C : public AItem_Gear_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Gear/Skin/Flecktarn/BP_Item_Gear_Skin_Flecktarn.BP_Item_Gear_Skin_Flecktarn_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Gear_Skin_Flecktarn_C : public AItem_Gear_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Gear/Skin/DigitalFlora/BP_Item_Gear_Skin_DigitalFlora.BP_Item_Gear_Skin_DigitalFlora_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Gear_Skin_DigitalFlora_C : public AItem_Gear_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Gear/Skin/BattleShirt/BP_Item_Gear_Skin_BattleShirt.BP_Item_Gear_Skin_BattleShirt_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Gear_Skin_BattleShirt_C : public AItem_Gear_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Gear/Skin/Adidas/BP_Item_Gear_Skin_Adidas.BP_Item_Gear_Skin_Adidas_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Gear_Skin_Adidas_C : public AItem_Gear_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Redaster/BP_Gear_Patch_Flag_Redaster.BP_Gear_Patch_Flag_Redaster_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_Redaster_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/PCL/BP_Gear_Patch_PCL.BP_Gear_Patch_PCL_C
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ABP_Gear_Patch_PCL_C : public ABP_Gear_Patch_Base_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Patch/PCL/BP_Gear_Patch_PCL.BP_Gear_Patch_PCL_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Patch/PCL/BP_Gear_Patch_PCL.BP_Gear_Patch_PCL_C.ExecuteUbergraph_BP_Gear_Patch_PCL
	// void ExecuteUbergraph_BP_Gear_Patch_PCL(int32_t EntryPoint);                                                             // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Medic/BP_Gear_Patch_Medic.BP_Gear_Patch_Medic_C
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ABP_Gear_Patch_Medic_C : public ABP_Gear_Patch_Base_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Patch/Medic/BP_Gear_Patch_Medic.BP_Gear_Patch_Medic_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Patch/Medic/BP_Gear_Patch_Medic.BP_Gear_Patch_Medic_C.ExecuteUbergraph_BP_Gear_Patch_Medic
	// void ExecuteUbergraph_BP_Gear_Patch_Medic(int32_t EntryPoint);                                                           // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/USA/BP_Gear_Patch_Flag_USA.BP_Gear_Patch_Flag_USA_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_USA_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/TR/BP_Gear_Patch_Flag_Turkey.BP_Gear_Patch_Flag_Turkey_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_Turkey_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/RU/BP_Gear_Patch_Flag_Russia.BP_Gear_Patch_Flag_Russia_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_Russia_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/Pirat/BP_Gear_Patch_Flag_Pirat.BP_Gear_Patch_Flag_Pirat_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_Pirat_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/IN/BP_Gear_Patch_Flag_India.BP_Gear_Patch_Flag_India_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_India_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/GB/BP_Gear_Patch_Flag_GB.BP_Gear_Patch_Flag_GB_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_GB_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/FR/BP_Gear_Patch_Flag_France.BP_Gear_Patch_Flag_France_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_France_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/ES/BP_Gear_Patch_Flag_Spain.BP_Gear_Patch_Flag_Spain_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_Spain_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/DE/BP_Gear_Patch_Flag_Germany.BP_Gear_Patch_Flag_Germany_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_Germany_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/CN/BP_Gear_Patch_Flag_China.BP_Gear_Patch_Flag_China_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_China_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/CA/BP_Gear_Patch_Flag_Canada.BP_Gear_Patch_Flag_Canada_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_Canada_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/BR/BP_Gear_Patch_Flag_Brazil.BP_Gear_Patch_Flag_Brazil_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_Brazil_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Gear/Patch/Flags/AU/BP_Gear_Patch_Flag_Australia.BP_Gear_Patch_Flag_Australia_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Gear_Patch_Flag_Australia_C : public ABP_Gear_Patch_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Secondary/Pistol/DesertEagle/Assets/Animations/APB_Pistol_DesertEagle.APB_Pistol_DesertEagle_C
/// Size: 0x03D8 (984 bytes) (0x000348 - 0x0003D8) align 16 MaxSize: 0x03D8
class UAPB_Pistol_DesertEagle_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0348   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0358   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0360   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0368   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x0388   (0x0048)  
	class UStaticMeshComponent*                        SpareMagazineMesh;                                          // 0x03D0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Secondary/Pistol/DesertEagle/Assets/Animations/APB_Pistol_DesertEagle.APB_Pistol_DesertEagle_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Secondary/Pistol/DesertEagle/Assets/Animations/APB_Pistol_DesertEagle.APB_Pistol_DesertEagle_C.AnimNotify_SpareMag_End
	// void AnimNotify_SpareMag_End();                                                                                          // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Secondary/Pistol/DesertEagle/Assets/Animations/APB_Pistol_DesertEagle.APB_Pistol_DesertEagle_C.AnimNotify_SpareMag_Start
	// void AnimNotify_SpareMag_Start();                                                                                        // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Secondary/Pistol/DesertEagle/Assets/Animations/APB_Pistol_DesertEagle.APB_Pistol_DesertEagle_C.ExecuteUbergraph_APB_Pistol_DesertEagle
	// void ExecuteUbergraph_APB_Pistol_DesertEagle(int32_t EntryPoint);                                                        // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Game/Player/CameraShake/Shots/CameraShake_SniperShot.CameraShake_SniperShot_C
/// Size: 0x0210 (528 bytes) (0x000210 - 0x000210) align 16 MaxSize: 0x0210
class UCameraShake_SniperShot_C : public ULegacyCameraShake
{ 
public:
};

/// Class /Game/Blueprints/Game/Player/CameraShake/Shots/CameraShake_RifleShot.CameraShake_RifleShot_C
/// Size: 0x0210 (528 bytes) (0x000210 - 0x000210) align 16 MaxSize: 0x0210
class UCameraShake_RifleShot_C : public ULegacyCameraShake
{ 
public:
};

/// Class /Game/Blueprints/Game/Player/CameraShake/Shots/CameraShake_PistolShot.CameraShake_PistolShot_C
/// Size: 0x0210 (528 bytes) (0x000210 - 0x000210) align 16 MaxSize: 0x0210
class UCameraShake_PistolShot_C : public ULegacyCameraShake
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/VSS/BP_Item_Sniper_VSS.BP_Item_Sniper_VSS_C
/// Size: 0x0780 (1920 bytes) (0x000770 - 0x000780) align 16 MaxSize: 0x0780
class ABP_Item_Sniper_VSS_C : public AItem_Gun_Sniper
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        PicatinnyRail;                                              // 0x0778   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/VSS/BP_Item_Sniper_VSS.BP_Item_Sniper_VSS_C.SetSight
	// void SetSight();                                                                                                         // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/VSS/BP_Item_Sniper_VSS.BP_Item_Sniper_VSS_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/VSS/BP_Item_Sniper_VSS.BP_Item_Sniper_VSS_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/VSS/BP_Item_Sniper_VSS.BP_Item_Sniper_VSS_C.ExecuteUbergraph_BP_Item_Sniper_VSS
	// void ExecuteUbergraph_BP_Item_Sniper_VSS(int32_t EntryPoint);                                                            // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/Mk14/BP_Item_Sniper_Mk14.BP_Item_Sniper_Mk14_C
/// Size: 0x0780 (1920 bytes) (0x000770 - 0x000780) align 16 MaxSize: 0x0780
class ABP_Item_Sniper_Mk14_C : public AItem_Gun_Sniper
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        PicatinnyRail;                                              // 0x0778   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/Mk14/BP_Item_Sniper_Mk14.BP_Item_Sniper_Mk14_C.SetSight
	// void SetSight();                                                                                                         // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/Mk14/BP_Item_Sniper_Mk14.BP_Item_Sniper_Mk14_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/Mk14/BP_Item_Sniper_Mk14.BP_Item_Sniper_Mk14_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/Mk14/BP_Item_Sniper_Mk14.BP_Item_Sniper_Mk14_C.ExecuteUbergraph_BP_Item_Sniper_Mk14
	// void ExecuteUbergraph_BP_Item_Sniper_Mk14(int32_t EntryPoint);                                                           // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/M24/BP_Item_Sniper_M24.BP_Item_Sniper_M24_C
/// Size: 0x0780 (1920 bytes) (0x000770 - 0x000780) align 16 MaxSize: 0x0780
class ABP_Item_Sniper_M24_C : public AItem_Gun_Sniper
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        IronSight;                                                  // 0x0778   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/M24/BP_Item_Sniper_M24.BP_Item_Sniper_M24_C.SetSight
	// void SetSight();                                                                                                         // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/M24/BP_Item_Sniper_M24.BP_Item_Sniper_M24_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/M24/BP_Item_Sniper_M24.BP_Item_Sniper_M24_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Sniper/M24/BP_Item_Sniper_M24.BP_Item_Sniper_M24_C.ExecuteUbergraph_BP_Item_Sniper_M24
	// void ExecuteUbergraph_BP_Item_Sniper_M24(int32_t EntryPoint);                                                            // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/SMG/Vector/BP_Item_Rifle_Vector.BP_Item_Rifle_Vector_C
/// Size: 0x0780 (1920 bytes) (0x000770 - 0x000780) align 16 MaxSize: 0x0780
class ABP_Item_Rifle_Vector_C : public AItem_Gun_Rifle
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        IronSight;                                                  // 0x0778   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/SMG/Vector/BP_Item_Rifle_Vector.BP_Item_Rifle_Vector_C.SetSight
	// void SetSight();                                                                                                         // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/SMG/Vector/BP_Item_Rifle_Vector.BP_Item_Rifle_Vector_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/SMG/Vector/BP_Item_Rifle_Vector.BP_Item_Rifle_Vector_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/SMG/Vector/BP_Item_Rifle_Vector.BP_Item_Rifle_Vector_C.ExecuteUbergraph_BP_Item_Rifle_Vector
	// void ExecuteUbergraph_BP_Item_Rifle_Vector(int32_t EntryPoint);                                                          // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/SMG/G36C/BP_Item_Rifle_G36C.BP_Item_Rifle_G36C_C
/// Size: 0x0778 (1912 bytes) (0x000770 - 0x000778) align 16 MaxSize: 0x0778
class ABP_Item_Rifle_G36C_C : public AItem_Gun_Rifle
{ 
public:
	class UStaticMeshComponent*                        Sight;                                                      // 0x0770   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/BP_Item_Rifle_ScarH.BP_Item_Rifle_ScarH_C
/// Size: 0x0790 (1936 bytes) (0x000770 - 0x000790) align 16 MaxSize: 0x0790
class ABP_Item_Rifle_ScarH_C : public AItem_Gun_Rifle
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        Aim_A_Base;                                                 // 0x0778   (0x0008)  
	class UStaticMeshComponent*                        Aim_B;                                                      // 0x0780   (0x0008)  
	class UStaticMeshComponent*                        Aim_A;                                                      // 0x0788   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/BP_Item_Rifle_ScarH.BP_Item_Rifle_ScarH_C.SetSight
	// void SetSight();                                                                                                         // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/BP_Item_Rifle_ScarH.BP_Item_Rifle_ScarH_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/BP_Item_Rifle_ScarH.BP_Item_Rifle_ScarH_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/BP_Item_Rifle_ScarH.BP_Item_Rifle_ScarH_C.ExecuteUbergraph_BP_Item_Rifle_ScarH
	// void ExecuteUbergraph_BP_Item_Rifle_ScarH(int32_t EntryPoint);                                                           // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/BP_Item_Rifle_M16A4.BP_Item_Rifle_M16A4_C
/// Size: 0x0780 (1920 bytes) (0x000770 - 0x000780) align 16 MaxSize: 0x0780
class ABP_Item_Rifle_M16A4_C : public AItem_Gun_Rifle
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        Sight;                                                      // 0x0778   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/BP_Item_Rifle_M16A4.BP_Item_Rifle_M16A4_C.SetSight
	// void SetSight();                                                                                                         // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/BP_Item_Rifle_M16A4.BP_Item_Rifle_M16A4_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/BP_Item_Rifle_M16A4.BP_Item_Rifle_M16A4_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/BP_Item_Rifle_M16A4.BP_Item_Rifle_M16A4_C.ExecuteUbergraph_BP_Item_Rifle_M16A4
	// void ExecuteUbergraph_BP_Item_Rifle_M16A4(int32_t EntryPoint);                                                           // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AsVal/BP_Item_Rifle_AsVal.BP_Item_Rifle_AsVal_C
/// Size: 0x0780 (1920 bytes) (0x000770 - 0x000780) align 16 MaxSize: 0x0780
class ABP_Item_Rifle_AsVal_C : public AItem_Gun_Rifle
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        PicatinnyRail;                                              // 0x0778   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AsVal/BP_Item_Rifle_AsVal.BP_Item_Rifle_AsVal_C.SetSight
	// void SetSight();                                                                                                         // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AsVal/BP_Item_Rifle_AsVal.BP_Item_Rifle_AsVal_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AsVal/BP_Item_Rifle_AsVal.BP_Item_Rifle_AsVal_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AsVal/BP_Item_Rifle_AsVal.BP_Item_Rifle_AsVal_C.ExecuteUbergraph_BP_Item_Rifle_AsVal
	// void ExecuteUbergraph_BP_Item_Rifle_AsVal(int32_t EntryPoint);                                                           // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/BP_Item_Rifle_AK74M.BP_Item_Rifle_AK74M_C
/// Size: 0x0780 (1920 bytes) (0x000770 - 0x000780) align 16 MaxSize: 0x0780
class ABP_Item_Rifle_AK74M_C : public AItem_Gun_Rifle
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        PicatinnyRail;                                              // 0x0778   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/BP_Item_Rifle_AK74M.BP_Item_Rifle_AK74M_C.SetSight
	// void SetSight();                                                                                                         // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/BP_Item_Rifle_AK74M.BP_Item_Rifle_AK74M_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/BP_Item_Rifle_AK74M.BP_Item_Rifle_AK74M_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/BP_Item_Rifle_AK74M.BP_Item_Rifle_AK74M_C.ExecuteUbergraph_BP_Item_Rifle_AK74M
	// void ExecuteUbergraph_BP_Item_Rifle_AK74M(int32_t EntryPoint);                                                           // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/BP_Item_Rifle_AK47.BP_Item_Rifle_AK47_C
/// Size: 0x0780 (1920 bytes) (0x000770 - 0x000780) align 16 MaxSize: 0x0780
class ABP_Item_Rifle_AK47_C : public AItem_Gun_Rifle
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        PicatinnyRail;                                              // 0x0778   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/BP_Item_Rifle_AK47.BP_Item_Rifle_AK47_C.SetSight
	// void SetSight();                                                                                                         // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/BP_Item_Rifle_AK47.BP_Item_Rifle_AK47_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/BP_Item_Rifle_AK47.BP_Item_Rifle_AK47_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/BP_Item_Rifle_AK47.BP_Item_Rifle_AK47_C.ExecuteUbergraph_BP_Item_Rifle_AK47
	// void ExecuteUbergraph_BP_Item_Rifle_AK47(int32_t EntryPoint);                                                            // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/BP_Item_Rifle_AK308.BP_Item_Rifle_AK308_C
/// Size: 0x0780 (1920 bytes) (0x000770 - 0x000780) align 16 MaxSize: 0x0780
class ABP_Item_Rifle_AK308_C : public AItem_Gun_Rifle
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        IronSight;                                                  // 0x0778   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/BP_Item_Rifle_AK308.BP_Item_Rifle_AK308_C.SetSight
	// void SetSight();                                                                                                         // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/BP_Item_Rifle_AK308.BP_Item_Rifle_AK308_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/BP_Item_Rifle_AK308.BP_Item_Rifle_AK308_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/BP_Item_Rifle_AK308.BP_Item_Rifle_AK308_C.ExecuteUbergraph_BP_Item_Rifle_AK308
	// void ExecuteUbergraph_BP_Item_Rifle_AK308(int32_t EntryPoint);                                                           // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/BP_Item_Rifle_AK12.BP_Item_Rifle_AK12_C
/// Size: 0x0780 (1920 bytes) (0x000770 - 0x000780) align 16 MaxSize: 0x0780
class ABP_Item_Rifle_AK12_C : public AItem_Gun_Rifle
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        IronSight;                                                  // 0x0778   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/BP_Item_Rifle_AK12.BP_Item_Rifle_AK12_C.SetSight
	// void SetSight();                                                                                                         // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/BP_Item_Rifle_AK12.BP_Item_Rifle_AK12_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/BP_Item_Rifle_AK12.BP_Item_Rifle_AK12_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/BP_Item_Rifle_AK12.BP_Item_Rifle_AK12_C.ExecuteUbergraph_BP_Item_Rifle_AK12
	// void ExecuteUbergraph_BP_Item_Rifle_AK12(int32_t EntryPoint);                                                            // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Secondary/Pistol/Glock17/BP_Item_Pistol_Glock17.BP_Item_Pistol_Glock17_C
/// Size: 0x0778 (1912 bytes) (0x000770 - 0x000778) align 16 MaxSize: 0x0778
class ABP_Item_Pistol_Glock17_C : public AItem_Gun_Pistol
{ 
public:
	class UTransformCullerComponent*                   TransformCuller;                                            // 0x0770   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Secondary/Pistol/DesertEagle/BP_Item_Pistol_DesertEagle.BP_Item_Pistol_DesertEagle_C
/// Size: 0x0770 (1904 bytes) (0x000770 - 0x000770) align 16 MaxSize: 0x0770
class ABP_Item_Pistol_DesertEagle_C : public AItem_Gun_Pistol
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Secondary/Pistol/Colt1911/BP_Item_Pistol_Colt1911.BP_Item_Pistol_Colt1911_C
/// Size: 0x0778 (1912 bytes) (0x000770 - 0x000778) align 16 MaxSize: 0x0778
class ABP_Item_Pistol_Colt1911_C : public AItem_Gun_Pistol
{ 
public:
	class UTransformCullerComponent*                   TransformCuller;                                            // 0x0770   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_23/BP_Item_Gear_Watch.BP_Item_Gear_Watch_23_C
/// Size: 0x0330 (816 bytes) (0x000310 - 0x000330) align 8 MaxSize: 0x0330
class ABP_Item_Gear_Watch_23_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        SM_hallowen_watch_tongue;                                   // 0x0318   (0x0008)  
	float                                              Timeline_Alpha_06A813C4477049846E6B0EBE45968639;            // 0x0320   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline__Direction_06A813C4477049846E6B0EBE45968639;       // 0x0324   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0325   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x0328   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_23/BP_Item_Gear_Watch.BP_Item_Gear_Watch_23_C.Timeline__FinishedFunc
	// void Timeline__FinishedFunc();                                                                                           // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_23/BP_Item_Gear_Watch.BP_Item_Gear_Watch_23_C.Timeline__UpdateFunc
	// void Timeline__UpdateFunc();                                                                                             // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_23/BP_Item_Gear_Watch.BP_Item_Gear_Watch_23_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_23/BP_Item_Gear_Watch.BP_Item_Gear_Watch_23_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_23/BP_Item_Gear_Watch.BP_Item_Gear_Watch_23_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_22/BP_Item_Gear_Watch.BP_Item_Gear_Watch_22_C
/// Size: 0x0340 (832 bytes) (0x000310 - 0x000340) align 8 MaxSize: 0x0340
class ABP_Item_Gear_Watch_22_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        SM_TAG_watch_arrow_hour;                                    // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        SM_TAG_watch_small_arrows;                                  // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        SM_TAG_watch_small_arrows0;                                 // 0x0328   (0x0008)  
	class UStaticMeshComponent*                        SM_TAG_watch_arrow_second;                                  // 0x0330   (0x0008)  
	class UStaticMeshComponent*                        SM_TAG_watch_arrow_minute;                                  // 0x0338   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_22/BP_Item_Gear_Watch.BP_Item_Gear_Watch_22_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_22/BP_Item_Gear_Watch.BP_Item_Gear_Watch_22_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_22/BP_Item_Gear_Watch.BP_Item_Gear_Watch_22_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_22/BP_Item_Gear_Watch.BP_Item_Gear_Watch_22_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_21/BP_Item_Gear_Watch.BP_Item_Gear_Watch_21_C
/// Size: 0x0328 (808 bytes) (0x000310 - 0x000328) align 8 MaxSize: 0x0328
class ABP_Item_Gear_Watch_21_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        SM_pacman_watch_arrow_minute;                               // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        SM_pacman_watch_arrow_hour;                                 // 0x0320   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_21/BP_Item_Gear_Watch.BP_Item_Gear_Watch_21_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_21/BP_Item_Gear_Watch.BP_Item_Gear_Watch_21_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_21/BP_Item_Gear_Watch.BP_Item_Gear_Watch_21_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_21/BP_Item_Gear_Watch.BP_Item_Gear_Watch_21_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_20/BP_Item_Gear_Watch.BP_Item_Gear_Watch_20_C
/// Size: 0x0318 (792 bytes) (0x000310 - 0x000318) align 8 MaxSize: 0x0318
class ABP_Item_Gear_Watch_20_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_20/BP_Item_Gear_Watch.BP_Item_Gear_Watch_20_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_20/BP_Item_Gear_Watch.BP_Item_Gear_Watch_20_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_20/BP_Item_Gear_Watch.BP_Item_Gear_Watch_20_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_19/BP_Item_Gear_Watch.BP_Item_Gear_Watch_19_C
/// Size: 0x0348 (840 bytes) (0x000310 - 0x000348) align 8 MaxSize: 0x0348
class ABP_Item_Gear_Watch_19_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        shar;                                                       // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        roulette;                                                   // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        arrow_min;                                                  // 0x0328   (0x0008)  
	class UStaticMeshComponent*                        arrow_hour;                                                 // 0x0330   (0x0008)  
	float                                              Timeline_Rotation_Alpha_8DEE248A29466D913D6003A9921A3E64;   // 0x0338   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_Rotation__Direction_8DEE248A29466D913D6003A9921A3E64; // 0x033C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x033D   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline_Rotation;                                          // 0x0340   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_19/BP_Item_Gear_Watch.BP_Item_Gear_Watch_19_C.Timeline_Rotation__FinishedFunc
	// void Timeline_Rotation__FinishedFunc();                                                                                  // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_19/BP_Item_Gear_Watch.BP_Item_Gear_Watch_19_C.Timeline_Rotation__UpdateFunc
	// void Timeline_Rotation__UpdateFunc();                                                                                    // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_19/BP_Item_Gear_Watch.BP_Item_Gear_Watch_19_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_19/BP_Item_Gear_Watch.BP_Item_Gear_Watch_19_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_19/BP_Item_Gear_Watch.BP_Item_Gear_Watch_19_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_19/BP_Item_Gear_Watch.BP_Item_Gear_Watch_19_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_18/BP_Item_Gear_Watch.BP_Item_Gear_Watch_18_C
/// Size: 0x0318 (792 bytes) (0x000310 - 0x000318) align 8 MaxSize: 0x0318
class ABP_Item_Gear_Watch_18_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_18/BP_Item_Gear_Watch.BP_Item_Gear_Watch_18_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_18/BP_Item_Gear_Watch.BP_Item_Gear_Watch_18_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_17/BP_Item_Gear_Watch.BP_Item_Gear_Watch_17_C
/// Size: 0x0340 (832 bytes) (0x000310 - 0x000340) align 8 MaxSize: 0x0340
class ABP_Item_Gear_Watch_17_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        SM_Watch_17_Tonque;                                         // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0328   (0x0008)  
	float                                              Timeline_Tonque_Alpha_4D0116BF424C3E385D28DCA125E75373;     // 0x0330   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_Tonque__Direction_4D0116BF424C3E385D28DCA125E75373; // 0x0334   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0335   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline_Tonque;                                            // 0x0338   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_17/BP_Item_Gear_Watch.BP_Item_Gear_Watch_17_C.Timeline_Tonque__FinishedFunc
	// void Timeline_Tonque__FinishedFunc();                                                                                    // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_17/BP_Item_Gear_Watch.BP_Item_Gear_Watch_17_C.Timeline_Tonque__UpdateFunc
	// void Timeline_Tonque__UpdateFunc();                                                                                      // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_17/BP_Item_Gear_Watch.BP_Item_Gear_Watch_17_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_17/BP_Item_Gear_Watch.BP_Item_Gear_Watch_17_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_17/BP_Item_Gear_Watch.BP_Item_Gear_Watch_17_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_17/BP_Item_Gear_Watch.BP_Item_Gear_Watch_17_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_16/BP_Item_Gear_Watch.BP_Item_Gear_Watch_16_C
/// Size: 0x0328 (808 bytes) (0x000310 - 0x000328) align 8 MaxSize: 0x0328
class ABP_Item_Gear_Watch_16_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0320   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_16/BP_Item_Gear_Watch.BP_Item_Gear_Watch_16_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_16/BP_Item_Gear_Watch.BP_Item_Gear_Watch_16_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_16/BP_Item_Gear_Watch.BP_Item_Gear_Watch_16_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_16/BP_Item_Gear_Watch.BP_Item_Gear_Watch_16_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_15/BP_Item_Gear_Watch.BP_Item_Gear_Watch_15_C
/// Size: 0x0364 (868 bytes) (0x000310 - 0x000364) align 8 MaxSize: 0x0364
class ABP_Item_Gear_Watch_15_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        SM_Watch_15_Shesternia_04;                                  // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        SM_Watch_15_Shesternia_03;                                  // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        SM_Watch_15_Shesternia_02;                                  // 0x0328   (0x0008)  
	class UStaticMeshComponent*                        SM_Watch_15_Shesternia_01;                                  // 0x0330   (0x0008)  
	class UStaticMeshComponent*                        SM_Watch_15_Bezel;                                          // 0x0338   (0x0008)  
	class UStaticMeshComponent*                        SM_Watch_15_Background;                                     // 0x0340   (0x0008)  
	class UStaticMeshComponent*                        Sec;                                                        // 0x0348   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0350   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0358   (0x0008)  
	float                                              Delta_Seconds;                                              // 0x0360   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_15/BP_Item_Gear_Watch.BP_Item_Gear_Watch_15_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_15/BP_Item_Gear_Watch.BP_Item_Gear_Watch_15_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_15/BP_Item_Gear_Watch.BP_Item_Gear_Watch_15_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_15/BP_Item_Gear_Watch.BP_Item_Gear_Watch_15_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_15/BP_Item_Gear_Watch.BP_Item_Gear_Watch_15_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_14/BP_Item_Gear_Watch.BP_Item_Gear_Watch_14_C
/// Size: 0x0328 (808 bytes) (0x000310 - 0x000328) align 8 MaxSize: 0x0328
class ABP_Item_Gear_Watch_14_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0320   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_14/BP_Item_Gear_Watch.BP_Item_Gear_Watch_14_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_14/BP_Item_Gear_Watch.BP_Item_Gear_Watch_14_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_14/BP_Item_Gear_Watch.BP_Item_Gear_Watch_14_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_14/BP_Item_Gear_Watch.BP_Item_Gear_Watch_14_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_13/BP_Item_Gear_Watch.BP_Item_Gear_Watch_13_C
/// Size: 0x0328 (808 bytes) (0x000310 - 0x000328) align 8 MaxSize: 0x0328
class ABP_Item_Gear_Watch_13_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0320   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_13/BP_Item_Gear_Watch.BP_Item_Gear_Watch_13_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_13/BP_Item_Gear_Watch.BP_Item_Gear_Watch_13_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_13/BP_Item_Gear_Watch.BP_Item_Gear_Watch_13_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_13/BP_Item_Gear_Watch.BP_Item_Gear_Watch_13_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_12/BP_Item_Gear_Watch.BP_Item_Gear_Watch_12_C
/// Size: 0x0320 (800 bytes) (0x000310 - 0x000320) align 8 MaxSize: 0x0320
class ABP_Item_Gear_Watch_12_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UWidgetComponent*                            Widget_Functional;                                          // 0x0318   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_12/BP_Item_Gear_Watch.BP_Item_Gear_Watch_12_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_12/BP_Item_Gear_Watch.BP_Item_Gear_Watch_12_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_12/BP_Item_Gear_Watch.BP_Item_Gear_Watch_12_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_11/BP_Item_Gear_Watch.BP_Item_Gear_Watch_11_C
/// Size: 0x0324 (804 bytes) (0x000310 - 0x000324) align 8 MaxSize: 0x0324
class ABP_Item_Gear_Watch_11_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        SM_Watch_11_Arrow;                                          // 0x0318   (0x0008)  
	float                                              Delta_Seconds;                                              // 0x0320   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_11/BP_Item_Gear_Watch.BP_Item_Gear_Watch_11_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_11/BP_Item_Gear_Watch.BP_Item_Gear_Watch_11_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_11/BP_Item_Gear_Watch.BP_Item_Gear_Watch_11_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_11/BP_Item_Gear_Watch.BP_Item_Gear_Watch_11_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_10/BP_Item_Gear_Watch.BP_Item_Gear_Watch_10_C
/// Size: 0x0318 (792 bytes) (0x000310 - 0x000318) align 8 MaxSize: 0x0318
class ABP_Item_Gear_Watch_10_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_10/BP_Item_Gear_Watch.BP_Item_Gear_Watch_10_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_10/BP_Item_Gear_Watch.BP_Item_Gear_Watch_10_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_10/BP_Item_Gear_Watch.BP_Item_Gear_Watch_10_C.ExecuteUbergraph_BP_Item_Gear_Watch
	// void ExecuteUbergraph_BP_Item_Gear_Watch(int32_t EntryPoint);                                                            // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_09/BP_Item_Gear_Watch_09.BP_Item_Gear_Watch_09_C
/// Size: 0x0330 (816 bytes) (0x000310 - 0x000330) align 8 MaxSize: 0x0330
class ABP_Item_Gear_Watch_09_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Second;                                                     // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0328   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_09/BP_Item_Gear_Watch_09.BP_Item_Gear_Watch_09_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_09/BP_Item_Gear_Watch_09.BP_Item_Gear_Watch_09_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_09/BP_Item_Gear_Watch_09.BP_Item_Gear_Watch_09_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_09/BP_Item_Gear_Watch_09.BP_Item_Gear_Watch_09_C.ExecuteUbergraph_BP_Item_Gear_Watch_09
	// void ExecuteUbergraph_BP_Item_Gear_Watch_09(int32_t EntryPoint);                                                         // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_08/BP_Item_Gear_Watch_08.BP_Item_Gear_Watch_08_C
/// Size: 0x0328 (808 bytes) (0x000310 - 0x000328) align 8 MaxSize: 0x0328
class ABP_Item_Gear_Watch_08_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0320   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_08/BP_Item_Gear_Watch_08.BP_Item_Gear_Watch_08_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_08/BP_Item_Gear_Watch_08.BP_Item_Gear_Watch_08_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_08/BP_Item_Gear_Watch_08.BP_Item_Gear_Watch_08_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_08/BP_Item_Gear_Watch_08.BP_Item_Gear_Watch_08_C.ExecuteUbergraph_BP_Item_Gear_Watch_08
	// void ExecuteUbergraph_BP_Item_Gear_Watch_08(int32_t EntryPoint);                                                         // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_07/BP_Item_Gear_Watch_07.BP_Item_Gear_Watch_07_C
/// Size: 0x0330 (816 bytes) (0x000310 - 0x000330) align 8 MaxSize: 0x0330
class ABP_Item_Gear_Watch_07_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Second;                                                     // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0328   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_07/BP_Item_Gear_Watch_07.BP_Item_Gear_Watch_07_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_07/BP_Item_Gear_Watch_07.BP_Item_Gear_Watch_07_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_07/BP_Item_Gear_Watch_07.BP_Item_Gear_Watch_07_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_07/BP_Item_Gear_Watch_07.BP_Item_Gear_Watch_07_C.ExecuteUbergraph_BP_Item_Gear_Watch_07
	// void ExecuteUbergraph_BP_Item_Gear_Watch_07(int32_t EntryPoint);                                                         // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_06/BP_Item_Gear_Watch_06.BP_Item_Gear_Watch_06_C
/// Size: 0x0330 (816 bytes) (0x000310 - 0x000330) align 8 MaxSize: 0x0330
class ABP_Item_Gear_Watch_06_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Second;                                                     // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0328   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_06/BP_Item_Gear_Watch_06.BP_Item_Gear_Watch_06_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_06/BP_Item_Gear_Watch_06.BP_Item_Gear_Watch_06_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_06/BP_Item_Gear_Watch_06.BP_Item_Gear_Watch_06_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_06/BP_Item_Gear_Watch_06.BP_Item_Gear_Watch_06_C.ExecuteUbergraph_BP_Item_Gear_Watch_06
	// void ExecuteUbergraph_BP_Item_Gear_Watch_06(int32_t EntryPoint);                                                         // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_05/BP_Item_Gear_Watch_05.BP_Item_Gear_Watch_05_C
/// Size: 0x0330 (816 bytes) (0x000310 - 0x000330) align 8 MaxSize: 0x0330
class ABP_Item_Gear_Watch_05_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        Second;                                                     // 0x0328   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_05/BP_Item_Gear_Watch_05.BP_Item_Gear_Watch_05_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_05/BP_Item_Gear_Watch_05.BP_Item_Gear_Watch_05_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_05/BP_Item_Gear_Watch_05.BP_Item_Gear_Watch_05_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_05/BP_Item_Gear_Watch_05.BP_Item_Gear_Watch_05_C.ExecuteUbergraph_BP_Item_Gear_Watch_05
	// void ExecuteUbergraph_BP_Item_Gear_Watch_05(int32_t EntryPoint);                                                         // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_04/BP_Item_Gear_Watch_04.BP_Item_Gear_Watch_04_C
/// Size: 0x0320 (800 bytes) (0x000310 - 0x000320) align 8 MaxSize: 0x0320
class ABP_Item_Gear_Watch_04_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Bezel;                                                      // 0x0318   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_04/BP_Item_Gear_Watch_04.BP_Item_Gear_Watch_04_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_04/BP_Item_Gear_Watch_04.BP_Item_Gear_Watch_04_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_04/BP_Item_Gear_Watch_04.BP_Item_Gear_Watch_04_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_04/BP_Item_Gear_Watch_04.BP_Item_Gear_Watch_04_C.ExecuteUbergraph_BP_Item_Gear_Watch_04
	// void ExecuteUbergraph_BP_Item_Gear_Watch_04(int32_t EntryPoint);                                                         // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_03/BP_Item_Gear_Watch_03.BP_Item_Gear_Watch_03_C
/// Size: 0x0330 (816 bytes) (0x000310 - 0x000330) align 8 MaxSize: 0x0330
class ABP_Item_Gear_Watch_03_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Second;                                                     // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0328   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_03/BP_Item_Gear_Watch_03.BP_Item_Gear_Watch_03_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_03/BP_Item_Gear_Watch_03.BP_Item_Gear_Watch_03_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_03/BP_Item_Gear_Watch_03.BP_Item_Gear_Watch_03_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_03/BP_Item_Gear_Watch_03.BP_Item_Gear_Watch_03_C.ExecuteUbergraph_BP_Item_Gear_Watch_03
	// void ExecuteUbergraph_BP_Item_Gear_Watch_03(int32_t EntryPoint);                                                         // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_02/BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C
/// Size: 0x0340 (832 bytes) (0x000310 - 0x000340) align 8 MaxSize: 0x0340
class ABP_Item_Gear_Watch_02_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UWidgetComponent*                            Widget_Functional;                                          // 0x0318   (0x0008)  
	int32_t                                            KillsCounter;                                               // 0x0320   (0x0004)  
	int32_t                                            SavedKills;                                                 // 0x0324   (0x0004)  
	class UUI_Item_Gear_Watch_02_Display_C*            DisplayWidget;                                              // 0x0328   (0x0008)  
	class UPlayFabJsonObject*                          AsInventoryItem;                                            // 0x0330   (0x0008)  
	class UPlayFabJsonObject*                          NewVar;                                                     // 0x0338   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_02/BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.OnPlayFabResponse_D4021632417204A9C90586BD0E48DBCA
	// void OnPlayFabResponse_D4021632417204A9C90586BD0E48DBCA(FPlayFabBaseModel Response, class UObject* customData, bool Successful); // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_02/BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_02/BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.EnableFunctional
	// void EnableFunctional();                                                                                                 // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_02/BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.SaveKillsProgress
	// void SaveKillsProgress();                                                                                                // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_02/BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.OnAddedGameScore_Event
	// void OnAddedGameScore_Event(TArray<FScoreInfoBlueprint>& ScoreInfos);                                                    // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_02/BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.SaveWatchProgress_Success
	// void SaveWatchProgress_Success(FClientExecuteCloudScriptResult Result, class UObject* customData);                       // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_02/BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.SaveWatchProgress_Failure
	// void SaveWatchProgress_Failure(FPlayFabError Error, class UObject* customData);                                          // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_02/BP_Item_Gear_Watch_02.BP_Item_Gear_Watch_02_C.ExecuteUbergraph_BP_Item_Gear_Watch_02
	// void ExecuteUbergraph_BP_Item_Gear_Watch_02(int32_t EntryPoint);                                                         // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_01/BP_Item_Gear_Watch_01.BP_Item_Gear_Watch_01_C
/// Size: 0x0330 (816 bytes) (0x000310 - 0x000330) align 8 MaxSize: 0x0330
class ABP_Item_Gear_Watch_01_C : public AItem_Watch_General
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Second;                                                     // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Minute;                                                     // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        Hour;                                                       // 0x0328   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_01/BP_Item_Gear_Watch_01.BP_Item_Gear_Watch_01_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_01/BP_Item_Gear_Watch_01.BP_Item_Gear_Watch_01_C.Watch
	// void Watch();                                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_01/BP_Item_Gear_Watch_01.BP_Item_Gear_Watch_01_C.ExecuteUbergraph_BP_Item_Gear_Watch_01
	// void ExecuteUbergraph_BP_Item_Gear_Watch_01(int32_t EntryPoint);                                                         // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_02/Assets/UI_Item_Gear_Watch_02_Display.UI_Item_Gear_Watch_02_Display_C
/// Size: 0x0290 (656 bytes) (0x000280 - 0x000290) align 8 MaxSize: 0x0290
class UUI_Item_Gear_Watch_02_Display_C : public UUserWidget
{ 
public:
	class UTextBlock*                                  TextBlock_Kills;                                            // 0x0280   (0x0008)  
	class UTextBlock*                                  TextBlock_LimitNumber;                                      // 0x0288   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Gear/Watch/Watch_12/UI_Item_Gear_Watch_12_Display.UI_Item_Gear_Watch_12_Display_C
/// Size: 0x02A0 (672 bytes) (0x000280 - 0x0002A0) align 8 MaxSize: 0x02A0
class UUI_Item_Gear_Watch_12_Display_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	class UTextBlock*                                  TextBlock_Time_Hour;                                        // 0x0288   (0x0008)  
	class UTextBlock*                                  TextBlock_Time_Mins;                                        // 0x0290   (0x0008)  
	class UTextBlock*                                  TextBlock_Time_Secs;                                        // 0x0298   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_12/UI_Item_Gear_Watch_12_Display.UI_Item_Gear_Watch_12_Display_C.Construct
	// void Construct();                                                                                                        // [0x2c97800] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_12/UI_Item_Gear_Watch_12_Display.UI_Item_Gear_Watch_12_Display_C.time
	// void time();                                                                                                             // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Gear/Watch/Watch_12/UI_Item_Gear_Watch_12_Display.UI_Item_Gear_Watch_12_Display_C.ExecuteUbergraph_UI_Item_Gear_Watch_12_Display
	// void ExecuteUbergraph_UI_Item_Gear_Watch_12_Display(int32_t EntryPoint);                                                 // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/GameInstance/BP_PG_GameInstance.BP_PG_GameInstance_C
/// Size: 0x01D8 (472 bytes) (0x0001D0 - 0x0001D8) align 8 MaxSize: 0x01D8
class UBP_PG_GameInstance_C : public UPG_GameInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x01D0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/GameInstance/BP_PG_GameInstance.BP_PG_GameInstance_C.ReceiveInit
	// void ReceiveInit();                                                                                                      // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/General/GameInstance/BP_PG_GameInstance.BP_PG_GameInstance_C.ExecuteUbergraph_BP_PG_GameInstance
	// void ExecuteUbergraph_BP_PG_GameInstance(int32_t EntryPoint);                                                            // [0x2c97800] Final                
};

/// Class /Game/Blueprints/Game/BP_PG_GameState_Game.BP_PG_GameState_Game_C
/// Size: 0x0508 (1288 bytes) (0x000500 - 0x000508) align 8 MaxSize: 0x0508
class ABP_PG_GameState_Game_C : public APG_GameState_Game
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0500   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/BP_Item_Strap_DefaultStrap.BP_Item_Strap_DefaultStrap_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Item_Strap_DefaultStrap_C : public AItem_Module_Strap
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/BP_Item_Skin_DefaultSkin.BP_Item_Skin_DefaultSkin_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_DefaultSkin_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Social/BP_UserEntry.BP_UserEntry_C
/// Size: 0x0090 (144 bytes) (0x000028 - 0x000090) align 8 MaxSize: 0x0090
class UBP_UserEntry_C : public UUserEntry
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  
	FUniqueNetIdRepl                                   UserId;                                                     // 0x0030   (0x0030)  
	SDK_UNDEFINED(16,1089) /* FMulticastInlineDelegate */ __um(OnGetAvatar);                                       // 0x0060   (0x0010)  
	class UTexture*                                    UserAvatar;                                                 // 0x0070   (0x0008)  
	FOnlineUserPresenceStatusState                     OnlineStatus;                                               // 0x0078   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0079   (0x0007)  MISSED
	SDK_UNDEFINED(16,1090) /* FMulticastInlineDelegate */ __um(OnPresenceUpdated);                                 // 0x0080   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/General/Social/BP_UserEntry.BP_UserEntry_C.OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0
	// void OnGetAvatarComplete_824A0C6B4C2DBA1D157208B3CDEF0AE0(bool bWasSuccessful, class UTexture* ResultTexture);           // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Social/BP_UserEntry.BP_UserEntry_C.OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0
	// void OnCallFailed_824A0C6B4C2DBA1D157208B3CDEF0AE0(bool bWasSuccessful, class UTexture* ResultTexture);                  // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Social/BP_UserEntry.BP_UserEntry_C.ParseUserInfo
	// void ParseUserInfo(FUniqueNetIdRepl UserId);                                                                             // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Social/BP_UserEntry.BP_UserEntry_C.OnPresenceReceived_Event
	// void OnPresenceReceived_Event(FUniqueNetIdRepl UserId, FOnlineUserPresenceData Presence);                                // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Social/BP_UserEntry.BP_UserEntry_C.ExecuteUbergraph_BP_UserEntry
	// void ExecuteUbergraph_BP_UserEntry(int32_t EntryPoint);                                                                  // [0x2c97800] Final|HasDefaults    
	// Function /Game/Blueprints/General/Social/BP_UserEntry.BP_UserEntry_C.OnPresenceUpdated__DelegateSignature
	// void OnPresenceUpdated__DelegateSignature();                                                                             // [0x2c97800] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Social/BP_UserEntry.BP_UserEntry_C.OnGetAvatar__DelegateSignature
	// void OnGetAvatar__DelegateSignature();                                                                                   // [0x2c97800] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Optic/RedDot/BP_Item_Optic_CollimatorSight_01.BP_Item_Optic_CollimatorSight_01_C
/// Size: 0x0398 (920 bytes) (0x000390 - 0x000398) align 8 MaxSize: 0x0398
class ABP_Item_Optic_CollimatorSight_01_C : public AItem_Module_Optic
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0390   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Optic/RedDot/BP_Item_Optic_CollimatorSight_01.BP_Item_Optic_CollimatorSight_01_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Optic/RedDot/BP_Item_Optic_CollimatorSight_01.BP_Item_Optic_CollimatorSight_01_C.ExecuteUbergraph_BP_Item_Optic_CollimatorSight_01
	// void ExecuteUbergraph_BP_Item_Optic_CollimatorSight_01(int32_t EntryPoint);                                              // [0x2c97800] Final                
};

/// Class /Game/Blueprints/Menu/Task/Task_Menu_CameraSetFOV.Task_Menu_CameraSetFOV_C
/// Size: 0x00C8 (200 bytes) (0x0000A8 - 0x0000C8) align 8 MaxSize: 0x00C8
class UTask_Menu_CameraSetFOV_C : public UAction
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	class UCameraComponent*                            Camera_Component;                                           // 0x00B0   (0x0008)  
	double                                             TargetFOV;                                                  // 0x00B8   (0x0008)  
	double                                             InterpSpeed;                                                // 0x00C0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Menu/Task/Task_Menu_CameraSetFOV.Task_Menu_CameraSetFOV_C.ReceiveActivate
	// void ReceiveActivate();                                                                                                  // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Task/Task_Menu_CameraSetFOV.Task_Menu_CameraSetFOV_C.ReceiveTick
	// void ReceiveTick(float DeltaTime);                                                                                       // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Task/Task_Menu_CameraSetFOV.Task_Menu_CameraSetFOV_C.ExecuteUbergraph_Task_Menu_CameraSetFOV
	// void ExecuteUbergraph_Task_Menu_CameraSetFOV(int32_t EntryPoint);                                                        // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Task/Task_General_CameraTransition.Task_General_CameraTransition_C
/// Size: 0x00D0 (208 bytes) (0x0000A8 - 0x0000D0) align 8 MaxSize: 0x00D0
class UTask_General_CameraTransition_C : public UAction
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	class UUI_CameraTransitions_DarkenScreen_C*        CreatedCameraTransitionWidget;                              // 0x00B0   (0x0008)  
	int32_t                                            ZOrder;                                                     // 0x00B8   (0x0004)  
	FName                                              SwitchCameraTag;                                            // 0x00BC   (0x0008)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00C4   (0x0004)  MISSED
	double                                             SwitchCameraBlendTime;                                      // 0x00C8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Task/Task_General_CameraTransition.Task_General_CameraTransition_C.ReceiveActivate
	// void ReceiveActivate();                                                                                                  // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Task/Task_General_CameraTransition.Task_General_CameraTransition_C.SwitchCamera_Event
	// void SwitchCamera_Event();                                                                                               // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Task/Task_General_CameraTransition.Task_General_CameraTransition_C.ExecuteUbergraph_Task_General_CameraTransition
	// void ExecuteUbergraph_Task_General_CameraTransition(int32_t EntryPoint);                                                 // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Game/GameTools/Support/BP_SupportBox_Ammo.BP_SupportBox_Ammo_C
/// Size: 0x02C0 (704 bytes) (0x0002C0 - 0x0002C0) align 8 MaxSize: 0x02C0
class ABP_SupportBox_Ammo_C : public ASupportBox_Ammo
{ 
public:
};

/// Class /Game/Blueprints/Game/Player/PlayerController/Task/AimingInterpolation/Task_FOVManagerComponent_AimingInterpolation.Task_FOVManagerComponent_AimingInterpolation_C
/// Size: 0x0100 (256 bytes) (0x0000A8 - 0x000100) align 8 MaxSize: 0x0100
class UTask_FOVManagerComponent_AimingInterpolation_C : public UAction
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	class UWeaponComponent*                            WeaponComponent;                                            // 0x00B0   (0x0008)  
	float                                              Delta_Time;                                                 // 0x00B8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00BC   (0x0004)  MISSED
	class AItem_Module_Optic*                          Optic;                                                      // 0x00C0   (0x0008)  
	float                                              StartCameraFOV;                                             // 0x00C8   (0x0004)  
	float                                              StartMeshFOV;                                               // 0x00CC   (0x0004)  
	double                                             EndCameraFOV;                                               // 0x00D0   (0x0008)  
	double                                             EndMeshFOV;                                                 // 0x00D8   (0x0008)  
	class UBP_FOVManagerComponent_Game_C*              FOVManagerComponent;                                        // 0x00E0   (0x0008)  
	bool                                               InitialAimingState;                                         // 0x00E8   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x00E9   (0x0007)  MISSED
	class UCurveFloat*                                 CurveFOV;                                                   // 0x00F0   (0x0008)  
	float                                              CurveAlpha;                                                 // 0x00F8   (0x0004)  
	float                                              Aim_Down_Time_Multiplier;                                   // 0x00FC   (0x0004)  


	/// Functions
	// Function /Game/Blueprints/Game/Player/PlayerController/Task/AimingInterpolation/Task_FOVManagerComponent_AimingInterpolation.Task_FOVManagerComponent_AimingInterpolation_C.ReceiveActivate
	// void ReceiveActivate();                                                                                                  // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/Task/AimingInterpolation/Task_FOVManagerComponent_AimingInterpolation.Task_FOVManagerComponent_AimingInterpolation_C.ReceiveTick
	// void ReceiveTick(float DeltaTime);                                                                                       // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/Task/AimingInterpolation/Task_FOVManagerComponent_AimingInterpolation.Task_FOVManagerComponent_AimingInterpolation_C.ExecuteUbergraph_Task_FOVManagerComponent_AimingInterpolation
	// void ExecuteUbergraph_Task_FOVManagerComponent_AimingInterpolation(int32_t EntryPoint);                                  // [0x2c97800] Final                
};

/// Class /Game/Blueprints/Game/Player/CameraShake/FootStep/CameraShake_Jump_End.CameraShake_Jump_End_C
/// Size: 0x0210 (528 bytes) (0x000210 - 0x000210) align 16 MaxSize: 0x0210
class UCameraShake_Jump_End_C : public ULegacyCameraShake
{ 
public:
};

/// Class /Game/Blueprints/Game/Player/CameraShake/FootStep/CameraShake_FootStep.CameraShake_FootStep_C
/// Size: 0x0210 (528 bytes) (0x000210 - 0x000210) align 16 MaxSize: 0x0210
class UCameraShake_FootStep_C : public ULegacyCameraShake
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Accessory/Flashlight/BP_Item_Accessory_Flashlight_01.BP_Item_Accessory_Flashlight_01_C
/// Size: 0x0388 (904 bytes) (0x000370 - 0x000388) align 8 MaxSize: 0x0388
class ABP_Item_Accessory_Flashlight_01_C : public AItem_Module_Flashlight
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	class UParticleSystemComponent*                    ParticleSystem;                                             // 0x0378   (0x0008)  
	class USpotLightComponent*                         SpotLight;                                                  // 0x0380   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Accessory/Flashlight/BP_Item_Accessory_Flashlight_01.BP_Item_Accessory_Flashlight_01_C.InpActEvt_Flashlight_K2Node_InputActionEvent
	// void InpActEvt_Flashlight_K2Node_InputActionEvent(FKey Key);                                                             // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Accessory/Flashlight/BP_Item_Accessory_Flashlight_01.BP_Item_Accessory_Flashlight_01_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Accessory/Flashlight/BP_Item_Accessory_Flashlight_01.BP_Item_Accessory_Flashlight_01_C.OnChangeEnableState
	// void OnChangeEnableState(bool bPlaySound);                                                                               // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Accessory/Flashlight/BP_Item_Accessory_Flashlight_01.BP_Item_Accessory_Flashlight_01_C.ExecuteUbergraph_BP_Item_Accessory_Flashlight_01
	// void ExecuteUbergraph_BP_Item_Accessory_Flashlight_01(int32_t EntryPoint);                                               // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Game/Player/Character/Task/Task_Character_SetupByTeam.Task_Character_SetupByTeam_C
/// Size: 0x00F0 (240 bytes) (0x0000A8 - 0x0000F0) align 8 MaxSize: 0x00F0
class UTask_Character_SetupByTeam_C : public UAction
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	class ABP_PG_Game_Character_C*                     Character;                                                  // 0x00B0   (0x0008)  
	class ABP_PG_PlayerState_Game_C*                   CharacterPlayerState;                                       // 0x00B8   (0x0008)  
	class ABP_PG_PlayerState_Game_C*                   LocalPlayerState;                                           // 0x00C0   (0x0008)  
	bool                                               IsFriendly;                                                 // 0x00C8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00C9   (0x0007)  MISSED
	FTimerHandle                                       Timer_VisibleMarkerByDistance;                              // 0x00D0   (0x0008)  
	FVector                                            CharacterDefaultWorldScale;                                 // 0x00D8   (0x0018)  


	/// Functions
	// Function /Game/Blueprints/Game/Player/Character/Task/Task_Character_SetupByTeam.Task_Character_SetupByTeam_C.SetMaterialsByTeam
	// void SetMaterialsByTeam();                                                                                               // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Task/Task_Character_SetupByTeam.Task_Character_SetupByTeam_C.ReceiveActivate
	// void ReceiveActivate();                                                                                                  // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Task/Task_Character_SetupByTeam.Task_Character_SetupByTeam_C.OnSetTeam_Event
	// void OnSetTeam_Event();                                                                                                  // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Task/Task_Character_SetupByTeam.Task_Character_SetupByTeam_C.OnSetPlayerState_Event
	// void OnSetPlayerState_Event();                                                                                           // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Task/Task_Character_SetupByTeam.Task_Character_SetupByTeam_C.OnSetPlayerStateLocal_Event
	// void OnSetPlayerStateLocal_Event();                                                                                      // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Task/Task_Character_SetupByTeam.Task_Character_SetupByTeam_C.OnIsMemberMySquad_Event
	// void OnIsMemberMySquad_Event();                                                                                          // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Task/Task_Character_SetupByTeam.Task_Character_SetupByTeam_C.ScaleCharacterByDistance
	// void ScaleCharacterByDistance();                                                                                         // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Task/Task_Character_SetupByTeam.Task_Character_SetupByTeam_C.ExecuteUbergraph_Task_Character_SetupByTeam
	// void ExecuteUbergraph_Task_Character_SetupByTeam(int32_t EntryPoint);                                                    // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Game/Player/CameraShake/CameraShake_Damage.CameraShake_Damage_C
/// Size: 0x0210 (528 bytes) (0x000210 - 0x000210) align 16 MaxSize: 0x0210
class UCameraShake_Damage_C : public ULegacyCameraShake
{ 
public:
};

/// Class /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C
/// Size: 0x6CD0 (27856 bytes) (0x000348 - 0x006CD0) align 16 MaxSize: 0x6CD0
class UABP_CharacterPG_TP_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0348   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	unsigned char                                      __AnimBlueprintMutables_unkBecDupClass_FAnimBlueprintGeneratedMutableData[64]; // 0x0358   (0x0040)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0398   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x03A0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x03A8   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x03C8   (0x0108)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose0;                              // 0x04D0   (0x0108)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x05D8   (0x00E0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x06B8   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose1;                               // 0x06E0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose2;                               // 0x0708   (0x0028)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend3;                            // 0x0730   (0x00E0)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose4;                               // 0x0810   (0x0028)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose;                              // 0x0838   (0x00C8)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose5;                             // 0x0900   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose6;                              // 0x09C8   (0x0108)  
	FAnimNode_LinkedAnimLayer                          AnimGraphNode_LinkedAnimLayer;                              // 0x0AD0   (0x00C8)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0B98   (0x0128)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0CC0   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0CE0   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone7;                                  // 0x0D00   (0x0128)  
	FAnimNode_Root                                     AnimGraphNode_Root8;                                        // 0x0E28   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0E48   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult9;                            // 0x0E70   (0x0028)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive;                                // 0x0E98   (0x00C8)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose10;                              // 0x0F60   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x0F88   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0FD0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0FF0   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult11;                                // 0x10B8   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult12;                           // 0x10D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult13;                           // 0x1100   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult14;                           // 0x1128   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult15;                           // 0x1150   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose16;                              // 0x1178   (0x0028)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive17;                              // 0x11A0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x1268   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer18;                             // 0x1330   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult19;                                // 0x1378   (0x0020)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose20;                              // 0x1398   (0x0028)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive21;                              // 0x13C0   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer22;                             // 0x1488   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult23;                                // 0x14D0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine24;                               // 0x14F0   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult25;                                // 0x15B8   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult26;                           // 0x15D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult27;                           // 0x1600   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult28;                           // 0x1628   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult29;                           // 0x1650   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult30;                           // 0x1678   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult31;                           // 0x16A0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer32;                             // 0x16C8   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive33;                              // 0x1710   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive34;                              // 0x17D8   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer35;                             // 0x18A0   (0x0048)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose36;                              // 0x18E8   (0x0028)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone37;                                 // 0x1910   (0x0128)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace38;                      // 0x1A38   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace39;                      // 0x1A58   (0x0020)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult40;                                // 0x1A78   (0x0020)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose41;                              // 0x1A98   (0x0028)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive42;                              // 0x1AC0   (0x00C8)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend43;                                // 0x1B88   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer44;                             // 0x1C50   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult45;                                // 0x1C98   (0x0020)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose46;                              // 0x1CB8   (0x0028)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive47;                              // 0x1CE0   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer48;                             // 0x1DA8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult49;                                // 0x1DF0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine50;                               // 0x1E10   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult51;                                // 0x1ED8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine52;                               // 0x1EF8   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult53;                                // 0x1FC0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine54;                               // 0x1FE0   (0x00C8)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone55;                                 // 0x20A8   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone56;                                 // 0x21D0   (0x0128)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace57;                      // 0x22F8   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace58;                      // 0x2318   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult59;                           // 0x2338   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult60;                           // 0x2360   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose61;                              // 0x2388   (0x0028)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive62;                              // 0x23B0   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer63;                             // 0x2478   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult64;                                // 0x24C0   (0x0020)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose65;                              // 0x24E0   (0x0028)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive66;                              // 0x2508   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer67;                             // 0x25D0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult68;                                // 0x2618   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine69;                               // 0x2638   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult70;                                // 0x2700   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine71;                               // 0x2720   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x27E8   (0x0048)  
	FAnimNode_Slot                                     AnimGraphNode_Slot;                                         // 0x2830   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive72;                              // 0x2878   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult73;                           // 0x2940   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult74;                           // 0x2968   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult75;                           // 0x2990   (0x0028)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult76;                                // 0x29B8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer77;                             // 0x29D8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult78;                                // 0x2A20   (0x0020)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult79;                                // 0x2A40   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine80;                               // 0x2A60   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive81;                              // 0x2B28   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive82;                              // 0x2BF0   (0x00C8)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose;                                 // 0x2CB8   (0x0010)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult83;                           // 0x2CC8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult84;                           // 0x2CF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult85;                           // 0x2D18   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer86;                             // 0x2D40   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult87;                                // 0x2D88   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer88;                             // 0x2DA8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult89;                                // 0x2DF0   (0x0020)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult90;                                // 0x2E10   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine91;                               // 0x2E30   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult92;                                // 0x2EF8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine93;                               // 0x2F18   (0x00C8)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose94;                               // 0x2FE0   (0x0010)  
	FAnimNode_LinkedInputPose                          AnimGraphNode_LinkedInputPose95;                            // 0x2FF0   (0x00C8)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose96;                             // 0x30B8   (0x0108)  
	FAnimNode_TwoBoneIK                                AnimGraphNode_TwoBoneIK;                                    // 0x31C0   (0x0280)  
	FAnimNode_Fabrik                                   AnimGraphNode_Fabrik;                                       // 0x3440   (0x01F0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace97;                      // 0x3630   (0x0020)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone;                                     // 0x3650   (0x00F0)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone98;                                 // 0x3740   (0x0128)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace99;                      // 0x3868   (0x0020)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend100;                               // 0x3888   (0x00C8)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace101;                     // 0x3950   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone102;                                // 0x3970   (0x0128)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone103;                                  // 0x3A98   (0x00F0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace104;                     // 0x3B88   (0x0020)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x3BA8   (0x0040)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend105;                          // 0x3BE8   (0x00E0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose106;                            // 0x3CC8   (0x0108)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool107;                           // 0x3DD0   (0x0048)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose108;                            // 0x3E18   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose109;                             // 0x3F20   (0x0028)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace110;                     // 0x3F48   (0x0020)  
	FAnimNode_Slot                                     AnimGraphNode_Slot111;                                      // 0x3F68   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive112;                             // 0x3FB0   (0x00C8)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone113;                                // 0x4078   (0x0128)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool114;                           // 0x41A0   (0x0048)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace115;                     // 0x41E8   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace116;                     // 0x4208   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose117;                            // 0x4228   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone118;                                // 0x4330   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone119;                                // 0x4458   (0x0128)  
	FAnimNode_Fabrik                                   AnimGraphNode_Fabrik120;                                    // 0x4580   (0x01F0)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose121;                            // 0x4770   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose122;                             // 0x4878   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose123;                             // 0x48A0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose124;                             // 0x48C8   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose125;                             // 0x48F0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose126;                             // 0x4918   (0x0028)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace127;                     // 0x4940   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace128;                     // 0x4960   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace129;                     // 0x4980   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone130;                                // 0x49A0   (0x0128)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace131;                     // 0x4AC8   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace132;                     // 0x4AE8   (0x0020)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend133;                               // 0x4B08   (0x00C8)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose134;                             // 0x4BD0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose135;                             // 0x4BF8   (0x0028)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone136;                                // 0x4C20   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone137;                                // 0x4D48   (0x0128)  
	FAnimNode_Root                                     AnimGraphNode_Root138;                                      // 0x4E70   (0x0020)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator139;                         // 0x4E90   (0x0040)  
	FAnimNode_Root                                     AnimGraphNode_Root140;                                      // 0x4ED0   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult141;                          // 0x4EF0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult142;                          // 0x4F18   (0x0028)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive143;                             // 0x4F40   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer144;                            // 0x5008   (0x0048)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult145;                          // 0x5050   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult146;                          // 0x5078   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer147;                            // 0x50A0   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult148;                               // 0x50E8   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer149;                            // 0x5108   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult150;                               // 0x5150   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine151;                              // 0x5170   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult152;                               // 0x5238   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult153;                          // 0x5258   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult154;                          // 0x5280   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult155;                          // 0x52A8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult156;                          // 0x52D0   (0x0028)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer;                             // 0x52F8   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult157;                               // 0x5368   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer158;                            // 0x5388   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult159;                               // 0x53D0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine160;                              // 0x53F0   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult161;                               // 0x54B8   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult162;                          // 0x54D8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult163;                          // 0x5500   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult164;                          // 0x5528   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult165;                          // 0x5550   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult166;                          // 0x5578   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult167;                          // 0x55A0   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer168;                            // 0x55C8   (0x0048)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive169;                             // 0x5610   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer170;                            // 0x56D8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult171;                               // 0x5720   (0x0020)  
	FAnimNode_RotateRootBone                           AnimGraphNode_RotateRootBone;                               // 0x5740   (0x00A8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer172;                            // 0x57E8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult173;                               // 0x5830   (0x0020)  
	FAnimNode_BlendSpacePlayer                         AnimGraphNode_BlendSpacePlayer174;                          // 0x5850   (0x0070)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult175;                               // 0x58C0   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine176;                              // 0x58E0   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult177;                               // 0x59A8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine178;                              // 0x59C8   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult179;                               // 0x5A90   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine180;                              // 0x5AB0   (0x00C8)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace;                     // 0x5B78   (0x0118)  
	FAnimNode_RotationOffsetBlendSpace                 AnimGraphNode_RotationOffsetBlendSpace181;                  // 0x5C90   (0x0118)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend182;                          // 0x5DA8   (0x00E0)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive183;                             // 0x5E88   (0x00C8)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult184;                          // 0x5F50   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult185;                          // 0x5F78   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult186;                          // 0x5FA0   (0x0028)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult187;                               // 0x5FC8   (0x0020)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend188;                          // 0x5FE8   (0x00E0)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer189;                            // 0x60C8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult190;                               // 0x6110   (0x0020)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult191;                               // 0x6130   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine192;                              // 0x6150   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive193;                             // 0x6218   (0x00C8)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive194;                             // 0x62E0   (0x00C8)  
	FAnimNode_RefPose                                  AnimGraphNode_IdentityPose195;                              // 0x63A8   (0x0010)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult196;                          // 0x63B8   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult197;                          // 0x63E0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult198;                          // 0x6408   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer199;                            // 0x6430   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult200;                               // 0x6478   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer201;                            // 0x6498   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult202;                               // 0x64E0   (0x0020)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult203;                               // 0x6500   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine204;                              // 0x6520   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult205;                               // 0x65E8   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine206;                              // 0x6608   (0x00C8)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone207;                                // 0x66D0   (0x0128)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace208;                     // 0x67F8   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace209;                     // 0x6818   (0x0020)  
	FAnimNode_Root                                     AnimGraphNode_Root210;                                      // 0x6838   (0x0020)  
	FAnimNode_LinkedAnimLayer                          AnimGraphNode_LinkedAnimLayer211;                           // 0x6858   (0x00C8)  
	FAnimNode_LinkedAnimLayer                          AnimGraphNode_LinkedAnimLayer212;                           // 0x6920   (0x00C8)  
	FAnimNode_LinkedAnimLayer                          AnimGraphNode_LinkedAnimLayer213;                           // 0x69E8   (0x00C8)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool214;                           // 0x6AB0   (0x0048)  
	bool                                               K2Node_PropertyAccess;                                      // 0x6AF8   (0x0001)  
	bool                                               K2Node_PropertyAccess215;                                   // 0x6AF9   (0x0001)  
	bool                                               K2Node_PropertyAccess216;                                   // 0x6AFA   (0x0001)  
	bool                                               K2Node_PropertyAccess217;                                   // 0x6AFB   (0x0001)  
	bool                                               K2Node_PropertyAccess218;                                   // 0x6AFC   (0x0001)  
	bool                                               K2Node_PropertyAccess219;                                   // 0x6AFD   (0x0001)  
	bool                                               K2Node_PropertyAccess220;                                   // 0x6AFE   (0x0001)  
	bool                                               K2Node_PropertyAccess221;                                   // 0x6AFF   (0x0001)  
	bool                                               K2Node_PropertyAccess222;                                   // 0x6B00   (0x0001)  
	bool                                               K2Node_PropertyAccess223;                                   // 0x6B01   (0x0001)  
	bool                                               K2Node_PropertyAccess224;                                   // 0x6B02   (0x0001)  
	bool                                               K2Node_PropertyAccess225;                                   // 0x6B03   (0x0001)  
	bool                                               K2Node_PropertyAccess226;                                   // 0x6B04   (0x0001)  
	bool                                               K2Node_PropertyAccess227;                                   // 0x6B05   (0x0001)  
	bool                                               K2Node_PropertyAccess228;                                   // 0x6B06   (0x0001)  
	bool                                               K2Node_PropertyAccess229;                                   // 0x6B07   (0x0001)  
	bool                                               K2Node_PropertyAccess230;                                   // 0x6B08   (0x0001)  
	bool                                               K2Node_PropertyAccess231;                                   // 0x6B09   (0x0001)  
	bool                                               K2Node_PropertyAccess232;                                   // 0x6B0A   (0x0001)  
	bool                                               K2Node_PropertyAccess233;                                   // 0x6B0B   (0x0001)  
	bool                                               K2Node_PropertyAccess234;                                   // 0x6B0C   (0x0001)  
	bool                                               K2Node_PropertyAccess235;                                   // 0x6B0D   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x6B0E   (0x0002)  MISSED
	FVector                                            K2Node_PropertyAccess236;                                   // 0x6B10   (0x0018)  
	class ABP_PG_Game_Character_C*                     Character;                                                  // 0x6B28   (0x0008)  
	bool                                               Is_Alive;                                                   // 0x6B30   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x6B31   (0x0007)  MISSED
	double                                             MoveSpeed;                                                  // 0x6B38   (0x0008)  
	bool                                               IsSprinting;                                                // 0x6B40   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x6B41   (0x0007)  MISSED
	double                                             MoveDirection;                                              // 0x6B48   (0x0008)  
	double                                             DeltaMoveDirection;                                         // 0x6B50   (0x0008)  
	float                                              Delta_Time;                                                 // 0x6B58   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x6B5C   (0x0004)  MISSED
	class AItem_Gun_General*                           Current_Gun;                                                // 0x6B60   (0x0008)  
	class UClass*                                      CurrentGunClass;                                            // 0x6B68   (0x0008)  
	class UAnimSequence*                               GunIdlePose;                                                // 0x6B70   (0x0008)  
	FVector                                            IK_LeftHandPosition;                                        // 0x6B78   (0x0018)  
	bool                                               IsGripExists;                                               // 0x6B90   (0x0001)  
	unsigned char                                      UnknownData05_6[0x7];                                       // 0x6B91   (0x0007)  MISSED
	class UAnimSequence*                               GripHandPose;                                               // 0x6B98   (0x0008)  
	FRotator                                           IK_LeftHandRotation;                                        // 0x6BA0   (0x0018)  
	double                                             DeltaCharacterYawRotation;                                  // 0x6BB8   (0x0008)  
	double                                             DeltaCharacterPitchRotation;                                // 0x6BC0   (0x0008)  
	double                                             CameraPitch;                                                // 0x6BC8   (0x0008)  
	double                                             CameraPitchAlpha;                                           // 0x6BD0   (0x0008)  
	float                                              LeanBodyAlphaInterp;                                        // 0x6BD8   (0x0004)  
	unsigned char                                      UnknownData06_6[0x4];                                       // 0x6BDC   (0x0004)  MISSED
	FVector                                            GunFinalPosition;                                           // 0x6BE0   (0x0018)  
	FRotator                                           GunFinalRotation;                                           // 0x6BF8   (0x0018)  
	FTransform                                         GunLeftHandOffset;                                          // 0x6C10   (0x0060)  
	FTransform                                         Watch_Offset;                                               // 0x6C70   (0x0060)  


	/// Functions
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.PoseBlending
	// void PoseBlending(FPoseLink BaseLocomotion, FPoseLink BasePose, FPoseLink& PoseBlending);                                // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.GunLocomotion
	// void GunLocomotion(FPoseLink BaseFinal, FPoseLink& GunLocomotion);                                                       // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.BasePose
	// void BasePose(FPoseLink& BasePose);                                                                                      // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.BaseLocomotion
	// void BaseLocomotion(FPoseLink& BaseLocomotion);                                                                          // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.FootStep_Cloth
	// void FootStep_Cloth();                                                                                                   // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.JumpEvent
	// void JumpEvent(bool IsStart);                                                                                            // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.FootStep
	// void FootStep(bool RightLeg);                                                                                            // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.CacheGunModulesValues
	// void CacheGunModulesValues();                                                                                            // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.CacheGunValues
	// void CacheGunValues();                                                                                                   // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.BlueprintThreadSafeUpdateAnimation
	// void BlueprintThreadSafeUpdateAnimation(float DeltaTime);                                                                // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_ModifyBone_43D643EB4EA51B59F357368257E95275
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_ModifyBone_43D643EB4EA51B59F357368257E95275(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TwoWayBlend_42BC74D142A788D453F9258D74D35B24
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TwoWayBlend_42BC74D142A788D453F9258D74D35B24(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_ModifyBone_AF5194F14B459BBE3486C1A5EE9B2DE1
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_ModifyBone_AF5194F14B459BBE3486C1A5EE9B2DE1(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TwoWayBlend_46C0B5C441A8C278DE180B89A4706B45
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TwoWayBlend_46C0B5C441A8C278DE180B89A4706B45(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_D76DCAC34C7D7FCB4FE410924611FD12
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_D76DCAC34C7D7FCB4FE410924611FD12(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_B68687A945911149AEBFB79162217D93
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_B68687A945911149AEBFB79162217D93(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_BlendSpacePlayer_660614834FD877EBE1F528927827D9B8
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_BlendSpacePlayer_660614834FD877EBE1F528927827D9B8(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_RotateRootBone_577BADD041F3190CB304EDBD81363645
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_RotateRootBone_577BADD041F3190CB304EDBD81363645(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_5CFB545C4811EE33D459EC8FD3A1DCFF
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_5CFB545C4811EE33D459EC8FD3A1DCFF(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_E507D0214C824D1B30FAC5A45D4BBB69
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_E507D0214C824D1B30FAC5A45D4BBB69(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_8DEDD458461077210F7F8784BD1991A0
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_8DEDD458461077210F7F8784BD1991A0(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_95B6C2DC4ED044EA58E8F5BEC5D12A0C
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_95B6C2DC4ED044EA58E8F5BEC5D12A0C(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_04559AFC49B012A96003F4B28F36D739
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_04559AFC49B012A96003F4B28F36D739(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_7A7C30B44DE26DAC0C960BA838F309ED
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_7A7C30B44DE26DAC0C960BA838F309ED(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_BlendSpacePlayer_928510BB465567BA6B06F6B1EB931D2F
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_BlendSpacePlayer_928510BB465567BA6B06F6B1EB931D2F(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_7E5B02D44F100F8657D7AB83FE9BDE27
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_7E5B02D44F100F8657D7AB83FE9BDE27(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_978FD34846FB8719D2D5E9A4027EBC02
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_978FD34846FB8719D2D5E9A4027EBC02(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_4750ADCE4F39CA2AAE4FF6A2AD926E44
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_4750ADCE4F39CA2AAE4FF6A2AD926E44(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_B0902DA846E30D5DB481828B1107C622
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_B0902DA846E30D5DB481828B1107C622(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_D9BC40D4481FFE41C114F58AA6A12E14
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_D9BC40D4481FFE41C114F58AA6A12E14(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_1200CEAC4A2D051B4FCF63BBC323C9C3
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_1200CEAC4A2D051B4FCF63BBC323C9C3(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_E498C9A946ADEF7F0300C0844F910EB9
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_E498C9A946ADEF7F0300C0844F910EB9(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_459D436643F69441728C83834AA2CC23
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_459D436643F69441728C83834AA2CC23(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_81D8EB054C0094C20A119C9C9D5B4D5B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_81D8EB054C0094C20A119C9C9D5B4D5B(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_779CD1054AAC02AC1802ECB65FCCD2C8
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_779CD1054AAC02AC1802ECB65FCCD2C8(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_066010224D0EA53871085CBFE5AE4C21
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_066010224D0EA53871085CBFE5AE4C21(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_C403185D4218CCA92C031DB5AD8BD24B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_C403185D4218CCA92C031DB5AD8BD24B(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_8718D59E472DA8C0FA17698307F7F6D3
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_TP_AnimGraphNode_TransitionResult_8718D59E472DA8C0FA17698307F7F6D3(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.AnimNotify_FootStep_L
	// void AnimNotify_FootStep_L();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.AnimNotify_FootStep_R
	// void AnimNotify_FootStep_R();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.AnimNotify_Jump_End
	// void AnimNotify_Jump_End();                                                                                              // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.AnimNotify_Jump_Start
	// void AnimNotify_Jump_Start();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.AnimNotify_FootStep_Cloth
	// void AnimNotify_FootStep_Cloth();                                                                                        // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.BlueprintInitializeAnimation
	// void BlueprintInitializeAnimation();                                                                                     // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.OnSetPlayerState_Event
	// void OnSetPlayerState_Event();                                                                                           // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.OnIsAlive_Event
	// void OnIsAlive_Event();                                                                                                  // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.OnSetCurrentGun_Event
	// void OnSetCurrentGun_Event(class AItem_Gun_General* OldCurrentGun);                                                      // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_TP.ABP_CharacterPG_TP_C.ExecuteUbergraph_ABP_CharacterPG_TP
	// void ExecuteUbergraph_ABP_CharacterPG_TP(int32_t EntryPoint);                                                            // [0x2c97800] Final                
};

/// Class /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C
/// Size: 0x8E28 (36392 bytes) (0x000348 - 0x008E28) align 16 MaxSize: 0x8E28
class UABP_CharacterPG_FP_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0348   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	unsigned char                                      __AnimBlueprintMutables_unkBecDupClass_FAnimBlueprintGeneratedMutableData[64]; // 0x0358   (0x0040)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0398   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x03A0   (0x0008)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x03A8   (0x0128)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x04D0   (0x0020)  
	FAnimNode_BlendListByEnum                          AnimGraphNode_BlendListByEnum;                              // 0x04F0   (0x0048)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0538   (0x0020)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x0558   (0x0040)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x0598   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x06A0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose0;                               // 0x06C8   (0x0028)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x06F0   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult;                             // 0x0710   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult1;                            // 0x0738   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult2;                            // 0x0760   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult3;                            // 0x0788   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult4;                            // 0x07B0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult5;                            // 0x07D8   (0x0028)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive;                                // 0x0800   (0x00C8)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose6;                               // 0x08C8   (0x0028)  
	FAnimNode_TwoWayBlend                              AnimGraphNode_TwoWayBlend;                                  // 0x08F0   (0x00C8)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x09B8   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult;                                  // 0x0A00   (0x0020)  
	FAnimNode_ApplyAdditive                            AnimGraphNode_ApplyAdditive7;                               // 0x0A20   (0x00C8)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose8;                               // 0x0AE8   (0x0028)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer9;                              // 0x0B10   (0x0048)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult10;                                // 0x0B58   (0x0020)  
	FAnimNode_StateMachine                             AnimGraphNode_StateMachine;                                 // 0x0B78   (0x00C8)  
	FAnimNode_StateResult                              AnimGraphNode_StateResult11;                                // 0x0C40   (0x0020)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult12;                           // 0x0C60   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult13;                           // 0x0C88   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult14;                           // 0x0CB0   (0x0028)  
	FAnimNode_TransitionResult                         AnimGraphNode_TransitionResult15;                           // 0x0CD8   (0x0028)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace16;                      // 0x0D00   (0x0020)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone;                                     // 0x0D20   (0x00F0)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace17;                      // 0x0E10   (0x0020)  
	unsigned char                                      UnknownData01_7[0x7FF8];                                    // 0x0E30   (0x7FF8)  MISSED


	/// Functions
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.BasePose
	// void BasePose(FPoseLink& BasePose);                                                                                      // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.GunLocomotion
	// void GunLocomotion(FPoseLink BaseFinal, FPoseLink& GunLocomotion);                                                       // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.PoseBlending
	// void PoseBlending(FPoseLink BaseLocomotion, FPoseLink BasePose, FPoseLink& PoseBlending);                                // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.BaseLocomotion
	// void BaseLocomotion(FPoseLink& BaseLocomotion);                                                                          // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.FootStep_Cloth
	// void FootStep_Cloth();                                                                                                   // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.JumpEvent
	// void JumpEvent(bool IsStart);                                                                                            // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.CacheGunModulesValues
	// void CacheGunModulesValues();                                                                                            // [0x2c97800] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.CacheGunValues
	// void CacheGunValues();                                                                                                   // [0x2c97800] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.BlueprintThreadSafeUpdateAnimation
	// void BlueprintThreadSafeUpdateAnimation(float DeltaTime);                                                                // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.FootStep
	// void FootStep(bool RightLeg);                                                                                            // [0x2c97800] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TwoWayBlend_D8EEEECA486AF0B93998CEA556C4DE71
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TwoWayBlend_D8EEEECA486AF0B93998CEA556C4DE71(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_ModifyBone_1B66EDF44A1FFFB4DE8C2486A21A0D77
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_ModifyBone_1B66EDF44A1FFFB4DE8C2486A21A0D77(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TwoWayBlend_308D3AEA40AE877C3E1186BDEB59709F
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TwoWayBlend_308D3AEA40AE877C3E1186BDEB59709F(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_ModifyBone_F7759FAE4A6C8A0468115694FB42C5A4
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_ModifyBone_F7759FAE4A6C8A0468115694FB42C5A4(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_970718284095E341DF3407AD8CCC437A
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_970718284095E341DF3407AD8CCC437A(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_D672B8AD4C4774C39A319E8D4E05B8F2
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_D672B8AD4C4774C39A319E8D4E05B8F2(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_7D66503C42CABAB9ADC810ADC30035E4
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_7D66503C42CABAB9ADC810ADC30035E4(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_1CF6A3BE45EA072884A7B196C7F3F7CE
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_1CF6A3BE45EA072884A7B196C7F3F7CE(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_BlendSpacePlayer_3E3B2F27417B56EA3F9EE48117118F0B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_BlendSpacePlayer_3E3B2F27417B56EA3F9EE48117118F0B(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_RotateRootBone_CCD03C174196DFE3ECC98083C405ABE3
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_RotateRootBone_CCD03C174196DFE3ECC98083C405ABE3(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_0A775297491CB6D8EF1D678521C50D1B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_0A775297491CB6D8EF1D678521C50D1B(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_7D12E5EB4CA6A60836D80A913DAB50C5
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_7D12E5EB4CA6A60836D80A913DAB50C5(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_CA7FA45B4F7487FAD4B1A9A8D8395F17
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_CA7FA45B4F7487FAD4B1A9A8D8395F17(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_2887DBE845DF5D51CFAE8A819BFC1DD4
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_2887DBE845DF5D51CFAE8A819BFC1DD4(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_50A36B6940E9695644F679AFD3DBCDB3
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_50A36B6940E9695644F679AFD3DBCDB3(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_523B8E6545F8CAEA09CB60A7C4C3B5B6
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_523B8E6545F8CAEA09CB60A7C4C3B5B6(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_254406EC4279CF2B786321BCE20A2311
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_254406EC4279CF2B786321BCE20A2311(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_A849066E4A16BFE40C1BF9AC3B660049
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_A849066E4A16BFE40C1BF9AC3B660049(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_C8CDA2D54B811A23CB1F8C9299735AD1
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_C8CDA2D54B811A23CB1F8C9299735AD1(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_42AEC4144575B9A813C1FE906CB269E9
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_42AEC4144575B9A813C1FE906CB269E9(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_6D3C596043C6848BE595B1BCD6AE4627
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_6D3C596043C6848BE595B1BCD6AE4627(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_D08CF40346943E1E1A62308143787BD7
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_D08CF40346943E1E1A62308143787BD7(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_BlendSpacePlayer_161E020840422278B47ED2891C976B3C
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_BlendSpacePlayer_161E020840422278B47ED2891C976B3C(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_EC2BB4F94E84868F054695B1076C9452
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_EC2BB4F94E84868F054695B1076C9452(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_E73940E140E86455224A529D5212739A
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_E73940E140E86455224A529D5212739A(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_F245B72F4D80BA207E264496511B1049
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_F245B72F4D80BA207E264496511B1049(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_1D1BA0B5425BD1B94B561BAC631F68C2
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_1D1BA0B5425BD1B94B561BAC631F68C2(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_B403FE0040230F3C2CC7669161E4E054
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_B403FE0040230F3C2CC7669161E4E054(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_ApplyAdditive_354125F4431650839A2DD691F11D56DB
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_ApplyAdditive_354125F4431650839A2DD691F11D56DB(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_C030784F42C7BAA9E23EFB81EA617AD4
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_C030784F42C7BAA9E23EFB81EA617AD4(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_E0F79D8940419DB47C207EBB7F0C5ED2
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_E0F79D8940419DB47C207EBB7F0C5ED2(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_B40BA28549B31553A8B73393156D9CF2
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_B40BA28549B31553A8B73393156D9CF2(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TwoWayBlend_61A629464B16C6FE4399C696F1F2E32D
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TwoWayBlend_61A629464B16C6FE4399C696F1F2E32D(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_74E33F784E5487D4CB783FB1E231B9DC
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_74E33F784E5487D4CB783FB1E231B9DC(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_F90171B14028060A7C99E99A6273B3C6
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_F90171B14028060A7C99E99A6273B3C6(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_3E5A41E346BAAEB04609E5B6D5B62E54
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_3E5A41E346BAAEB04609E5B6D5B62E54(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_F2B849EC484BA0420C9FEA916D15202B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_F2B849EC484BA0420C9FEA916D15202B(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_C6351B6248809561B39B449E31905C80
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_C6351B6248809561B39B449E31905C80(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_B2F5B21840B64BFFE858AAAAC4D15335
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_B2F5B21840B64BFFE858AAAAC4D15335(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_067A3D1A4A7E52E04EFB2B81E4A10FB0
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_067A3D1A4A7E52E04EFB2B81E4A10FB0(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_83F580F74242F893E139D7A104F71ACA
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_83F580F74242F893E139D7A104F71ACA(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_D9FE0D384430F67A4A8D259395545D6B
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_D9FE0D384430F67A4A8D259395545D6B(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_576D56414029B84939EA06A22BCA4EAF
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_576D56414029B84939EA06A22BCA4EAF(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_F64BB4E0451B9A7D2B986C96793F98EE
	// void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CharacterPG_FP_AnimGraphNode_TransitionResult_F64BB4E0451B9A7D2B986C96793F98EE(); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.AnimNotify_FootStep_L
	// void AnimNotify_FootStep_L();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.AnimNotify_FootStep_R
	// void AnimNotify_FootStep_R();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.AnimNotify_Jump_End
	// void AnimNotify_Jump_End();                                                                                              // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.AnimNotify_Jump_Start
	// void AnimNotify_Jump_Start();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.AnimNotify_FootStep_Cloth
	// void AnimNotify_FootStep_Cloth();                                                                                        // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.BlueprintUpdateAnimation
	// void BlueprintUpdateAnimation(float DeltaTimeX);                                                                         // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.BlueprintInitializeAnimation
	// void BlueprintInitializeAnimation();                                                                                     // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.OnSetPlayerState_Event
	// void OnSetPlayerState_Event();                                                                                           // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.Event On Jumped
	// void EventOnJumped();                                                                                                    // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.OnSetCurrentGun_Event
	// void OnSetCurrentGun_Event(class AItem_Gun_General* OldCurrentGun);                                                      // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.OnAiming_Event
	// void OnAiming_Event(class AItem_Module_Optic* OpticItem);                                                                // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/Assets/Animations/ABP_CharacterPG_FP.ABP_CharacterPG_FP_C.ExecuteUbergraph_ABP_CharacterPG_FP
	// void ExecuteUbergraph_ABP_CharacterPG_FP(int32_t EntryPoint);                                                            // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Game/GameTools/BP_RedLine.BP_RedLine_C
/// Size: 0x02AA (682 bytes) (0x000290 - 0x0002AA) align 8 MaxSize: 0x02AA
class ABP_RedLine_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0298   (0x0008)  
	class USplineComponent*                            Spline;                                                     // 0x02A0   (0x0008)  
	bool                                               Close_;                                                     // 0x02A8   (0x0001)  
	ETeam                                              Team;                                                       // 0x02A9   (0x0001)  


	/// Functions
	// Function /Game/Blueprints/Game/GameTools/BP_RedLine.BP_RedLine_C.SetPosition
	// void SetPosition(int32_t PointIndex);                                                                                    // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_RedLine.BP_RedLine_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_RedLine.BP_RedLine_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_RedLine.BP_RedLine_C.OnSetTeam_Event
	// void OnSetTeam_Event();                                                                                                  // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_RedLine.BP_RedLine_C.OnSetPlayerState_Event
	// void OnSetPlayerState_Event();                                                                                           // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_RedLine.BP_RedLine_C.ExecuteUbergraph_BP_RedLine
	// void ExecuteUbergraph_BP_RedLine(int32_t EntryPoint);                                                                    // [0x2c97800] Final                
};

/// Class /Game/Blueprints/Game/GameTools/BP_TeamBase.BP_TeamBase_C
/// Size: 0x02B0 (688 bytes) (0x000298 - 0x0002B0) align 8 MaxSize: 0x02B0
class ABP_TeamBase_C : public ATeamBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0298   (0x0008)  
	class UWidgetComponent*                            Widget;                                                     // 0x02A0   (0x0008)  
	class UBillboardComponent*                         Billboard;                                                  // 0x02A8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Game/GameTools/BP_TeamBase.BP_TeamBase_C.SetVisibleFromDistance
	// void SetVisibleFromDistance();                                                                                           // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_TeamBase.BP_TeamBase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_TeamBase.BP_TeamBase_C.ExecuteUbergraph_BP_TeamBase
	// void ExecuteUbergraph_BP_TeamBase(int32_t EntryPoint);                                                                   // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Game/GameTools/BP_ControlPoint.BP_ControlPoint_C
/// Size: 0x0318 (792 bytes) (0x000300 - 0x000318) align 8 MaxSize: 0x0318
class ABP_ControlPoint_C : public AControlPoint
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0300   (0x0008)  
	class UBillboardComponent*                         Billboard;                                                  // 0x0308   (0x0008)  
	class UWidgetComponent*                            Widget;                                                     // 0x0310   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Game/GameTools/BP_ControlPoint.BP_ControlPoint_C.BeginOverlap
	// void BeginOverlap(class AActor* InputPin);                                                                               // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_ControlPoint.BP_ControlPoint_C.EndOverlap
	// void EndOverlap(class AActor* OtherActor);                                                                               // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_ControlPoint.BP_ControlPoint_C.SetVisibleFromDistance
	// void SetVisibleFromDistance();                                                                                           // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_ControlPoint.BP_ControlPoint_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x2c97800] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_ControlPoint.BP_ControlPoint_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_ControlPoint.BP_ControlPoint_C.OnComponentBeginOverlap_Event
	// void OnComponentBeginOverlap_Event(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_ControlPoint.BP_ControlPoint_C.OnComponentEndOverlap_Event
	// void OnComponentEndOverlap_Event(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/GameTools/BP_ControlPoint.BP_ControlPoint_C.ExecuteUbergraph_BP_ControlPoint
	// void ExecuteUbergraph_BP_ControlPoint(int32_t EntryPoint);                                                               // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C
/// Size: 0x0870 (2160 bytes) (0x000740 - 0x000870) align 16 MaxSize: 0x0870
class ABP_PG_Game_Character_C : public APG_Game_Character
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0740   (0x0008)  
	class UTransformCullerComponent*                   TransformCuller;                                            // 0x0748   (0x0008)  
	class UStaticMeshComponent*                        SM_Chr_Attach_Patch_Squad_03;                               // 0x0750   (0x0008)  
	class UStaticMeshComponent*                        SM_Item_Crowbar_01;                                         // 0x0758   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchB_01;                                        // 0x0760   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Glowstick_03;                                     // 0x0768   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_01;                                        // 0x0770   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_02;                                        // 0x0778   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_04;                                        // 0x0780   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Glowstick_01;                                     // 0x0788   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Glowstick_02;                                     // 0x0790   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_03;                                        // 0x0798   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Radio_02;                                         // 0x07A0   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Radio_01;                                         // 0x07A8   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Mag_04;                                     // 0x07B0   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_07;                                        // 0x07B8   (0x0008)  
	class UStaticMeshComponent*                        Equipment_TactFlashlight_01;                                // 0x07C0   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Grenade_Flash_01;                                 // 0x07C8   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Grenade_Smoke_01;                                 // 0x07D0   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Grenade_03;                                 // 0x07D8   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Grenade_04;                                 // 0x07E0   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Scissors_01;                                      // 0x07E8   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_06;                                        // 0x07F0   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_05;                                        // 0x07F8   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Grenade_02;                                 // 0x0800   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Grenade_01;                                 // 0x0808   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Mag_01;                                     // 0x0810   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Mag_02;                                     // 0x0818   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Mag_03;                                     // 0x0820   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Belt;                                             // 0x0828   (0x0008)  
	class UStaticMeshComponent*                        Holster_mesh;                                               // 0x0830   (0x0008)  
	float                                              Timeline_NeutralizationVignetteImpact_Aplha_C3DAEC164EEEDF0B1E076F90BD0F5BC3; // 0x0838   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_NeutralizationVignetteImpact__Direction_C3DAEC164EEEDF0B1E076F90BD0F5BC3; // 0x083C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x083D   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline_NeutralizationVignetteImpact;                      // 0x0840   (0x0008)  
	float                                              Timeline_PostProcessScopeBlurWeight_Alpha_3680AFA946185937314F8B81F52A2B4F; // 0x0848   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_PostProcessScopeBlurWeight__Direction_3680AFA946185937314F8B81F52A2B4F; // 0x084C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x084D   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline_PostProcessScopeBlurWeight;                        // 0x0850   (0x0008)  
	class UMaterialInstanceDynamic*                    MI_ScopeBlur;                                               // 0x0858   (0x0008)  
	class UMaterialInstanceDynamic*                    MI_GunBlur;                                                 // 0x0860   (0x0008)  
	double                                             SaveNeutralizationFire;                                     // 0x0868   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.DeleteUnnecessaryObjectsOnServer
	// void DeleteUnnecessaryObjectsOnServer();                                                                                 // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.SetCorrectiveFovMaterialImplementation
	// void SetCorrectiveFovMaterialImplementation(bool useFovMaterial);                                                        // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.SetVisibleMarkerByDistance
	// void SetVisibleMarkerByDistance();                                                                                       // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.OnAiming
	// void OnAiming(class AItem_Module_Optic* Optic);                                                                          // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.SetPlayerLooksOverride
	// void SetPlayerLooksOverride(class APG_Game_Character* Character, bool IsLooks);                                          // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.Timeline_NeutralizationVignetteImpact__FinishedFunc
	// void Timeline_NeutralizationVignetteImpact__FinishedFunc();                                                              // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.Timeline_NeutralizationVignetteImpact__UpdateFunc
	// void Timeline_NeutralizationVignetteImpact__UpdateFunc();                                                                // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.Timeline_PostProcessScopeBlurWeight__FinishedFunc
	// void Timeline_PostProcessScopeBlurWeight__FinishedFunc();                                                                // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.Timeline_PostProcessScopeBlurWeight__UpdateFunc
	// void Timeline_PostProcessScopeBlurWeight__UpdateFunc();                                                                  // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature
	// void BndEvt__BP_PG_Character_WeaponComponent_K2Node_ComponentBoundEvent_0_OnAimingDelegate__DelegateSignature(class AItem_Module_Optic* OpticItem); // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.OnIsAlive_Event
	// void OnIsAlive_Event();                                                                                                  // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.SetPlayerLooks
	// void SetPlayerLooks(class APG_Game_Character* Character, bool bIsLooks);                                                 // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.CameraNeutralizationEffectEvent
	// void CameraNeutralizationEffectEvent(float Damage);                                                                      // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.EventTakeDamage
	// void EventTakeDamage(FVector& Origin);                                                                                   // [0x2c97800] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.Respawn
	// void Respawn();                                                                                                          // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.HitAtProtectedCharacter
	// void HitAtProtectedCharacter();                                                                                          // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.DeathEvent
	// void DeathEvent(class APG_PlayerState_Game* killer, EPlayerDeathType deathType);                                         // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.OnJumped
	// void OnJumped();                                                                                                         // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Character/BP_PG_Game_Character.BP_PG_Game_Character_C.ExecuteUbergraph_BP_PG_Game_Character
	// void ExecuteUbergraph_BP_PG_Game_Character(int32_t EntryPoint);                                                          // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C
/// Size: 0x0371 (881 bytes) (0x000348 - 0x000371) align 8 MaxSize: 0x0371
class ABP_PG_SpectatorPawn_C : public APG_SpectatorPawn
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0348   (0x0008)  
	unsigned char                                      UnknownData00_7[0x21];                                      // 0x0350   (0x0021)  MISSED


	/// Functions
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.ChangeSpeedMultiplier
	// void ChangeSpeedMultiplier(double AxisValue);                                                                            // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.ChangeSpeedByWheel
	// void ChangeSpeedByWheel(double AxisValue);                                                                               // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.Timeline_SetFOV__FinishedFunc
	// void Timeline_SetFOV__FinishedFunc();                                                                                    // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.Timeline_SetFOV__UpdateFunc
	// void Timeline_SetFOV__UpdateFunc();                                                                                      // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.InpActEvt_Sprint_K2Node_InputActionEvent
	// void InpActEvt_Sprint_K2Node_InputActionEvent(FKey Key);                                                                 // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.InpActEvt_N_K2Node_InputKeyEvent
	// void InpActEvt_N_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.InpActEvt_G_K2Node_InputKeyEvent
	// void InpActEvt_G_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.InpActEvt_RightMouseButton_K2Node_InputKeyEvent
	// void InpActEvt_RightMouseButton_K2Node_InputKeyEvent(FKey Key);                                                          // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.InpActEvt_LeftAlt_K2Node_InputKeyEvent
	// void InpActEvt_LeftAlt_K2Node_InputKeyEvent(FKey Key);                                                                   // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.InpActEvt_I_K2Node_InputKeyEvent
	// void InpActEvt_I_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.InpActEvt_B_K2Node_InputKeyEvent
	// void InpActEvt_B_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.InpActEvt_V_K2Node_InputKeyEvent
	// void InpActEvt_V_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent
	// void InpAxisKeyEvt_MouseWheelAxis_K2Node_InputAxisKeyEvent(float AxisValue);                                             // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/Spectator/BP_PG_SpectatorPawn.BP_PG_SpectatorPawn_C.ExecuteUbergraph_BP_PG_SpectatorPawn
	// void ExecuteUbergraph_BP_PG_SpectatorPawn(int32_t EntryPoint);                                                           // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Game/Player/PlayerState/BP_PG_PlayerState_Game.BP_PG_PlayerState_Game_C
/// Size: 0x0480 (1152 bytes) (0x000470 - 0x000480) align 8 MaxSize: 0x0480
class ABP_PG_PlayerState_Game_C : public APG_PlayerState_Game
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0470   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0478   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Game/Player/PlayerState/BP_PG_PlayerState_Game.BP_PG_PlayerState_Game_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerState/BP_PG_PlayerState_Game.BP_PG_PlayerState_Game_C.OnNotifyPossibilityUnlockModule_Event
	// void OnNotifyPossibilityUnlockModule_Event(FString ModuleName);                                                          // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerState/BP_PG_PlayerState_Game.BP_PG_PlayerState_Game_C.ExecuteUbergraph_BP_PG_PlayerState_Game
	// void ExecuteUbergraph_BP_PG_PlayerState_Game(int32_t EntryPoint);                                                        // [0x2c97800] Final                
};

/// Class /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C
/// Size: 0x08F8 (2296 bytes) (0x0008B8 - 0x0008F8) align 8 MaxSize: 0x08F8
class ABP_PG_PlayerController_Game_C : public APG_PlayerController_Game
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x08B8   (0x0008)  
	class UBP_EventManagerComponent_C*                 BP_EventManagerComponent;                                   // 0x08C0   (0x0008)  
	class UBP_FOVManagerComponent_Game_C*              BP_FOVManagerComponent_Game;                                // 0x08C8   (0x0008)  
	class UUI_GeneralGameScreen_C*                     UI_GeneralGameScreen;                                       // 0x08D0   (0x0008)  
	class UUI_InteractionTime_C*                       UI_InteractionTime;                                         // 0x08D8   (0x0008)  
	class UUI_CameraTransitions_DarkenScreen_C*        UI_DarkenScreen;                                            // 0x08E0   (0x0008)  
	class UUI_CaptureProcess_C*                        UI_CaptureProcess;                                          // 0x08E8   (0x0008)  
	class UUI_KillCam_C*                               UI_KillerInfo;                                              // 0x08F0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.Reset
	// void Reset();                                                                                                            // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.ToggleVisibilityInterface
	// void ToggleVisibilityInterface(bool ForceVisible);                                                                       // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.UserConstructionScript
	// void UserConstructionScript();                                                                                           // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.InpActEvt_Escape_K2Node_InputKeyEvent
	// void InpActEvt_Escape_K2Node_InputKeyEvent(FKey Key);                                                                    // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.InpActEvt_Scoreboard_K2Node_InputActionEvent
	// void InpActEvt_Scoreboard_K2Node_InputActionEvent(FKey Key);                                                             // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.InpActEvt_ChatAll_K2Node_InputActionEvent
	// void InpActEvt_ChatAll_K2Node_InputActionEvent(FKey Key);                                                                // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.InpActEvt_ChatTeam_K2Node_InputActionEvent
	// void InpActEvt_ChatTeam_K2Node_InputActionEvent(FKey Key);                                                               // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.InpActEvt_HideInterface_K2Node_InputActionEvent
	// void InpActEvt_HideInterface_K2Node_InputActionEvent(FKey Key);                                                          // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.InpActEvt_M_K2Node_InputKeyEvent
	// void InpActEvt_M_K2Node_InputKeyEvent(FKey Key);                                                                         // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent
	// void InpActEvt_MiddleMouseButton_K2Node_InputKeyEvent(FKey Key);                                                         // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.SetPlayerState
	// void SetPlayerState();                                                                                                   // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.OnAddedGameScore_Event
	// void OnAddedGameScore_Event(TArray<FScoreInfoBlueprint>& ScoreInfos);                                                    // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.OpenScoreboard
	// void OpenScoreboard();                                                                                                   // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.CloseScoreboard
	// void CloseScoreboard();                                                                                                  // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.DisplayMessageToChatEvent
	// void DisplayMessageToChatEvent(FGameChatMessage Message);                                                                // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.StartInteractionEvent
	// void StartInteractionEvent(float interactionTime);                                                                       // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.StopInteractionEvent
	// void StopInteractionEvent();                                                                                             // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.OnPossessedPawnChanged_Event
	// void OnPossessedPawnChanged_Event(class APawn* OldPawn, class APawn* NewPawn);                                           // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.OnClientReset_Event
	// void OnClientReset_Event();                                                                                              // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.NotifyPossibilityUnlockModule
	// void NotifyPossibilityUnlockModule(class AItem_Gun_General* Gun);                                                        // [0x2c97800] BlueprintEvent       
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.OnIsAlive_Event
	// void OnIsAlive_Event();                                                                                                  // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.OnSetCharacterHiddenInGame_Event
	// void OnSetCharacterHiddenInGame_Event();                                                                                 // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_PG_PlayerController_Game.BP_PG_PlayerController_Game_C.ExecuteUbergraph_BP_PG_PlayerController_Game
	// void ExecuteUbergraph_BP_PG_PlayerController_Game(int32_t EntryPoint);                                                   // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Game/Player/PlayerController/BP_FOVManagerComponent_Game.BP_FOVManagerComponent_Game_C
/// Size: 0x00C8 (200 bytes) (0x0000C0 - 0x0000C8) align 8 MaxSize: 0x00C8
class UBP_FOVManagerComponent_Game_C : public UFOVManagerComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00C0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_FOVManagerComponent_Game.BP_FOVManagerComponent_Game_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_FOVManagerComponent_Game.BP_FOVManagerComponent_Game_C.OnPossessedPawnChanged_Event
	// void OnPossessedPawnChanged_Event(class APawn* OldPawn, class APawn* NewPawn);                                           // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_FOVManagerComponent_Game.BP_FOVManagerComponent_Game_C.OnAiming_Event
	// void OnAiming_Event(class AItem_Module_Optic* OpticItem);                                                                // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_FOVManagerComponent_Game.BP_FOVManagerComponent_Game_C.ExecuteUbergraph_BP_FOVManagerComponent_Game
	// void ExecuteUbergraph_BP_FOVManagerComponent_Game(int32_t EntryPoint);                                                   // [0x2c97800] Final                
};

/// Class /Game/Blueprints/Game/Player/PlayerController/BP_EventManagerComponent.BP_EventManagerComponent_C
/// Size: 0x00A8 (168 bytes) (0x0000A0 - 0x0000A8) align 8 MaxSize: 0x00A8
class UBP_EventManagerComponent_C : public UEventManagerComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_EventManagerComponent.BP_EventManagerComponent_C.OnAmmoBoxAction
	// void OnAmmoBoxAction();                                                                                                  // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Game/Player/PlayerController/BP_EventManagerComponent.BP_EventManagerComponent_C.ExecuteUbergraph_BP_EventManagerComponent
	// void ExecuteUbergraph_BP_EventManagerComponent(int32_t EntryPoint);                                                      // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Underbarrel/BP_Item_Underbarrel_Default.BP_Item_Underbarrel_Default_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Item_Underbarrel_Default_C : public AItem_Module_Underbarrel
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Optic/BP_Item_Optic_DefaultOptic.BP_Item_Optic_DefaultOptic_C
/// Size: 0x0390 (912 bytes) (0x000390 - 0x000390) align 8 MaxSize: 0x0390
class ABP_Item_Optic_DefaultOptic_C : public AItem_Module_Optic
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Barrel/BP_Item_Barrel_DefaultBarrel.BP_Item_Barrel_DefaultBarrel_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Item_Barrel_DefaultBarrel_C : public AItem_Module_Barrel
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Accessory/BP_Item_Accessory_DefaultAccessory.BP_Item_Accessory_DefaultAccessory_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Item_Accessory_DefaultAccessory_C : public AItem_Module_Accessory
{ 
public:
};

/// Class /Game/Blueprints/Game/BP_PG_GameMode_Game.BP_PG_GameMode_Game_C
/// Size: 0x03D8 (984 bytes) (0x0003D0 - 0x0003D8) align 8 MaxSize: 0x03D8
class ABP_PG_GameMode_Game_C : public APG_GameMode_Game
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x03D0   (0x0008)  
};

/// Class /Game/Blueprints/General/Tools/BPFL_General.BPFL_General_C
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UBPFL_General_C : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Game/Blueprints/General/Tools/BPFL_General.BPFL_General_C.Convert Corrency Code To Sign
	// void ConvertCorrencyCodeToSign(FString CurrencyCode, class UObject* __WorldContext, FText& Sign);                        // [0x2c97800] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Tools/BPFL_General.BPFL_General_C.GetRareColor
	// void GetRareColor(EItemRareType Rare, class UObject* __WorldContext, FLinearColor& NewParam);                            // [0x2c97800] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/General/Tools/BPFL_General.BPFL_General_C.GetDefaultModuleClassByType
	// void GetDefaultModuleClassByType(EGunModuleType moduleType, class UObject* __WorldContext, class UClass*& DefaultModuleClass); // [0x2c97800] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/General/Tools/BPFL_General.BPFL_General_C.GetActorRelativeLocation
	// FVector GetActorRelativeLocation(class AActor* ParentActor, class AActor* ChildActor, class UObject* __WorldContext);    // [0x2c97800] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/General/Tools/BPFL_General.BPFL_General_C.GetGameInstance
	// void GetGameInstance(class UObject* __WorldContext, class UBP_PG_GameInstance_C*& MyGameIntance);                        // [0x2c97800] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/General/Tools/BPFL_General.BPFL_General_C.GetGameModeBP_Game
	// void GetGameModeBP_Game(class UObject* __WorldContext, class ABP_PG_GameMode_Game_C*& MyGameMode);                       // [0x2c97800] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprints/General/Tools/BPFL_General.BPFL_General_C.GetGameStateBP
	// void GetGameStateBP(class UObject* __WorldContext, class ABP_PG_GameState_Game_C*& MyGameState);                         // [0x2c97800] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
};

/// Class /Game/Blueprints/Menu/Player/PlayerState/BP_PG_PlayerState_Menu.BP_PG_PlayerState_Menu_C
/// Size: 0x03D0 (976 bytes) (0x0003C8 - 0x0003D0) align 8 MaxSize: 0x03D0
class ABP_PG_PlayerState_Menu_C : public APG_PlayerState_Menu
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x03C8   (0x0008)  
};

/// Class /Game/Blueprints/Menu/Player/PlayerController/BP_PG_PlayerController_Menu.BP_PG_PlayerController_Menu_C
/// Size: 0x08C8 (2248 bytes) (0x000888 - 0x0008C8) align 8 MaxSize: 0x08C8
class ABP_PG_PlayerController_Menu_C : public APG_PlayerController_Menu
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0888   (0x0008)  
	class UUI_Menu_GeneralMenuScreen_C*                UI_GeneralMenuScreen;                                       // 0x0890   (0x0008)  
	class ABP_PG_Menu_Character_C*                     MenuCharacter;                                              // 0x0898   (0x0008)  
	class UUI_ErrorMessage_C*                          UI_ErrorMessage;                                            // 0x08A0   (0x0008)  
	class UUI_Menu_Squad_Invite_C*                     UI_Squad_Invite;                                            // 0x08A8   (0x0008)  
	class UUI_HardLoadingScreen_C*                     UI_HardLoadingScreen;                                       // 0x08B0   (0x0008)  
	class UUI_SoftLoadingScreen_C*                     UI_SoftLoadingScreen;                                       // 0x08B8   (0x0008)  
	class UAudioComponent*                             BackgroundMusic;                                            // 0x08C0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Menu/Player/PlayerController/BP_PG_PlayerController_Menu.BP_PG_PlayerController_Menu_C.SetVisibleHardLoadingScreen
	// void SetVisibleHardLoadingScreen(bool IsVisible);                                                                        // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/PlayerController/BP_PG_PlayerController_Menu.BP_PG_PlayerController_Menu_C.SetVisibleSoftLoadingScreen
	// void SetVisibleSoftLoadingScreen(bool IsVisible);                                                                        // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/PlayerController/BP_PG_PlayerController_Menu.BP_PG_PlayerController_Menu_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/PlayerController/BP_PG_PlayerController_Menu.BP_PG_PlayerController_Menu_C.ShowError
	// void ShowError(FText& ErrorMessage, FText& ErrorDetails);                                                                // [0x2c97800] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/PlayerController/BP_PG_PlayerController_Menu.BP_PG_PlayerController_Menu_C.ExecuteUbergraph_BP_PG_PlayerController_Menu
	// void ExecuteUbergraph_BP_PG_PlayerController_Menu(int32_t EntryPoint);                                                   // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Menu/Player/Character/Animations/ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C
/// Size: 0x19C8 (6600 bytes) (0x000348 - 0x0019C8) align 16 MaxSize: 0x19C8
class UABP_CharacterPG_Menu_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0348   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	unsigned char                                      __AnimBlueprintMutables_unkBecDupClass_FAnimBlueprintGeneratedMutableData[32]; // 0x0358   (0x0020)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0378   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0380   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0388   (0x0020)  
	FAnimNode_SequencePlayer                           AnimGraphNode_SequencePlayer;                               // 0x03A8   (0x0048)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x03F0   (0x0128)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0518   (0x0020)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend;                             // 0x0538   (0x00E0)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0618   (0x0008)  MISSED
	FAnimNode_TwoBoneIK                                AnimGraphNode_TwoBoneIK;                                    // 0x0620   (0x0280)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x08A0   (0x0020)  
	FAnimNode_TwoBoneIK                                AnimGraphNode_TwoBoneIK0;                                   // 0x08C0   (0x0280)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone;                                     // 0x0B40   (0x00F0)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator;                            // 0x0C30   (0x0040)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone1;                                  // 0x0C70   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone2;                                  // 0x0D98   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone3;                                  // 0x0EC0   (0x0128)  
	FAnimNode_BlendListByBool                          AnimGraphNode_BlendListByBool;                              // 0x0FE8   (0x0048)  
	FAnimNode_SequenceEvaluator                        AnimGraphNode_SequenceEvaluator4;                           // 0x1030   (0x0040)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace5;                       // 0x1070   (0x0020)  
	FAnimNode_LayeredBoneBlend                         AnimGraphNode_LayeredBoneBlend6;                            // 0x1090   (0x00E0)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone7;                                  // 0x1170   (0x0128)  
	FAnimNode_CopyBone                                 AnimGraphNode_CopyBone8;                                    // 0x1298   (0x00F0)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace9;                       // 0x1388   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace10;                      // 0x13A8   (0x0020)  
	FAnimNode_SaveCachedPose                           AnimGraphNode_SaveCachedPose;                               // 0x13C8   (0x0108)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose;                                // 0x14D0   (0x0028)  
	FAnimNode_UseCachedPose                            AnimGraphNode_UseCachedPose11;                              // 0x14F8   (0x0028)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace12;                      // 0x1520   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace13;                      // 0x1540   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace14;                      // 0x1560   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone15;                                 // 0x1580   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone16;                                 // 0x16A8   (0x0128)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone17;                                 // 0x17D0   (0x0128)  
	class UAnimSequence*                               GunIdlePose;                                                // 0x18F8   (0x0008)  
	class ABP_PG_PlayerController_Menu_C*              PlayerController;                                           // 0x1900   (0x0008)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x1908   (0x0008)  MISSED
	FTransform                                         GunLeftHandOffset;                                          // 0x1910   (0x0060)  
	bool                                               IsGripExists;                                               // 0x1970   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x1971   (0x0007)  MISSED
	class UAnimSequence*                               GripHandPose;                                               // 0x1978   (0x0008)  
	FVector                                            IK_LeftHandPosition;                                        // 0x1980   (0x0018)  
	FRotator                                           IK_LeftHandRotation;                                        // 0x1998   (0x0018)  
	class ABP_PG_PlayerState_Menu_C*                   PlayerState;                                                // 0x19B0   (0x0008)  
	class AItem_Gun_General*                           Current_Gun;                                                // 0x19B8   (0x0008)  
	class ABP_PG_Menu_Character_C*                     Character;                                                  // 0x19C0   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Menu/Player/Character/Animations/ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/Character/Animations/ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.CacheGunModulesValues
	// void CacheGunModulesValues();                                                                                            // [0x2c97800] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/Character/Animations/ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.CacheGunValues
	// void CacheGunValues();                                                                                                   // [0x2c97800] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/Character/Animations/ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.BlueprintInitializeAnimation
	// void BlueprintInitializeAnimation();                                                                                     // [0x2c97800] Event|Public|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/Character/Animations/ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.OnSetPrimaryGun_Event
	// void OnSetPrimaryGun_Event(class AItem_Gun_General* oldGun);                                                             // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/Character/Animations/ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.OnSetPlayerState_Event
	// void OnSetPlayerState_Event();                                                                                           // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/Character/Animations/ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.OnSetGunModules_Event
	// void OnSetGunModules_Event();                                                                                            // [0x2c97800] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/Character/Animations/ABP_CharacterPG_Menu.ABP_CharacterPG_Menu_C.ExecuteUbergraph_ABP_CharacterPG_Menu
	// void ExecuteUbergraph_ABP_CharacterPG_Menu(int32_t EntryPoint);                                                          // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/Menu/Player/Character/BP_PG_Menu_Character.BP_PG_Menu_Character_C
/// Size: 0x03B0 (944 bytes) (0x0002B8 - 0x0003B0) align 8 MaxSize: 0x03B0
class ABP_PG_Menu_Character_C : public APG_Menu_Character
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B8   (0x0008)  
	class UStaticMeshComponent*                        SM_Chr_Attach_Patch_Squad_03;                               // 0x02C0   (0x0008)  
	class UStaticMeshComponent*                        SM_Item_Crowbar_01;                                         // 0x02C8   (0x0008)  
	class UStaticMeshComponent*                        SM_Item_Pencil_01;                                          // 0x02D0   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_03;                                        // 0x02D8   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchB_01;                                        // 0x02E0   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_01;                                        // 0x02E8   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_02;                                        // 0x02F0   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_04;                                        // 0x02F8   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Belt;                                             // 0x0300   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Glowstick_03;                                     // 0x0308   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Mag_03;                                     // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Mag_02;                                     // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Mag_01;                                     // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Grenade_04;                                 // 0x0328   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Grenade_03;                                 // 0x0330   (0x0008)  
	class UStaticMeshComponent*                        Equipment_TactFlashlight_01;                                // 0x0338   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Scissors_01;                                      // 0x0340   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_06;                                        // 0x0348   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Radio_01;                                         // 0x0350   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Grenade_02;                                 // 0x0358   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Grenade_01;                                 // 0x0360   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_05;                                        // 0x0368   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Grenade_Flash_01;                                 // 0x0370   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Grenade_Smoke_01;                                 // 0x0378   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Pouch_Mag_04;                                     // 0x0380   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Glowstick_01;                                     // 0x0388   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Glowstick_02;                                     // 0x0390   (0x0008)  
	class UStaticMeshComponent*                        Equipment_PouchM_07;                                        // 0x0398   (0x0008)  
	class UStaticMeshComponent*                        Equipment_Radio_02;                                         // 0x03A0   (0x0008)  
	class UStaticMeshComponent*                        Holster_mesh;                                               // 0x03A8   (0x0008)  


	/// Functions
	// Function /Game/Blueprints/Menu/Player/Character/BP_PG_Menu_Character.BP_PG_Menu_Character_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/Menu/Player/Character/BP_PG_Menu_Character.BP_PG_Menu_Character_C.ExecuteUbergraph_BP_PG_Menu_Character
	// void ExecuteUbergraph_BP_PG_Menu_Character(int32_t EntryPoint);                                                          // [0x2c97800] Final                
};

/// Class /Game/Blueprints/Menu/GameMode/BP_PG_GameMode_Menu.BP_PG_GameMode_Menu_C
/// Size: 0x0380 (896 bytes) (0x000378 - 0x000380) align 8 MaxSize: 0x0380
class ABP_PG_GameMode_Menu_C : public APG_GameMode_Menu
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0378   (0x0008)  
};

/// Class /Game/Blueprints/Menu/CameraShake_Animation.CameraShake_Animation_C
/// Size: 0x0210 (528 bytes) (0x000210 - 0x000210) align 16 MaxSize: 0x0210
class UCameraShake_Animation_C : public ULegacyCameraShake
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Base/ABP_Charm.ABP_Charm_C
/// Size: 0x08D0 (2256 bytes) (0x000348 - 0x0008D0) align 16 MaxSize: 0x08D0
class UABP_Charm_C : public UAnimInstance
{ 
public:
	unsigned char                                      UnknownData00_8[0x8];                                       // 0x0348   (0x0008)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_PropertyAccess;                      // 0x0358   (0x0008)  
	FAnimSubsystemInstance                             AnimBlueprintExtension_Base;                                // 0x0360   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0368   (0x0020)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x0388   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0390   (0x0520)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x08B0   (0x0020)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Charm/Base/ABP_Charm.ABP_Charm_C.AnimGraph
	// void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x2c97800] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Charm/Base/ABP_Charm.ABP_Charm_C.ExecuteUbergraph_ABP_Charm
	// void ExecuteUbergraph_ABP_Charm(int32_t EntryPoint);                                                                     // [0x2c97800] Final                
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Base/BP_Item_Charm_General.BP_Item_Charm_General_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Item_Charm_General_C : public AItem_Module_Charm
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Tag/BP_Item_Charm_Tag_Base.BP_Item_Charm_Tag_Base_C
/// Size: 0x0378 (888 bytes) (0x000350 - 0x000378) align 8 MaxSize: 0x0378
class ABP_Item_Charm_Tag_Base_C : public ABP_Item_Charm_General_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0350   (0x0008)  
	class UTextRenderComponent*                        TextRender;                                                 // 0x0358   (0x0008)  
	class UStaticMeshComponent*                        SM_Charm_Tag;                                               // 0x0360   (0x0008)  
	TArray<class UMaterialInterface*>                  DefaultMaterials;                                           // 0x0368   (0x0010)  


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Charm/Tag/BP_Item_Charm_Tag_Base.BP_Item_Charm_Tag_Base_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                                 // [0x2c97800] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Charm/Tag/BP_Item_Charm_Tag_Base.BP_Item_Charm_Tag_Base_C.SetCorrectiveFovMaterial
	// void SetCorrectiveFovMaterial(bool useFovMaterial);                                                                      // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Charm/Tag/BP_Item_Charm_Tag_Base.BP_Item_Charm_Tag_Base_C.ExecuteUbergraph_BP_Item_Charm_Tag_Base
	// void ExecuteUbergraph_BP_Item_Charm_Tag_Base(int32_t EntryPoint);                                                        // [0x2c97800] Final|HasDefaults    
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Strap/BP_Item_Strap_M16A4_01.BP_Item_Strap_M16A4_01_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Item_Strap_M16A4_01_C : public AItem_Module_Strap
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANone : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4.BP_Item_Skin_M16A4_12_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_M16A4_12_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_0 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_1 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4_09.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_2 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4_08.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_3 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4_07.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_4 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4_06.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_5 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4_05.BP_Item_Skin_M16A4_05_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_M16A4_05_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4_04.BP_Item_Skin_M16A4_04_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_M16A4_04_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4_03.BP_Item_Skin_M16A4_03_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_M16A4_03_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4_02.BP_Item_Skin_M16A4_02_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_M16A4_02_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/M16A4/Skins/BP_Item_Skin_M16A4_01.BP_Item_Skin_M16A4_01_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_M16A4_01_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Tag/BP_Item_Charm_Tag_07.BP_Item_Charm_Tag_07_C
/// Size: 0x0378 (888 bytes) (0x000378 - 0x000378) align 8 MaxSize: 0x0378
class ABP_Item_Charm_Tag_07_C : public ABP_Item_Charm_Tag_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Tag/BP_Item_Charm_Tag_06.BP_Item_Charm_Tag_06_C
/// Size: 0x0378 (888 bytes) (0x000378 - 0x000378) align 8 MaxSize: 0x0378
class ABP_Item_Charm_Tag_06_C : public ABP_Item_Charm_Tag_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Tag/BP_Item_Charm_Tag_05.BP_Item_Charm_Tag_05_C
/// Size: 0x0378 (888 bytes) (0x000378 - 0x000378) align 8 MaxSize: 0x0378
class ABP_Item_Charm_Tag_05_C : public ABP_Item_Charm_Tag_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Tag/BP_Item_Charm_Tag_04.BP_Item_Charm_Tag_04_C
/// Size: 0x0378 (888 bytes) (0x000378 - 0x000378) align 8 MaxSize: 0x0378
class ABP_Item_Charm_Tag_04_C : public ABP_Item_Charm_Tag_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Tag/BP_Item_Charm_Tag_03.None
/// Size: 0x0378 (888 bytes) (0x000378 - 0x000378) align 8 MaxSize: 0x0378
class ANonedup_6 : public ABP_Item_Charm_Tag_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Tag/BP_Item_Charm_Tag_02.BP_Item_Charm_Tag_02_C
/// Size: 0x0378 (888 bytes) (0x000378 - 0x000378) align 8 MaxSize: 0x0378
class ABP_Item_Charm_Tag_02_C : public ABP_Item_Charm_Tag_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Tag/BP_Item_Charm_Tag_01.None
/// Size: 0x0378 (888 bytes) (0x000378 - 0x000378) align 8 MaxSize: 0x0378
class ANonedup_7 : public ABP_Item_Charm_Tag_Base_C
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Smile/BP_Item_Charm_Smile.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_8 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Skull/BP_Item_Charm_Skull.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_9 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/RetroWave/BP_Item_Charm_RetroWave.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_10 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Pumpkin/BP_Item_Charm_Pumpkin.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_11 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Pacific/BP_Item_Charm_Pacific.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_12 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Katana/BP_Item_Charm_Katana.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_13 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Ghost/BP_Item_Charm_Ghost.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_14 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Earth/BP_Item_Charm_Earth.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_15 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/DogTag/BP_Item_Charm_DotTag_02.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_16 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/DogTag/BP_Item_Charm_DotTag_01.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_17 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Derick/BP_Item_Charm_Derick.None
/// Size: 0x0378 (888 bytes) (0x000350 - 0x000378) align 8 MaxSize: 0x0378
class ANonedup_18 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x28];                                      // 0x0350   (0x0028)  MISSED


	/// Functions
	// Function /Game/Blueprints/General/Items/Weapons/Modules/Charm/Derick/BP_Item_Charm_Derick.None.None
	// void None();                                                                                                             // [0x2c97800] Event|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Coffin/BP_Item_Charm_Coffin.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_19 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Clover/BP_Item_Charm_Clover.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_20 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Cauldron/BP_Item_Charm_Cauldron.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_21 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Bullet/BP_Item_Charm_Bullet.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_22 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Biohazard/BP_Item_Charm_Biohazard.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_23 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Bat/BP_Item_Charm_Bat.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_24 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Anchor/BP_Item_Charm_Anchor.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_25 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/Aegishjalmur/BP_Item_Charm_Aegishjalmur.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_26 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Modules/Charm/8Ball/BP_Item_Charm_8Ball.None
/// Size: 0x0358 (856 bytes) (0x000350 - 0x000358) align 8 MaxSize: 0x0358
class ANonedup_27 : public ABP_Item_Charm_General_C
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0350   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/Skins/Halloween/BP_Item_Skin_AK47_Halloween_03.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_28 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/Skins/Halloween/BP_Item_Skin_AK47_Halloween_02.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_29 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/Skins/Halloween/BP_Item_Skin_AK47_Halloween_01.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_30 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/Skins/BP_Item_Skin_AK47.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_31 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/Skins/BP_Item_Skin_AK47_09.BP_Item_Skin_AK47_09_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK47_09_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/Skins/BP_Item_Skin_AK47_08.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_32 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/Skins/BP_Item_Skin_AK47_04.BP_Item_Skin_AK47_04_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK47_04_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/Skins/BP_Item_Skin_AK47_03.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_33 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/Skins/BP_Item_Skin_AK47_02.BP_Item_Skin_AK47_02_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK47_02_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK47/Skins/BP_Item_Skin_AK47_01.BP_Item_Skin_AK47_01_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK47_01_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_34 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12.BP_Item_Skin_AK12_12_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK12_12_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_35 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_36 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12_09.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_37 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12_08.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_38 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12_07.BP_Item_Skin_AK12_07_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK12_07_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12_06.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_39 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12_05.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_40 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12_04.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_41 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12_03.BP_Item_Skin_AK12_03_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK12_03_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12_02.BP_Item_Skin_AK12_02_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK12_02_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK12/Skins/BP_Item_Skin_AK12_01.BP_Item_Skin_AK12_01_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK12_01_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Strap/BP_Item_Strap_ScarH_03.BP_Item_Strap_ScarH_03_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Item_Strap_ScarH_03_C : public AItem_Module_Strap
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Strap/BP_Item_Strap_ScarH_02.BP_Item_Strap_ScarH_02_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Item_Strap_ScarH_02_C : public AItem_Module_Strap
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Strap/BP_Item_Strap_ScarH_01.BP_Item_Strap_ScarH_01_C
/// Size: 0x0350 (848 bytes) (0x000350 - 0x000350) align 8 MaxSize: 0x0350
class ABP_Item_Strap_ScarH_01_C : public AItem_Module_Strap
{ 
public:
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_42 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_43 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_44 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH.BP_Item_Skin_ScarH_10_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_ScarH_10_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH_09.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_45 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH_08.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_46 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH_07.BP_Item_Skin_ScarH_07_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_ScarH_07_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH_06.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_47 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH_05.BP_Item_Skin_ScarH_05_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_ScarH_05_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH_04.BP_Item_Skin_ScarH_04_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_ScarH_04_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH_03.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_48 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH_02.BP_Item_Skin_ScarH_02_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_ScarH_02_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/ScarH/Skins/BP_Item_Skin_ScarH_01.BP_Item_Skin_ScarH_01_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_ScarH_01_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/Skins/BP_Item_Skin_AK74M.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_49 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/Skins/BP_Item_Skin_AK74M.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_50 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/Skins/BP_Item_Skin_AK74M_09.BP_Item_Skin_AK74M_09_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK74M_09_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/Skins/BP_Item_Skin_AK74M_08.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_51 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/Skins/BP_Item_Skin_AK74M_07.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_52 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/Skins/BP_Item_Skin_AK74M_06.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_53 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/Skins/BP_Item_Skin_AK74M_05.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_54 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/Skins/BP_Item_Skin_AK74M_04.BP_Item_Skin_AK74M_04_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK74M_04_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/Skins/BP_Item_Skin_AK74M_03.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_55 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/Skins/BP_Item_Skin_AK74M_02.BP_Item_Skin_AK74M_02_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK74M_02_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK74M/Skins/BP_Item_Skin_AK74M_01.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_56 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308.BP_Item_Skin_AK308_12_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK308_12_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_57 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308.BP_Item_Skin_AK308_10_C
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ABP_Item_Skin_AK308_10_C : public AItem_Module_Skin
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0358   (0x0008)  
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308_09.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_58 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308_08.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_59 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308_07.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_60 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308_06.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_61 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308_05.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_62 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308_04.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_63 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308_03.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_64 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308_02.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_65 : public AItem_Module_Skin
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0358   (0x0008)  MISSED
};

/// Class /Game/Blueprints/General/Items/Weapons/Guns/Primary/Rifle/AK308/Skins/BP_Item_Skin_AK308_01.None
/// Size: 0x0360 (864 bytes) (0x000358 - 0x000360) align 8 MaxSize: 0x0360
class ANonedup_66 : public AItem_Module_Skin
{ 
public:
